{"comments": [{"text": "this is true innovation", "class": 1}, {"text": "Ideas start here", "class": 1}, {"text": "It's an ambiguous statement: could be WU or UW or UUU", "class": 0}, {"text": "RegEx 4lyf", "class": 1}, {"text": "It's all fun and games until someone is too cavalier with their * operators and then as a result, you get \"Catastrophic backtracking\" causing major performance issues.. \n Sometimes it pays off to write a proper parser instead of writing a hacky regular expression taking exponential time to match.", "class": 0}, {"text": "Hold a referendum! Sever ties with U double U in favour of triple U!", "class": 1}, {"text": "INNOVATION", "class": 1}, {"text": "Water water water! U U U!", "class": 1}, {"text": "DISRUPTIVE", "class": 1}, {"text": "shut up nerd", "class": 1}, {"text": "Shit", "class": 1}, {"text": "Found you, mother fucker.", "class": 1}, {"text": "I've never been on reddit at work for more than 5 minutes and still feel unproductive as fuck.\nTo those of you who do surf the net at work, do you actually get stuff done? How do you not feel guilty? Am I just a slowpoke or are you underworked?", "class": 0}, {"text": "My co-op is always on reddit too.", "class": 0}, {"text": "There are so many Matts that are paranoid right now.", "class": 0}, {"text": "Hey! Thanks for keeping us, aspirants, motivated. Being a CBSE student(from India), I was wondering if grade 11 scores influence the admission decisions. Because I spent my entir 11th grade learning something other than what is taught in school like bit of graph theory, astrophy etc. So my 11th scores are quite <let's not talk about it> range. But I'm conceptually well ahead of my class. So I believe you'll be able to answer my question from experience. How were you're 11th grade scores? \nAlso before you judge me, I'd like to add that my predicted grades will be as high as 94% and I have an average ec, but it's related to math. ", "class": 0}, {"text": "What do you think my chances are of getting into computer engineering as an Canadian going to school in California with a 3.83 weighted gpa and a 32 act? ", "class": 0}, {"text": "Couldn't find an answer for this anywhere. When calculating your average, to what decimal place does admissions use? Like if the mark for a course is 97.48%, would they see that as 97%, 97.5%, or 97.48%?", "class": 0}, {"text": "I believe for individual marks it's just whatever the number is... meaning say if your report card/OUAC shows a 97, it'll be a 97. It won't show up as a decimal place to Waterloo. (I am speaking from an Ontario perspective - I have no clue how the grades work in other places, so if you receive your grades up to a decimal point, then I guess that's what Waterloo sees as well). \n\nFor the average, I am pretty sure they round to 2 decimal places. \nSources (from 2014, but I am sure the process hasn't changed regarding this): \n\nhttps://profbillanderson.wordpress.com/2013/09/06/admissions-2014-how-its-going-to-work/\nhttps://profbillanderson.wordpress.com/2014/04/18/april-2014-admissions-update/ \n\n(Ctrl-F \"decimal\").", "class": 0}, {"text": "Hi I'm a grade 11 (going into 12)student from Manitoba. English is not my first language and I'm told if my 4 most recent years of full-time education have not been in an English-language school system, I have to do some test they listed (as far as I know, there are IELTS, IBT, CAEL) just to show my English proficiency but I'm not sure how much high score do they want me to get on the test.", "class": 0}, {"text": "https://uwaterloo.ca/find-out-more/admissions/english-language-requirements\n\nGoogle bud.", "class": 0}, {"text": "[deleted]", "class": 0}, {"text": "Read PM", "class": 0}, {"text": "Hey I'm just wondering does anyone know the process of transferring from Software Engineering at Guelph to Computer Science at Uoftsg or Utsc. What average must you keep first year? Does highschool marks matter? And how likely will Uoft accept students trying to transfer? Do I need specific courses first year? And which credits don't get carried on? ", "class": 0}, {"text": "Wrong subreddit man.", "class": 0}, {"text": "Hey anyone here whos currently in comp eng in stream 4 and could tell me if it was really difficult to find a coop after 1 sem?", "class": 0}, {"text": "It depends on your experience/projects. The employment rate is 85% IIRC for 1A.", "class": 0}, {"text": "Hi i got a conditional acceptance to Comp sci coop but am now worried i may not meet the conditions. I need an 80 in calc but if i don't get that will I be kicked out of the program? Also this is the conditions as it is on quest\n\"You must achieve a minimum final admission average of 80% that includes required Grade 12 courses (or equivalents). You must also achieve a minimum final average of 80% in the required Mathematics courses.\" \nI thought this meant i need 80 in math, 80 in calc and 80 overall avgbetween english calc and math. but a friend of mine said it might mean 80 avg between calc and math, and 80 between all 3. Which is it? I'm really nervous please help\n", "class": 0}, {"text": "It is 80 average between English, Calc, and Advanced Functions. Your friend is wrong but you should still do your best in school since thats quite a drop. Email the school if you need to", "class": 0}, {"text": "Does that mean I need to get above 80 in my Calc class or just between the three? Because it says \"You must also achieve a minimum final average of 80% in the required Mathematics courses.\" as well so that's the part I was more confused about.", "class": 0}, {"text": "You may have different terms than what I know of. Just call the school. Also, get higher than 80 anyway", "class": 0}, {"text": "You should email future-ugrad@cs.uwaterloo.ca if you want an answer for sure. I wouldn't be surprised at either answer. That said, if you're having trouble maintaining an 80 in high school, things might not look good in first year.", "class": 0}, {"text": "If you can't maintain 80 in MCV you will struggle at UW.\n", "class": 0}, {"text": "I'm currently in grade 11, and I just want to make sure I have right courses next year for CS. I currently plan on taking English, Advanced, Calc, Comp Sci, Communications Technology, International Business, and Econ (I have to take 7 courses next year cause I have a spare this year), and my question is does waterloo and other universities look at the difficulty of your courses? The reason why I'm wondering this is because one of my friends this year got rejected with a 94-95 average, and got rejected, while another student got accepted, with the same 94-95 average. The difference between them was that the later student had harder courses: eng, adv, calc, chem, physics, comm tech, while the former student had easier courses: eng, adv, calc, comp sci, and 2 comm techs. I'm sure the later student also had a better AIF but my main question is, does taking easier('bird') courses affect your chances? If so, I might add chemistry next year, instead of an easier course.", "class": 0}, {"text": "All courses are taken as equal for as much as I know. The only difference would be between school boards. I ended up dropping chemistry in Gr 12 and still got in.", "class": 0}, {"text": "Hey guys, I'm a grade 11 student from BC interested in UW Actuarial Sciences. I'm doing pretty well in math and English (98% math 12, taking calculus next year, and 93% in English.) Getting mid 90s in physics and chem, and high 80s to low 90s in everything else. Is this enough to get into that area? Appreciate any help, especially from those who are in or have already taken the program.", "class": 0}, {"text": "98% is pretty low, I'd aim for 99.3%+ in math. Otherwise you're looking OK. Do some exams pre-university. Goose luck.", "class": 0}, {"text": "Hi, just curious has anyone here applied from the States and been accepted into Waterloo's honors co-op CS program? If so what kind of gpa/SAT do you need to get in?", "class": 0}, {"text": "If my application on the Quest portal still says 'We have received your application, but no decision has been made yet', is it a pretty safe assumption to make that I won't be admitted?", "class": 0}, {"text": "Thats really strange, everyone I know who didnt make it already got an outright rejection. Call them about it.", "class": 0}, {"text": "I will, thank you.", "class": 0}, {"text": "Still waiting to find out what happened. ", "class": 0}, {"text": "Was bounced around on the phone lines so I went in person, was told that a decision should be coming through shortly. Still haven't heard anything. Think I have five days to decide on a U of T admission, but I'd really like to stay in the city. Really upset man", "class": 0}, {"text": "Is it hard to get a work term job(coop mechanical eng), im hoping to pay back some of the high costs of tuition thru coop. Im an avg student tho, n idk if ill have a v good gpa at Waterloo", "class": 0}, {"text": "It's more about the connections and networking too, if you have that down you should have a decent (not easy but not too hard) time finding coop", "class": 0}, {"text": "If you make a decent amount, you should be able to cover tuition. I think the average amount for your second co-op is about 17 CAD/hr; I lived at home for that time and made enough to pay for tuition and living expenses. It's feasible to break even, even if it's hard at first. ", "class": 0}, {"text": "Im a decent student with a 90 avg, im going to mechanical eng coop at waterloo. Will i survive at the uni? N what r the chances of getting in a coop program n how do i make sure i got get recked. Also i haven't taken calc in highschool so im worried. Advice plez", "class": 0}, {"text": "It depends on your high school. If you feel the marks are inflated and alot of people have 90+ then do some prep in the next few months. If your 90 is one of the higher marks then you should be okay. Also note that admission averages correlate with supply and demand not difficulty, so mech eng may very well be more difficult than soft eng (where im going). If you want to be safe then do some self studying, especially calc if you have to take it", "class": 0}, {"text": "If you get a faculty-specific scholarship, would you get an email for that? Also, should it be concerning if you have a scholarship email, but no physical copy of the scholarship through mail?", "class": 0}, {"text": "Hi, I have been accepted into the Mechatronics Engineering program, and based on what others have told me, Waterloo Engineering is a very competitive program, and most of the students are trying to get an upper hand on the others. Is this true? Although I like challenges and the fulfilling courses that Waterloo engineering offers, but I also like to work collaboratively with others and ask my peers for help when I need it, and of course return the favour, so would Waterloo's competitive environment be the right place for me? Also, does each student need a certain average to continue or receive certain incentives (eg. a specific co-op) in the program? Feel free to correct me if I'm wrong about any of my assumptions, I just want an inclusive and helping environment for my university experience. Thanks for the help! :D", "class": 0}, {"text": "I haven't met a single person who wants others to do badly in my first year. Yes, there are cocky students, the student who asks 100 questions every lecture and that one student who gets 95+ who doesn't ever talk. But as for taking challenges together, I'd say most students if not all are pretty open to that.\n\nAs for certain averages, you need to obviously pass to stay in the program. And getting low averages won't help in getting good co-op, though I wouldn't say it would hinder you if you have good side projects.", "class": 0}, {"text": "Would you recommend aiming for a high average and few side projects, or better side projects and slightly better then average marks to get better coops?", "class": 0}, {"text": "Your classes should be your first priority during your term. A 65% doesn't look as good as a 80% which doesn't look as good as a 95% in first year especially if you don't have experience in the industry, which most first years don't have much of. \n\nIt never hurts to get higher grades, but it isn't the only factor employers look at. Especially down the road, your experiences are more valuable than your courses.\n", "class": 0}, {"text": "> I haven't met a single person who wants others to do badly in my first year.\n\nThen you haven't met AFM students.", "class": 1}, {"text": "You build friendships through suffering.\n\nI don't think Tron is super competitive. The nice thing about a cohort system is that you're supposed to get closer to your class, and I think it's not as cutthroat as you think.\n\nYou have a lot of opportunities to work with people since every term you have should have at least 2 group projects. We also help each other out a lot, and the upper years definitely share their resources with the younger years. ", "class": 0}, {"text": "Do AP courses help at all to be considered or should you just take normal courses so your average looks higher?", "class": 0}, {"text": "AP doesn't even show up on your Ontario transcript, so it probably wouldn't help directly in the application process. You could however claim credit for a course if you get a 4 or 5 on the relevant AP exam, although even then I don't think it's a good idea to skip the course because of that - you'll miss a couple things that you might not have learned. \n\nI took all AP Math + Science (Physics, Chem and Bio) because it was more academically interesting, but that was about it. ", "class": 0}, {"text": "Waterloo will see your AP scores if you send them in.", "class": 0}, {"text": "On your aif they do ask you to list your grade 12 courses and the level you took them at (AP, U, etc) so they will know, but I still suggest taking U since theres no guarantee it helps. No one I know who has taken a lot of AP's have benefitted from it in terms of uni acceptances.", "class": 0}, {"text": "Was this post really necessary?", "class": 0}, {"text": "No.", "class": 1}, {"text": "[Faker](https://67.media.tumblr.com/997e9b1f47b2335d1671305a0f2848de/tumblr_no3irao7kG1u0jzt2o1_r1_500.gif)\n\n", "class": 0}, {"text": "http://imgur.com/sG9sq3k", "class": 1}, {"text": "ok", "class": 1}, {"text": "u wot", "class": 1}, {"text": "Flair tip #2: You can see flairs on your mobile app as well.", "class": 0}, {"text": "This is one of the most profound questions ever asked on this sub. It must be answered!", "class": 0}, {"text": "Waterloo has an extensive coop program", "class": 0}, {"text": "LOL! So much so that we even got an engineering student going for acting.\n\n(I say engineering because pretty sure 99.9999% of leather jackets I've seen are in eng, except that one guy I've seen who's jacket says \"Faculty of Arts\" on it. Never seen him since.)", "class": 0}, {"text": "yeah WeMesh positions filled up", "class": 1}, {"text": "I'd say see here http://asianwiki.com/Cape_Nostalgia for context but that doesn't actually really give you any more insight to why he's wearing that", "class": 0}, {"text": "Looks like the director's been to Toronto, could have swung through waterloo or got it in TO. http://www.newswire.ca/news-releases/new-film-festival-connects-toronto-audiences-with-japanese-filmmakers-in-a-celebration-of-japanese-film-and-culture-509736411.html", "class": 0}, {"text": "I can only get so erect.", "class": 1}, {"text": "And the plot thickens...", "class": 0}, {"text": "This only raises more questions", "class": 0}, {"text": "[Hiroshi Abe](http://asianwiki.com/Hiroshi_Abe) is a career actor and has probably never set foot in Waterloo, ON. He's also previously been cast as a [Roman in Japan](http://asianwiki.com/Thermae_Romae) so anything goes for him.\n\nMy guess is that the production team picked up the jacket in a thrift store or something somewhere. Or maybe they wanted the jacket to be recognizable at the Montreal World Film Festival.\n\nNow I have to watch this movie to see what it's about.", "class": 0}, {"text": "The first half of thermae Romae is amazing and hilarious but it gets a lot weaker ", "class": 0}, {"text": "please keep us posted with a detailed synopsis and review of the movie once you watch it ", "class": 0}, {"text": "This is actually the greatest find ever", "class": 0}, {"text": "[Here is a better look at the jacket in some other frames](http://imgur.com/a/Zk6yl)", "class": 0}, {"text": "Furthermore, [why was this crossposted to /r/ImagesofBelgium](https://www.reddit.com/r/ImagesOfBelgium/comments/4r8hxq/why_is_he_wearing_a_waterloo_jacket/)?", "class": 0}, {"text": "> Images of is two networks of subreddits. They automatically collect image posts of time periods and places.\n\nhttps://en.wikipedia.org/wiki/Waterloo,_Belgium", "class": 0}, {"text": "MOTHER OF GOD", "class": 1}, {"text": "What i really need to know is which faculty is written on that jacket.\n\n\nbut like wtf rofl", "class": 1}, {"text": "From [this post](https://www.reddit.com/r/uwaterloo/comments/4r8hw8/why_is_he_wearing_a_waterloo_jacket/d4z78m6), I can't see his faculty/program but I think he was class of '87.", "class": 0}, {"text": "the picture inside the circle shows one arm with nothing. Looks like the guy didn't pay for any sewing (it costs an extra hundred IIRC to have the your year/class sewn on).", "class": 0}, {"text": "EXTRA HUNDRED wtf forget that just pass me a sharpie", "class": 1}, {"text": "Finally something I can cosplay.", "class": 1}, {"text": "I will post a question on the Japanese Yahoo Answers or something to see if I can find anything interesting ", "class": 1}, {"text": "Report back plz", "class": 1}, {"text": "> Asians went to UW\n\nWOAH SO SURPRISING", "class": 1}, {"text": "But that's Japanese, not Chinese/Korean", "class": 1}, {"text": "So?", "class": 1}, {"text": "> Asians went to UW", "class": 1}, {"text": "Great Scott!", "class": 1}, {"text": "Japanese are Asian.", "class": 1}, {"text": "It stands for Javascript, a modern markup language based on the popular object-oriented language Java.", "class": 0}, {"text": "> markup language\n\n> based on the popular object-oriented language Java\n\nPlease stop spreading misinformation", "class": 1}, {"text": "GTFO engineer, you know nothing about computer science. REEEEEEEEEEEEEEEE", "class": 1}, {"text": "University of Waterloo, yes. Are you feeling alright?", "class": 0}, {"text": "No, I think I'm coming down with yellow fever.", "class": 0}, {"text": "Same tbh", "class": 1}, {"text": "Ah so", "class": 1}, {"text": "Nani?!", "class": 1}, {"text": "Dafuqq\n\nWhat does the title translate to?\n", "class": 1}, {"text": "The story of the Strange Cape.\n\nThe english title though is _Cape Nostalgia_.", "class": 0}, {"text": "what the fuck\ninb4 mystery of the year", "class": 1}, {"text": "Somebody watch it and report back.", "class": 0}, {"text": "M'ladies and neckbeards, there is a new beginning for us here in /r/uwaterloo. A new mystery amongst the legends like the SAFE is born.", "class": 1}, {"text": "[When you're at a party and some fucking random steals your beer](http://imgur.com/a/jrqQR)", "class": 1}, {"text": "Same tbh", "class": 1}, {"text": "LOL", "class": 1}, {"text": "From the shot on the bottom left this is in multiple scenes too", "class": 0}, {"text": "Because he's on his way to Waterloo with his Asian family", "class": 0}, {"text": "I hate when they change the shape of the ten-ten and characters. It makes it much more difficult to read. ", "class": 1}, {"text": "I'd bet a timbit this will turn out to be an image appropriated from another source, and the artist that took it was too lazy to change the logo.  There'll be some pic of a white dude from Imprint from the early 90's that matches it or something. ", "class": 0}, {"text": "Calling dibs on that timbit", "class": 1}, {"text": "So who do you owe the Timbit to?", "class": 1}, {"text": "To whomever finds the source material", "class": 0}, {"text": "[Do I get a timbit?](https://www.amazon.co.jp/%E3%81%B5%E3%81%97%E3%81%8E%E3%81%AA%E5%B2%AC%E3%81%AE%E7%89%A9%E8%AA%9E-DVD-%E5%90%89%E6%B0%B8%E5%B0%8F%E7%99%BE%E5%90%88/dp/B00S5QR57W) [How about now?](http://eiga.com/movie/79698/gallery/6/)", "class": 1}, {"text": "I remember this sign used to be bright as **FUCK** and would basically compete with the sun and blind every driver passing by. \nIt was so fucking bright Valve added it as a replacement for the flashbang to CSGO holy jesus\n\n\nim glad they fixed that", "class": 0}, {"text": "No joke, at one point I could see it from Dana Porter", "class": 0}, {"text": "It's been like that for a few days at least and no one's gotten around to fixing it. I tried taking a photo a few days ago and the LED matrix fucked with my camera lol\nIt reminds me of a time I was at Connestoga and one of the Koodo hallway booths had a slideshow running and on the screen had \"THIS COPY OF WINDOWS IS NOT GENUINE\" in a giant dialog box. None of them could dismiss it because it was handled remotely. ", "class": 0}, {"text": "Does nobody know how to configure a damn display kiosk?\n\nThis is once again just a bad setup.  I've never had one of my displays never pull shit shit because I DISABLE things like updates.", "class": 0}, {"text": "I’d just like to interject for a moment. What you’re refering to as Windows, is in fact, NSA/Windows, or as I’ve recently taken to calling it, NSA plus Windows. Windows is not an operating system unto itself, but rather another locked down component of a fully functioning NSA system made useful by the NSA corelibs, shell utilities and vital system components comprising a full OS as defined by the government.\nMany computer users run a modified version of the NSA system every day, without realizing it. Through a peculiar turn of events, the version of NSA which is widely used today is often called “Windows”, and many of its users are not aware that it is basically the NSA system, developed by the NSA.\nThere really is a Windows, and these people are using it, but it is just a part of the system they use. Windows is the kernel: the program in the system that allocates the machine’s resources to the other programs that you run. The kernel is an essential part of an operating system, but useless by itself; it can only function in the context of a complete operating system. Windows is normally used in combination with the NSA operating system: the whole system is basically NSA with Windows added, or NSA/Windows. All the so-called “Windows” versions are really versions of NSA/Windows.", "class": 1}, {"text": "So \"NSA\" is to GNU, Windows what windows is to Linux.  \n\nFor those interested, the kernel in Mac OSX is called Darwin and is open source.  \n\nIs \"NSA\" open source?  Did the National Security Agency really name their kernel after themselves?  I've never heard anyone talk about the Windows kernel. ", "class": 0}, {"text": "https://wiki.installgentoo.com/images/2/29/Windows10.jpg", "class": 0}, {"text": "Eh, you can turn these off, and just disable auto updates through the register", "class": 0}, {"text": "Ok Rusty Shackleford", "class": 1}, {"text": "Holy cow dude, these photos are stunning! \n\nWhat gear are you rocking?", "class": 0}, {"text": "Thanks for the praise :)\n\nAll the shots were with my Sony a6000 and the 50mm lens. My only other lens is a 14mm, which I didn't use because I think it's too wide for most shots and it's also fully manual in a situation where autofocus was key.", "class": 0}, {"text": "a6000 dayumm those things are good. Kinda guessed it was Sony, judging by the colours. If I had not invested so much into Canon lenses, I'd jump lol. \n\nPS: if you're around next term, you should join us at Imprint, we always welcome great photography talent! 🙂", "class": 0}, {"text": "> Sony a6000\n\nhnnnng", "class": 1}, {"text": "U of T and UW had their own student unions came out first. Then the engineering societies (U of T, Mac, Engsoc) came out together, with so much more enthusiasm. And none of the politicising signs, for U of T. \n\nSKULE was the best though, with the flatbed truck and cannon: http://imgur.com/a/oNMmu\n\n", "class": 0}, {"text": "> SKULE was the best though\n\nThis line is giving me way too much anxiety", "class": 0}, {"text": "Nice pics! You guys killed at the parade", "class": 0}, {"text": "This was incredibly fun to shoot, so many colours! I got really good at walking backwards.\n\nThe full album is about 260 photos, that will be going up on the EngSoc flickr account soon.", "class": 0}, {"text": "These are awesome. I was watching from a rooftop and have to say you guys looked pretty badass!", "class": 0}, {"text": "Thanks! We tried to bring the hype", "class": 0}, {"text": "Damn, the underarm hair on [this girl](https://www.flickr.com/photos/liurobin/28093482535/in/album-72157670004181381/).", "class": 0}, {"text": "That's.... not a girl", "class": 0}, {"text": "Nice car.", "class": 1}, {"text": "Yeah it runs on 1 meow power", "class": 1}, {"text": "Owner has been found! Apparently it was missing for 4 days.", "class": 0}, {"text": "Bring that pussy home!", "class": 1}, {"text": "Good on ya mate", "class": 1}, {"text": "Nice man good job", "class": 0}, {"text": "Cat*", "class": 0}, {"text": "That's fucking  nice  kitty right there.  The crosseyed ones are always the most expensive.", "class": 0}, {"text": "http://i.imgur.com/iRgfR.jpg", "class": 1}, {"text": "Would you download a car?", "class": 1}, {"text": "yes", "class": 1}, {"text": "https://www.reddit.com/r/uwaterloo/comments/4qls60/serious_is_it_wise_to_invest_in_a_car/\n\nhttps://www.reddit.com/r/uwaterloo/comments/4qxazl/serious_is_it_wise_to_invest_in_a_cat/\n\n", "class": 1}, {"text": "Can't exactly tell if that's water or milk... but adult cats (and other animals) shouldn't be given milk. Just so you know.\n\nHope the lil guy finds his owner!", "class": 0}, {"text": "Yeah gave it water instead.", "class": 0}, {"text": "yo what's its make & model?", "class": 1}, {"text": "meowrarri", "class": 1}, {"text": ">meowrarri\n\n[Purrari](https://i.ytimg.com/vi/_sSwwK5NTlQ/maxresdefault.jpg)", "class": 1}, {"text": "So fluffy. Careful with those flowers fam.", "class": 0}, {"text": "nice pussy", "class": 1}, {"text": "Is that one of those newfangled organic smartcars I keep hearing about?", "class": 1}, {"text": "Not mine but I would like to keep it\n\nIt's a good one", "class": 0}, {"text": "Yeah pretty expensive", "class": 0}, {"text": "If only you were taking PSCI courses last year or the year before. Easiest course I ever TA'd for, had you watch a bunch of movies, and a few quizzes based on those movies and a final exam. Professor was amazing as well. I think he is currently on sabbatical.\n\nI can't really recommend any Spring courses unless the Middle East interests you. If it does, then Bessma Momani's course PSCI 257 might be good. Momani is an amazing professor and the course is 2nd year so not all that hard and it will be interesting. \n\nIn the Winter, PSCI 150 is a really good one. I have TA'd for that course as well. Its all introductory so the content is easy and interesting enough. The course does deal with alot of the current world issues so its highly relevant. Eric Helleiner is an amazing professor, one of the best at Waterloo.\n\nThe final course I can recommend is PSCI 244 instructed by Jingjing Huo. Course content might be a bit challenging but its still a second year course so it isn't that difficult. it is also one of the few, if not the only that has no paper writing requirements. You have a mid-term and a final. It makes your life easier and it makes the life of the poor bastard that has to mark all that easy as well. And who knows by the end of it, you too might end up joining the JingJing Huo fan club on facebook.", "class": 0}, {"text": "> makes the life of the poor bastard that has to mark all that easy as well\n\nI felt sorry for our TA, because she had to deal with my messy AF writing and inconsistent double/single spacing (kept forgetting to double space during the middle of the test). \n\nDamn, no wonder I type my notes out. It takes me longer to decipher what the hell I wrote than to actually register the knowledge in my head. \n\n> you too might end up joining the JingJing Huo fan club on facebook.\n\nI'm in that group ayy. \n\nFunny story about JJ and I. One time he mentioned how he was from Xi'an, China, which happened to also be where I was born and lived in as a little kid. I immediately put my hand up and he was like \"yes? what is your question?\" and I screamed \"YOOOO FAM WE ARE FROM THE SAME HOMETOWN!!!\" and being JJ, he responded with \"uhm so what is your question?\" \n\nAwkward. ", "class": 1}, {"text": "PSCI 150 is exactly what you're looking for", "class": 0}, {"text": "Not sure if trolling but ... \n\nwww.jackyzhai.ca/course-notes. \n\nRead my term summaries - they have detailed descriptions of the courses.\n\n I would suggest looking at 244, 252, 264. 100/150 were also nice, but nothing fancy. 259 had too much history imo, 281 was too theoretical, and 231 was boring for me (not a huge econ fan). ", "class": 0}, {"text": "*cats", "class": 1}, {"text": "Furraris", "class": 1}, {"text": "I enjoy this.", "class": 1}, {"text": "ayylmao", "class": 1}, {"text": "So the lack of creativity in this sub is apparently enough that a typo gets pointed out in a separate post. I guess it's no different from \"I think baby hippos don't get enough love in this sub\" followed by \"while you guys are sitting there gawking over hippos, I'm amazed by how cute elephants are\" type of attention and approval seeking in an anonymous setting.", "class": 0}, {"text": "What is the appeal of LoL", "class": 1}, {"text": "well it's a really fun game aside from the twenty minutes of boring shit before it actually gets interesting.\n\nHotS, the blizzard version, skips that slightly, but it's not everyones cup of tea.", "class": 0}, {"text": "ok\n\nI guess I don't really have interest in fantasy themed games\n\nI have similar levels of obsession and time invested in another game", "class": 0}, {"text": "I'm a huge fan of HoTS. It takes all the good aspects of a MOBA and makes a much more polished game. No carries, 20 minutes of farming, and much less toxicity in the community. \n\nBut I guess some people don't like teamwork and want to 1v5 to feel like hot shit. ", "class": 0}, {"text": "The only reason i used to play lol was because my friends played lol. Just a way to spend time 'with' friends. I never played on my own.", "class": 0}, {"text": "what is the appeal of umaru", "class": 1}, {"text": "Umaru is a way of life that saved me from spiralling depression\n\nIts also keks and for lads", "class": 1}, {"text": "Umaru is love Umaru is life", "class": 1}, {"text": "Didn't realize at first.. but zoom in a bit and you can see this is quite an old picture :p", "class": 0}, {"text": "How's that only a UW thing?", "class": 0}, {"text": "Using the couch / laptop as a mousepad.....", "class": 0}, {"text": "Takes maybe 5 minutes provided there are no issues.", "class": 0}, {"text": "It shouldn't take that long if cultural vistas hooked you up with the whole folder of documents. ", "class": 0}, {"text": "Greyhound typically doesn't like it too much when someone takes too long in secondary -- are you sure there's no other way?", "class": 0}, {"text": "Getting a J1 at Pearson takes like 2 minutes tops if you have all your paperwork ready. Probably not a big deal.", "class": 0}, {"text": "Today the line took 1.5 hours. :') ", "class": 1}, {"text": "Don't think so :(", "class": 0}, {"text": "Other than the first entry, entering with a J-1 shouldn't take much longer. I've done this several times without any problems. There were usually 4~5 people entering with visas on every bus trip. \n\nWhat I would recommend is taking a trip to the border (get your parents to drive you maybe) to get admitted with your J-1 prior to the bus trip if you are concerned that it might take too long. ", "class": 0}, {"text": "This info is in your pre-departure training package on Learn.", "class": 0}, {"text": "They charge you $6 extra for some reason, compared to flying. Takes the same time as flying, and it's really no big deal.", "class": 0}, {"text": "> They charge you $6 extra for some reason, compared to flying. Takes the same time as flying, and it's really no big deal.\n\nIt's the fee to issue/print an I-94. You pay for it as part of your flight taxes when you fly (so yeah - even Canadian visitors who don't need an I-94, pay for it if they're flying).", "class": 0}, {"text": "Happy birthday!\n\nI think 168 Sushi lets you eat for half-price on your birthday.", "class": 0}, {"text": "Happy birthday :)\nI know menchies give half-price yogurt of ur birthday. Have a great day !", "class": 0}, {"text": "kinkaku", "class": 1}, {"text": "contemplate on the perils of growing up", "class": 1}, {"text": "[Happy Birthday](http://img.ifcdn.com/images/b32b7f197401bfd6851bff60320c23360f729a8ed31f0b5009f94d3e3ae2b490_1.jpg)", "class": 1}, {"text": "Any ECE course. It is almost uncanny how they flock to the mere mention of an embedded circuit system.  ", "class": 1}, {"text": "I've heard most hot girls take PMATH courses (they like Rings).\n\nDon't take Arts courses, they're sausage fests.", "class": 1}, {"text": "CS452", "class": 0}, {"text": "All of the ones you don't.", "class": 1}, {"text": "Try Phils101", "class": 1}, {"text": "> 1B Women's Studies\n\nThis person knows whats up, they *study women*.", "class": 1}, {"text": "Whatever courses they want. ", "class": 0}, {"text": "Laurier 101", "class": 1}, {"text": "I took ENGL208C (Children's Literature) as an elective and the class of ~30 students had 3 men.\n\nAbout 30% of the class had red hair, which struck me as extremely unusual.", "class": 0}, {"text": "Virtually any course at UW, because women aren't herd animals.", "class": 0}, {"text": "Lots of girls take Bio courses.\n\nBIOL 309 the ratio of Female:Male was >1", "class": 0}, {"text": "You could just go outside and meet some.", "class": 0}, {"text": "You may find what you're looking for at our liberal arts department.", "class": 0}, {"text": "All the ones you're in.", "class": 0}, {"text": "any SMF course...", "class": 0}, {"text": "Psych at UW\n\nOtherwise Laurier is the place to be....", "class": 1}, {"text": "AFM101", "class": 0}, {"text": "for real?", "class": 0}, {"text": "If you remove the 'hot' part, yes.", "class": 0}, {"text": "Hahahahaha", "class": 1}, {"text": "Aesthetics 101 ", "class": 1}, {"text": "You can have mine.............. :(", "class": 1}, {"text": "-_-\nthanks though =) might drop into the women's centre since it's more discrete. thanks!\n\nany chance you know what brand it is?", "class": 1}, {"text": "> more discrete\n\nInteresting. I prefer my condoms continuous, personally.", "class": 1}, {"text": "tks for the prompt reply! i'm not to well versed in condoms et all. i looked in /r/sex and it seems the main consensus there is the main stream ones (ie durex, trojan ultrathin ones)\n\nthe crown skinless reliable? you seem to have some first hand experience w/ them! I'm always wary of buying from ebay....is that where you get yours?\n\nI DEFINITELY WILL. THIS WEEKEND MANG. but need to get this shit first LOL.", "class": 1}, {"text": "heh... a big ass-basket. heh", "class": 1}, {"text": "Side note: You don't have to be a woman to go to the Women's centre and grab this stuff. I have told a few friends and they all seem to think that you can only go to the Women's Centre if you are a woman. \n\nAlso ladies they have free pads so if you are ever caught in campus and need some they are on the same shelf as the condoms are.  \n\n", "class": 0}, {"text": "No, you have to be a **Womyn**.", "class": 1}, {"text": "Maybe if it were not called the \"Women's Centre\" ", "class": 1}, {"text": "[Congrats!](http://fc00.deviantart.net/fs71/f/2011/148/2/d/congrats_on_the_sex_by_musicrocks852-d3hh2l8.jpg)", "class": 1}, {"text": "Asks not to be upvoted. That's an upvotin'.", "class": 1}, {"text": "truth be told, i just wanted a QUICK reply and did NOT want this on the front page. some friends frequent reddit and if they found out my username and made the connection i'd never hear the end of it -_-", "class": 0}, {"text": "Never hear the end of it?? What are we, in eighth grade now?\n\n\"Hahahaha guys, look at phoenix-ikku! He's getting laid and using condoms! I'll bet he doesn't even get her pregnant or catch a disease or ANYTHING! Safe sex is for pussies, what a loooooooooser!!\"", "class": 1}, {"text": "Sex is for dicks AND pussies", "class": 1}, {"text": "Watch this become the most upvoted post on /r/uwaterloo ", "class": 0}, {"text": "AAAAAAAAAAND it is. More popular than the uwaterloo colours making it to the Reddit homepage.", "class": 1}, {"text": "It is currently the top thread of all-time in /r/uwaterloo, trolololo", "class": 1}, {"text": "well i just downvoted myself...god dammit this better not be.", "class": 1}, {"text": "surprise! a few hundred people showed up to counter your self-downvote.", "class": 1}, {"text": "Don't delete the post if you can help it. It may actually be useful to someone some day.", "class": 0}, {"text": "Currently sitting at #2, need only 50 more upvotes to be #1...\n\nEDIT: Now #1. The most popular thread in /r/uWaterloo is a dude asking for condoms lololololol.", "class": 1}, {"text": "You waited 2 months to ask this?!", "class": 0}, {"text": "better late than never?...i think that's the saying. in all literal and figurative sense lol.", "class": 0}, {"text": "Dude, it's Waterloo, not Laurier.", "class": 0}, {"text": "I wasn't referring to the school year. See his profile: /u/phoenix-ikku.", "class": 0}, {"text": ">Don't upvote\n\n\nCongratulations, you now have the 7th most upvoted post of all time in this subreddit\n\n*edit: [Now #2, with two more upboats you'll have the most upvoted post of all time here](http://i.imgur.com/N2FEP.gif)", "class": 0}, {"text": "Don't tell me what to do. Upvoted. ", "class": 0}, {"text": "Turnkey desk gives them out for free.", "class": 0}, {"text": "I think the best way to get up votes is to say don't up vote. ", "class": 0}, {"text": "They do give them out at health services. I feel like they're durex, but I could be wrong. You could also run out to a convenience store nearby, or any grocery store.", "class": 0}, {"text": "Greetings from Western Australia. I hadn't even heard of the University of Waterloo before this post, but I came to this subreddit just to upvote it after seeing it on /r/firstworldanarchists", "class": 1}, {"text": "WHAT.....=.=;; awkward. how the heck does waterloo post appear in another section O.o...\n\nbtw how are you alive? i call shenanigans. Australia and you havent been destroyed by the demon animals yet? shenanigans i say!", "class": 1}, {"text": "[deleted]", "class": 0}, {"text": "> As a bit of a forever alone\n\n64 bits?", "class": 1}, {"text": ">56 upvotes.\n\nYOU HAD ONE JOB!", "class": 1}, {"text": "You can get them from turnkey or from The Women's Centre/GLOW, both of which are located on the 2nd floor of SLC, near the Bomber. Go in, grab what you need, walk out.", "class": 0}, {"text": "There are some in vending machines in the any of the residences.", "class": 0}, {"text": "Go to Sobeys and buy condoms at the self-checkout.", "class": 0}, {"text": "Jeeze, 23 upvotes and it wasn't even approved for main page yet :P\n\nJust goes to show you can't tell the internet what to do...", "class": 1}, {"text": "next time. i'm gonna put some stupid title that'll purposely get it downvoted to hell. something like \"ARTS > EVERYONE ELSE\"........", "class": 1}, {"text": "too far", "class": 0}, {"text": "at least it wouldnt get upvoted and front paged -_-\n\ni have a bad feeling my friends are going to link this account to me and i'm going to get hell tomorrow...FML. ", "class": 0}, {"text": "Get hell for getting condoms? trolololol only at Waterloo", "class": 1}, {"text": "Dude, you're friends should be like \"congrats on the sex. Remember to wrap it\" not \"look at this idiot asking for condoms!\" \n\nYou can tell them I said they're shirty friends if try pull the second option.", "class": 1}, {"text": "thanks for the kind words =) unfortunately they went with the latter statement plus more. update up above. thanks though =) much appreciated.", "class": 0}, {"text": "Well if you need someone to talk to pm me. I'm in Waterloo and might be able to relate. ", "class": 0}, {"text": "FUCK YOU I UPVOTE WHO I WANT WHEN I WANT!", "class": 1}, {"text": "You can buy it at any pharmacy, which could help you avoid seeing people you know. Basically any Zehrs will sell it :)", "class": 0}, {"text": "See the store/pharmacy in the basement of the SLC.", "class": 0}, {"text": "Go to walmart, bro.", "class": 0}, {"text": "Just use safeway plastic bags instead, they are reusable too.", "class": 1}, {"text": "Does one actually have to attend UW to get these free condoms?  Also what is the resale value.\n\n", "class": 1}, {"text": "I am so happy that they went with interlocking stone as opposed to pavement. This looks great!", "class": 0}, {"text": "No more mud! This is fantastic! ", "class": 0}, {"text": "I wish that path was there when I was still at UW! It looks gorgeous :)", "class": 0}, {"text": "Double great news because they also paved that path from the DC Cafeteria entrance area to the area between Chemistry and MC. I was under the impression that it was only the path to the main DC entrance that was being paved.", "class": 0}, {"text": "I think they threw that in for free.", "class": 0}, {"text": "Free stuff on campus is always good. ", "class": 0}, {"text": "You grace me with your presence oh great poorophet. ", "class": 0}, {"text": "finally! can't believe it took this long :P", "class": 0}, {"text": "30 years", "class": 0}, {"text": "Great job SCI!", "class": 0}, {"text": "When I was a kid my mom told me a story from her days at Trent University about how they built a new building on campus that didn't have any paths leading up to it.  \n\nShe was confused at first, but a year later they observed where the grass was worn down around the building and that is where they built the paths.\n\nI always took that to be a story about the wisdom of academics.  Imagine my disappointment when I started attending Waterloo (which in my mind was the place where all the most intelligent people in the country were) and noticed that the paths were in all the wrong places.\n", "class": 0}, {"text": "Great job Sustainable Campus Initiative! It's been a long time coming!", "class": 0}, {"text": "[They have machines that do that in an hour, and they still rely on man power](https://i.imgur.com/KqoTo.jpg)", "class": 0}, {"text": "The fuck are you talking about, they used this machine. \n\nIve seen that baby around campus so many times -- its what they used when they interlocked the front of DC too.\n\nEDIT: Foot in mouth -- I was pretty sure I saw this thing. Now, I'm still pretty sure I did, but others are saying otherwise. I'm 100% certain I saw them use said machine for the front of DC, but I guess they didn't use it in the back?", "class": 0}, {"text": "I was literally walking by yesterday and people were manually laying down the bricks... I was having lunch at DC at 11:30-12:15, so if it was any time other than that, then I missed it", "class": 0}, {"text": "I am pretty sure this was done completely manually.", "class": 0}, {"text": "Judging by my downvotes, it seems like it wasn't...", "class": 0}, {"text": "I demand photographic proof.", "class": 0}, {"text": "As do I, of it being done manually.", "class": 0}, {"text": "I have proof.\n\nhttp://i.imgur.com/Og9EfyE.jpg\nhttp://i.imgur.com/jCaabVB.jpg", "class": 0}, {"text": "Do you think putting that kid and the Impact font will make us agree with anything you say?", "class": 1}, {"text": "No, I expect you to be able to identify the argument being raised through the use of the images.", "class": 1}, {"text": "Was it the side paths? They manually lay the starts, the ends, and the small side paths. ", "class": 0}, {"text": "It must have been, but it was a good 4 feet from the end when I saw it, so I just assumed that they did the whole thing manually\n\nEdit: The side paths still had a person putting sand for them to set the bricks on.", "class": 0}, {"text": "I could be wrong actually. The machine is expensive and I'm fairly sure I saw it, but not in use this time. So well see. ", "class": 0}, {"text": "Naw you are retarded. Was done by hand I watched.", "class": 0}, {"text": "Then the school is retarded. I watched them use the machine when they did the front path ", "class": 1}, {"text": "It seems that the machine is good for when the interlock stones are of the same size, but I bet it's a lot harder to make it work when there are stones of varying size that need to be put together nicely like the ones on the DC pathway.", "class": 0}, {"text": "Not 100 true, people still can manually arrange them in the machine. I guess if they're different sizes they'd have to be stored conveniently to reach, but they can definitely still use the machine easily so long as they do that. \n", "class": 0}, {"text": "I was wondering how they laid it so quickly. I completely forgot that machine existed. ", "class": 0}, {"text": "The WatCard song was good, the co-op song was a banger, black and gold was eh (big points for rapping about that kid yu-gi-oh duelling people in the V1 cafeteria though), and this wasn't as good as the others. The autotune was nuts.\n\nStill cool to see that someone in Waterloo can get the girls.", "class": 1}, {"text": "I missed the vid of the Dueling master and it was taken down :(", "class": 0}, {"text": "To be fair, the original song is extremely autotuned too", "class": 0}, {"text": "Appreciate your feedback, especially as someone who's well versed in all my songs! Autotune was definitely an artistic decision: it was in the spirit of typical highly autotuned song parodies, and so you guys didn't think that I thought I could actually sing :P  ", "class": 0}, {"text": "Yeah man not hating whatsoever. Definitely agree with what the other person said about the original song being autotuned to begin with. Appreciate the work you put in to the videos; the production quality is always great. Looking forward to your next projects. Your vlogs aren't too bad either!", "class": 0}, {"text": "Thanks. It's always fun to bring the crew down to Waterloo and put these vids together. I'll make sure my bars are up to scratch for the next one aha", "class": 0}, {"text": "Some of the shots in his videos are crazy good. That E5 bridge (?) drone shot in this was nice and the ending skyline.", "class": 0}, {"text": "CuckFaptchas putting the drones to use", "class": 1}, {"text": "Thanks! Flying the drone is always fun, so we try to include it in every video ", "class": 0}, {"text": "May not be the best flow-wise, but the production value was through the roof here", "class": 0}, {"text": "We definitely tried to focus more on storytelling, as I was really keen on this video idea, and I wanted to switch it up from our normal video format. I know some people appreciate lyrics a lot more - my own brother likes Co-op the most cause it actually has decent bars. Thanks though!", "class": 0}, {"text": "I still remember freaking out when he started performing at FRC worlds. What a legend ", "class": 0}, {"text": "This guy fucks", "class": 1}, {"text": "This guy ~~fucks~~ cucks\n\nFTFY", "class": 1}, {"text": "Autotune bling", "class": 1}, {"text": "Should switch to Management Engineering then I can pick up all the chicks like he does.", "class": 1}, {"text": "It's where all the bitches be.", "class": 1}, {"text": "Who is the blonde girl?", "class": 1}, {"text": "He used to be good but now he's clearly lost a step. He looks like he is trying too hard in this one.", "class": 0}, {"text": "JG you're my hero", "class": 1}, {"text": "Where can I get the 2 things with long hair he has in the video?", "class": 0}, {"text": "If this is how much time an engineer student has I should be golden in LS", "class": 0}, {"text": "Only took a day to film it..", "class": 0}, {"text": "Damn what's the name of this sample?", "class": 0}, {"text": "Cover that new Cudi now", "class": 1}, {"text": "Still, more free time compared to what my parents try to scare me to believe", "class": 0}, {"text": "JG pls teach us your ways :O", "class": 1}, {"text": "> Grills at UWaterloo in Video \n\n> Clearly Fake \n\n\n\n\n", "class": 1}, {"text": "D I S R U P T I V E", "class": 1}, {"text": "This gave me stage 4 cancer.", "class": 1}, {"text": "Not realistic. STC is always packed. You can never find an empty classroom there.", "class": 1}, {"text": "Saturday", "class": 0}, {"text": "Check the open classrooms widget on Portal", "class": 0}, {"text": "Fin to find a study space like dorsal.", "class": 1}, {"text": "Or make use of cs136 assignment 1", "class": 0}, {"text": "U wat m8?", "class": 1}, {"text": "Puts all his effort into good videography to mask the horrible music..", "class": 0}, {"text": "Is this ethnic music\n\ncan we have no more ethnic music", "class": 1}, {"text": ">literally anything UWquant posts\n\nLol.", "class": 1}, {"text": "Ayyyy", "class": 1}, {"text": "I kek'd.\n\nQuant reminds me of that guy who deleted his account some time ago who also basically only posted trolly or racist shit. Can someone remind me what his name was again?", "class": 1}, {"text": "I ain't trollin mang", "class": 1}, {"text": "Are you sure it was Yunca? He didn't post trolly or racist shit, he just used to post his very unpopular/right-winged ideologies.", "class": 1}, {"text": "> I don't think you're racist but lately you've definitely been trolly\n\nI guess. I got sick of being so serious all the time.\n\n> That's your own decision\n\nIndeed it is.. :/\n\n> If you think that's the only reason he's doing it, then sir, you are direly wrong. That's what Trump's saying to get the votes of more rednecks; his actual reasons are fuelled by his own racist agendas (and don't say he isn't racist, he's openly racist and this is widely agreed upon).\n\nI feel like the way people insinuate that all white Republicans who have a mind to think about border & national security are these stupid recknecks is actually pretty racist. The US has always been like this - as are many other countries in the world. And look what happens when you *aren't* like that: you end up like Sweden and Germany (or Chicago)\n\nMany other countries as in China, Israel.. Some of our godly cannot-be-criticized-*ever* allies. Then there is Russia, Japan, Switzerland, Denmark.. These are some pretty.Important countries and you're going to call the US population who follows a common sense approach followed by a  large part of the civilized globe \"racist\"? By this logic if you're not for wide open borders and one world government you're a racist - which is pretty convenient.\n\n> Equating ISIS to Islam and ISIS extremists to Muslims is extremely ignorant of you\n\nI didn't equate the two. I said Islam has been attacking the West for 1500 years. Have they not? Who has been trying to invade Europe through Spain for 1500 years if not Islam? Who is invading (even the Pope in all his Liberalism is now calling it such) Europe right now? Who? \n\n> Seriously dude? I thought you were better than this.\n\nUhm? You agree with me about Hillary but say this? It's obvious Hillary will be the Democratic nominee. If she wins I'm not moving to the States. What's the issue with that?\n\n> And here's a trolly snippet from comment 1:\nHonestly I don't really care either way - it's not like the illegals will be competing with me for Banking industry jobs.\n\nRight, Trump is talking about deporting the illegal immigrants. I'm saying that I support that, but if it doesn't happen because Cruz or another Republican wins, does it really make a difference to someone in banking? The complaints about them are that \"dey took er jerbs\"... Well, they can't do mine, so meh", "class": 0}, {"text": ">I guess. I got sick of being so serious all the time.\n\nTBH, same. That's why I changed my flair which has been the same since I started coming to this sub in 1A. With all the open statements to X/WPIRG/SJW/PC shit on this sub lately, I decided I'd be less serious and just troll the obvious shitposts and retarded-ass threads like [this](https://www.reddit.com/r/uwaterloo/comments/4a256g/if_i_fail_out_of_computer_engineeringcan_i/d0wv18n) one yesterday which I'd normally ignore. But as soon as you do that, the downvotes start coming in, which is why I felt compelled to add that edit.\n\n>I feel like the way people insinuate [...] which is pretty convenient.\n\nI actually agree with you here and I agree 100% with increasing border security at the Mexican border; illegal immigrants are a problem and the drugs that are smuggled into the US are too, but this guy's beliefs on immigration policies (which is a very different topic than illegal immigrants and border security) are flat out insane. Not to mention this guy said he'd deport every illegal immigrant in the states back to their country (lmao). A lot of politicians had a laugh about this one.\n\n>I didn't equate the two. I said Islam has been attacking the West for 1500 years. Have they not? Who has been trying to invade Europe through Spain for 1500 years if not Islam? Who is invading (even the Pope in all his Liberalism is now calling it such) Europe right now? Who?\n\nLet's be real here, it's pretty obvious you're misinformed on this topic: [Non-Muslims Carried Out More than 90% of All Terrorist Attacks in America](http://www.globalresearch.ca/non-muslims-carried-out-more-than-90-of-all-terrorist-attacks-in-america/5333619).\n\n>Right, Trump is talking about deporting the illegal immigrants. I'm saying that I support that, but if it doesn't happen because Cruz or another Republican wins, does it really make a difference to someone in banking? The complaints about them are that \"dey took er jerbs\"... Well, they can't do mine, so meh\n\nYeah, and it's not something that would affect most people with a decently reputable degree from a decently reputable post-secondary institution but I was just saying it was kinda trolly.\n\nThat being said, there was this from a couple weeks ago:\n\n>You guys can keep your anorexic half asian girl\n\nwhich you have to admit is pretty racist.", "class": 1}, {"text": "> Let's be real here, it's pretty obvious you're misinformed on this topic: Non-Muslims Carried Out More than 90% of All Terrorist Attacks in America.\n\nThat's completely besides the point I was making and only speaks to the hard work of the CIA and immigration officials who keep America safe.\n\n> A lot of politicians had a laugh about this one.\n\nI'm sure a lot of them laughed about giving women the right to vote too\n\nYea I guess that's kinda racist. I was pretty annoyed at how much they attacked me over my comment & lashed out a bit", "class": 0}, {"text": "uwsohard prolly same dude", "class": 1}, {"text": "there was uwsohard and someone else... uofwateroo i think? idk all i remember is that the latter went full /pol/ at the height of the whole WPIRG/referendum shitstorm\n\ncoincidentally they all have/had very similar typing styles", "class": 1}, {"text": "yea that's both the accts i remember cuz of math finance", "class": 0}, {"text": "Yunca?\n\nEdit: Nvm remembering wrong", "class": 1}, {"text": "Iirc yunca was a grad student in amath, so it can't be him.", "class": 0}, {"text": "He was pmath undergrad.", "class": 0}, {"text": "YES LOL\n\nThank you. It bothered me I couldn't remember his name.", "class": 1}, {"text": "Yeah I was giggling up until that point but I actually laughed aloud when I read that.", "class": 0}, {"text": "shoutout to the guy who opted out of the WPIRG fee and used it to pay for my Reddit gold", "class": 1}, {"text": "That's a pretty spicy maymay u got there", "class": 1}, {"text": "If I know anything about quality satire comics on uWaterloo, you're becoming a mod. Congratz!", "class": 1}, {"text": "http://i.imgur.com/QcwYzHd.jpg", "class": 1}, {"text": "#D I S R U P T", "class": 1}, {"text": "[>Bottom right corner] (http://imgur.com/gallery/D08rEwL)\n", "class": 1}, {"text": "So much OC today", "class": 1}, {"text": "We all need to do our part and make /r/uwaterloo great again.", "class": 0}, {"text": "We need to build a wall and make the geese pay for it.", "class": 1}, {"text": "oc transpo", "class": 1}, {"text": "lol this was fucking great\n\n10/10\n\ndid you draw this yourself?", "class": 1}, {"text": "Its from 4chan. ", "class": 1}, {"text": "It's... so beautiful...", "class": 1}, {"text": "I like how Auntie's kitchen being crap is a meme now.", "class": 1}, {"text": "Hey thnx for putting me in ur maymays", "class": 1}, {"text": "ur welcum my man", "class": 1}, {"text": "Quality material. So worth the gold. ❤", "class": 1}, {"text": "After taking part in the shitshow that was the original open letter thread, I am happy to see more people expressing disappointment in some of this sub's users, calling for stricter moderation, and shitting on UWquant. I don't necessarily think anything in particular needs to change, but it's a good sign that people want to make this sub less of a shithole.", "class": 0}, {"text": "Pure art", "class": 0}, {"text": "Best post 2012", "class": 1}, {"text": "Do you have the original pic?", "class": 0}, {"text": "http://boards.420chan.org/616/src/1434955374860.png", "class": 1}, {"text": "> OP's first day on /pol/", "class": 1}, {"text": "Holy shit. After seeing the original, I have even more respect for what a great job you did on the captions. A lot of them fit better in your version than in the original, like the \"I have an 85% can I get in?\" one and the very last pane with the emergency services number. Damn, absolutely brilliant.", "class": 0}, {"text": "tl dr", "class": 1}, {"text": "[vote to replace old goose with new goose](/goose)", "class": 1}, {"text": "Is E5 balcony the new place for LinkedIn pics?", "class": 0}, {"text": "yes.", "class": 1}, {"text": "[](/goose) Get the fuck out of my hood, humie [](/goose)", "class": 1}, {"text": "i genuinely love this subreddit", "class": 1}, {"text": "can we get a rap song about it?", "class": 1}, {"text": "quality picture\n\nhonk honk", "class": 1}, {"text": "I watched the geese honk and fly onto the balcony. They were loud AF.", "class": 1}, {"text": "goose version of \"get off my lawn\"", "class": 1}, {"text": "[thank mr goose honk honk](/goose)", "class": 1}, {"text": "photogenic goose", "class": 1}, {"text": "This can easily be an album cover", "class": 0}, {"text": "thank mr goose", "class": 1}, {"text": "Looks like it has been pecking away at the foam for its nest.\n", "class": 0}]}