{"comments": [{"text": "this is true innovation", "class": 1}, {"text": "Ideas start here", "class": 1}, {"text": "It's an ambiguous statement: could be WU or UW or UUU", "class": 0}, {"text": "RegEx 4lyf", "class": 1}, {"text": "It's all fun and games until someone is too cavalier with their * operators and then as a result, you get \"Catastrophic backtracking\" causing major performance issues.. \n Sometimes it pays off to write a proper parser instead of writing a hacky regular expression taking exponential time to match.", "class": 0}, {"text": "Hold a referendum! Sever ties with U double U in favour of triple U!", "class": 1}, {"text": "INNOVATION", "class": 1}, {"text": "Water water water! U U U!", "class": 1}, {"text": "DISRUPTIVE", "class": 1}, {"text": "shut up nerd", "class": 1}, {"text": "Shit", "class": 1}, {"text": "Found you, mother fucker.", "class": 1}, {"text": "I've never been on reddit at work for more than 5 minutes and still feel unproductive as fuck.\nTo those of you who do surf the net at work, do you actually get stuff done? How do you not feel guilty? Am I just a slowpoke or are you underworked?", "class": 0}, {"text": "My co-op is always on reddit too.", "class": 0}, {"text": "There are so many Matts that are paranoid right now.", "class": 0}, {"text": "Hey! Thanks for keeping us, aspirants, motivated. Being a CBSE student(from India), I was wondering if grade 11 scores influence the admission decisions. Because I spent my entir 11th grade learning something other than what is taught in school like bit of graph theory, astrophy etc. So my 11th scores are quite <let's not talk about it> range. But I'm conceptually well ahead of my class. So I believe you'll be able to answer my question from experience. How were you're 11th grade scores? \nAlso before you judge me, I'd like to add that my predicted grades will be as high as 94% and I have an average ec, but it's related to math. ", "class": 0}, {"text": "What do you think my chances are of getting into computer engineering as an Canadian going to school in California with a 3.83 weighted gpa and a 32 act? ", "class": 0}, {"text": "Couldn't find an answer for this anywhere. When calculating your average, to what decimal place does admissions use? Like if the mark for a course is 97.48%, would they see that as 97%, 97.5%, or 97.48%?", "class": 0}, {"text": "I believe for individual marks it's just whatever the number is... meaning say if your report card/OUAC shows a 97, it'll be a 97. It won't show up as a decimal place to Waterloo. (I am speaking from an Ontario perspective - I have no clue how the grades work in other places, so if you receive your grades up to a decimal point, then I guess that's what Waterloo sees as well). \n\nFor the average, I am pretty sure they round to 2 decimal places. \nSources (from 2014, but I am sure the process hasn't changed regarding this): \n\nhttps://profbillanderson.wordpress.com/2013/09/06/admissions-2014-how-its-going-to-work/\nhttps://profbillanderson.wordpress.com/2014/04/18/april-2014-admissions-update/ \n\n(Ctrl-F \"decimal\").", "class": 0}, {"text": "Hi I'm a grade 11 (going into 12)student from Manitoba. English is not my first language and I'm told if my 4 most recent years of full-time education have not been in an English-language school system, I have to do some test they listed (as far as I know, there are IELTS, IBT, CAEL) just to show my English proficiency but I'm not sure how much high score do they want me to get on the test.", "class": 0}, {"text": "https://uwaterloo.ca/find-out-more/admissions/english-language-requirements\n\nGoogle bud.", "class": 0}, {"text": "[deleted]", "class": 0}, {"text": "Read PM", "class": 0}, {"text": "Hey I'm just wondering does anyone know the process of transferring from Software Engineering at Guelph to Computer Science at Uoftsg or Utsc. What average must you keep first year? Does highschool marks matter? And how likely will Uoft accept students trying to transfer? Do I need specific courses first year? And which credits don't get carried on? ", "class": 0}, {"text": "Wrong subreddit man.", "class": 0}, {"text": "Hey anyone here whos currently in comp eng in stream 4 and could tell me if it was really difficult to find a coop after 1 sem?", "class": 0}, {"text": "It depends on your experience/projects. The employment rate is 85% IIRC for 1A.", "class": 0}, {"text": "Hi i got a conditional acceptance to Comp sci coop but am now worried i may not meet the conditions. I need an 80 in calc but if i don't get that will I be kicked out of the program? Also this is the conditions as it is on quest\n\"You must achieve a minimum final admission average of 80% that includes required Grade 12 courses (or equivalents). You must also achieve a minimum final average of 80% in the required Mathematics courses.\" \nI thought this meant i need 80 in math, 80 in calc and 80 overall avgbetween english calc and math. but a friend of mine said it might mean 80 avg between calc and math, and 80 between all 3. Which is it? I'm really nervous please help\n", "class": 0}, {"text": "It is 80 average between English, Calc, and Advanced Functions. Your friend is wrong but you should still do your best in school since thats quite a drop. Email the school if you need to", "class": 0}, {"text": "Does that mean I need to get above 80 in my Calc class or just between the three? Because it says \"You must also achieve a minimum final average of 80% in the required Mathematics courses.\" as well so that's the part I was more confused about.", "class": 0}, {"text": "You may have different terms than what I know of. Just call the school. Also, get higher than 80 anyway", "class": 0}, {"text": "You should email future-ugrad@cs.uwaterloo.ca if you want an answer for sure. I wouldn't be surprised at either answer. That said, if you're having trouble maintaining an 80 in high school, things might not look good in first year.", "class": 0}, {"text": "If you can't maintain 80 in MCV you will struggle at UW.\n", "class": 0}, {"text": "I'm currently in grade 11, and I just want to make sure I have right courses next year for CS. I currently plan on taking English, Advanced, Calc, Comp Sci, Communications Technology, International Business, and Econ (I have to take 7 courses next year cause I have a spare this year), and my question is does waterloo and other universities look at the difficulty of your courses? The reason why I'm wondering this is because one of my friends this year got rejected with a 94-95 average, and got rejected, while another student got accepted, with the same 94-95 average. The difference between them was that the later student had harder courses: eng, adv, calc, chem, physics, comm tech, while the former student had easier courses: eng, adv, calc, comp sci, and 2 comm techs. I'm sure the later student also had a better AIF but my main question is, does taking easier('bird') courses affect your chances? If so, I might add chemistry next year, instead of an easier course.", "class": 0}, {"text": "All courses are taken as equal for as much as I know. The only difference would be between school boards. I ended up dropping chemistry in Gr 12 and still got in.", "class": 0}, {"text": "Hey guys, I'm a grade 11 student from BC interested in UW Actuarial Sciences. I'm doing pretty well in math and English (98% math 12, taking calculus next year, and 93% in English.) Getting mid 90s in physics and chem, and high 80s to low 90s in everything else. Is this enough to get into that area? Appreciate any help, especially from those who are in or have already taken the program.", "class": 0}, {"text": "98% is pretty low, I'd aim for 99.3%+ in math. Otherwise you're looking OK. Do some exams pre-university. Goose luck.", "class": 0}, {"text": "Hi, just curious has anyone here applied from the States and been accepted into Waterloo's honors co-op CS program? If so what kind of gpa/SAT do you need to get in?", "class": 0}, {"text": "If my application on the Quest portal still says 'We have received your application, but no decision has been made yet', is it a pretty safe assumption to make that I won't be admitted?", "class": 0}, {"text": "Thats really strange, everyone I know who didnt make it already got an outright rejection. Call them about it.", "class": 0}, {"text": "I will, thank you.", "class": 0}, {"text": "Still waiting to find out what happened. ", "class": 0}, {"text": "Was bounced around on the phone lines so I went in person, was told that a decision should be coming through shortly. Still haven't heard anything. Think I have five days to decide on a U of T admission, but I'd really like to stay in the city. Really upset man", "class": 0}, {"text": "Is it hard to get a work term job(coop mechanical eng), im hoping to pay back some of the high costs of tuition thru coop. Im an avg student tho, n idk if ill have a v good gpa at Waterloo", "class": 0}, {"text": "It's more about the connections and networking too, if you have that down you should have a decent (not easy but not too hard) time finding coop", "class": 0}, {"text": "If you make a decent amount, you should be able to cover tuition. I think the average amount for your second co-op is about 17 CAD/hr; I lived at home for that time and made enough to pay for tuition and living expenses. It's feasible to break even, even if it's hard at first. ", "class": 0}, {"text": "Im a decent student with a 90 avg, im going to mechanical eng coop at waterloo. Will i survive at the uni? N what r the chances of getting in a coop program n how do i make sure i got get recked. Also i haven't taken calc in highschool so im worried. Advice plez", "class": 0}, {"text": "It depends on your high school. If you feel the marks are inflated and alot of people have 90+ then do some prep in the next few months. If your 90 is one of the higher marks then you should be okay. Also note that admission averages correlate with supply and demand not difficulty, so mech eng may very well be more difficult than soft eng (where im going). If you want to be safe then do some self studying, especially calc if you have to take it", "class": 0}, {"text": "If you get a faculty-specific scholarship, would you get an email for that? Also, should it be concerning if you have a scholarship email, but no physical copy of the scholarship through mail?", "class": 0}, {"text": "Hi, I have been accepted into the Mechatronics Engineering program, and based on what others have told me, Waterloo Engineering is a very competitive program, and most of the students are trying to get an upper hand on the others. Is this true? Although I like challenges and the fulfilling courses that Waterloo engineering offers, but I also like to work collaboratively with others and ask my peers for help when I need it, and of course return the favour, so would Waterloo's competitive environment be the right place for me? Also, does each student need a certain average to continue or receive certain incentives (eg. a specific co-op) in the program? Feel free to correct me if I'm wrong about any of my assumptions, I just want an inclusive and helping environment for my university experience. Thanks for the help! :D", "class": 0}, {"text": "I haven't met a single person who wants others to do badly in my first year. Yes, there are cocky students, the student who asks 100 questions every lecture and that one student who gets 95+ who doesn't ever talk. But as for taking challenges together, I'd say most students if not all are pretty open to that.\n\nAs for certain averages, you need to obviously pass to stay in the program. And getting low averages won't help in getting good co-op, though I wouldn't say it would hinder you if you have good side projects.", "class": 0}, {"text": "Would you recommend aiming for a high average and few side projects, or better side projects and slightly better then average marks to get better coops?", "class": 0}, {"text": "Your classes should be your first priority during your term. A 65% doesn't look as good as a 80% which doesn't look as good as a 95% in first year especially if you don't have experience in the industry, which most first years don't have much of. \n\nIt never hurts to get higher grades, but it isn't the only factor employers look at. Especially down the road, your experiences are more valuable than your courses.\n", "class": 0}, {"text": "> I haven't met a single person who wants others to do badly in my first year.\n\nThen you haven't met AFM students.", "class": 1}, {"text": "You build friendships through suffering.\n\nI don't think Tron is super competitive. The nice thing about a cohort system is that you're supposed to get closer to your class, and I think it's not as cutthroat as you think.\n\nYou have a lot of opportunities to work with people since every term you have should have at least 2 group projects. We also help each other out a lot, and the upper years definitely share their resources with the younger years. ", "class": 0}, {"text": "Do AP courses help at all to be considered or should you just take normal courses so your average looks higher?", "class": 0}, {"text": "AP doesn't even show up on your Ontario transcript, so it probably wouldn't help directly in the application process. You could however claim credit for a course if you get a 4 or 5 on the relevant AP exam, although even then I don't think it's a good idea to skip the course because of that - you'll miss a couple things that you might not have learned. \n\nI took all AP Math + Science (Physics, Chem and Bio) because it was more academically interesting, but that was about it. ", "class": 0}, {"text": "Waterloo will see your AP scores if you send them in.", "class": 0}, {"text": "On your aif they do ask you to list your grade 12 courses and the level you took them at (AP, U, etc) so they will know, but I still suggest taking U since theres no guarantee it helps. No one I know who has taken a lot of AP's have benefitted from it in terms of uni acceptances.", "class": 0}, {"text": "Was this post really necessary?", "class": 0}, {"text": "No.", "class": 1}, {"text": "[Faker](https://67.media.tumblr.com/997e9b1f47b2335d1671305a0f2848de/tumblr_no3irao7kG1u0jzt2o1_r1_500.gif)\n\n", "class": 0}, {"text": "http://imgur.com/sG9sq3k", "class": 1}, {"text": "ok", "class": 1}, {"text": "u wot", "class": 1}, {"text": "Flair tip #2: You can see flairs on your mobile app as well.", "class": 0}, {"text": "This is one of the most profound questions ever asked on this sub. It must be answered!", "class": 0}, {"text": "Waterloo has an extensive coop program", "class": 0}, {"text": "LOL! So much so that we even got an engineering student going for acting.\n\n(I say engineering because pretty sure 99.9999% of leather jackets I've seen are in eng, except that one guy I've seen who's jacket says \"Faculty of Arts\" on it. Never seen him since.)", "class": 0}, {"text": "yeah WeMesh positions filled up", "class": 1}, {"text": "I'd say see here http://asianwiki.com/Cape_Nostalgia for context but that doesn't actually really give you any more insight to why he's wearing that", "class": 0}, {"text": "Looks like the director's been to Toronto, could have swung through waterloo or got it in TO. http://www.newswire.ca/news-releases/new-film-festival-connects-toronto-audiences-with-japanese-filmmakers-in-a-celebration-of-japanese-film-and-culture-509736411.html", "class": 0}, {"text": "I can only get so erect.", "class": 1}, {"text": "And the plot thickens...", "class": 0}, {"text": "This only raises more questions", "class": 0}, {"text": "[Hiroshi Abe](http://asianwiki.com/Hiroshi_Abe) is a career actor and has probably never set foot in Waterloo, ON. He's also previously been cast as a [Roman in Japan](http://asianwiki.com/Thermae_Romae) so anything goes for him.\n\nMy guess is that the production team picked up the jacket in a thrift store or something somewhere. Or maybe they wanted the jacket to be recognizable at the Montreal World Film Festival.\n\nNow I have to watch this movie to see what it's about.", "class": 0}, {"text": "The first half of thermae Romae is amazing and hilarious but it gets a lot weaker ", "class": 0}, {"text": "please keep us posted with a detailed synopsis and review of the movie once you watch it ", "class": 0}, {"text": "This is actually the greatest find ever", "class": 0}, {"text": "[Here is a better look at the jacket in some other frames](http://imgur.com/a/Zk6yl)", "class": 0}, {"text": "Furthermore, [why was this crossposted to /r/ImagesofBelgium](https://www.reddit.com/r/ImagesOfBelgium/comments/4r8hxq/why_is_he_wearing_a_waterloo_jacket/)?", "class": 0}, {"text": "> Images of is two networks of subreddits. They automatically collect image posts of time periods and places.\n\nhttps://en.wikipedia.org/wiki/Waterloo,_Belgium", "class": 0}, {"text": "MOTHER OF GOD", "class": 1}, {"text": "What i really need to know is which faculty is written on that jacket.\n\n\nbut like wtf rofl", "class": 1}, {"text": "From [this post](https://www.reddit.com/r/uwaterloo/comments/4r8hw8/why_is_he_wearing_a_waterloo_jacket/d4z78m6), I can't see his faculty/program but I think he was class of '87.", "class": 0}, {"text": "the picture inside the circle shows one arm with nothing. Looks like the guy didn't pay for any sewing (it costs an extra hundred IIRC to have the your year/class sewn on).", "class": 0}, {"text": "EXTRA HUNDRED wtf forget that just pass me a sharpie", "class": 1}, {"text": "Finally something I can cosplay.", "class": 1}, {"text": "I will post a question on the Japanese Yahoo Answers or something to see if I can find anything interesting ", "class": 1}, {"text": "Report back plz", "class": 1}, {"text": "> Asians went to UW\n\nWOAH SO SURPRISING", "class": 1}, {"text": "But that's Japanese, not Chinese/Korean", "class": 1}, {"text": "So?", "class": 1}, {"text": "> Asians went to UW", "class": 1}, {"text": "Great Scott!", "class": 1}, {"text": "Japanese are Asian.", "class": 1}, {"text": "It stands for Javascript, a modern markup language based on the popular object-oriented language Java.", "class": 0}, {"text": "> markup language\n\n> based on the popular object-oriented language Java\n\nPlease stop spreading misinformation", "class": 1}, {"text": "GTFO engineer, you know nothing about computer science. REEEEEEEEEEEEEEEE", "class": 1}, {"text": "University of Waterloo, yes. Are you feeling alright?", "class": 0}, {"text": "No, I think I'm coming down with yellow fever.", "class": 0}, {"text": "Same tbh", "class": 1}, {"text": "Ah so", "class": 1}, {"text": "Nani?!", "class": 1}, {"text": "Dafuqq\n\nWhat does the title translate to?\n", "class": 1}, {"text": "The story of the Strange Cape.\n\nThe english title though is _Cape Nostalgia_.", "class": 0}, {"text": "what the fuck\ninb4 mystery of the year", "class": 1}, {"text": "Somebody watch it and report back.", "class": 0}, {"text": "M'ladies and neckbeards, there is a new beginning for us here in /r/uwaterloo. A new mystery amongst the legends like the SAFE is born.", "class": 1}, {"text": "[When you're at a party and some fucking random steals your beer](http://imgur.com/a/jrqQR)", "class": 1}, {"text": "Same tbh", "class": 1}, {"text": "LOL", "class": 1}, {"text": "From the shot on the bottom left this is in multiple scenes too", "class": 0}, {"text": "Because he's on his way to Waterloo with his Asian family", "class": 0}, {"text": "I hate when they change the shape of the ten-ten and characters. It makes it much more difficult to read. ", "class": 1}, {"text": "I'd bet a timbit this will turn out to be an image appropriated from another source, and the artist that took it was too lazy to change the logo.  There'll be some pic of a white dude from Imprint from the early 90's that matches it or something. ", "class": 0}, {"text": "Calling dibs on that timbit", "class": 1}, {"text": "So who do you owe the Timbit to?", "class": 1}, {"text": "To whomever finds the source material", "class": 0}, {"text": "[Do I get a timbit?](https://www.amazon.co.jp/%E3%81%B5%E3%81%97%E3%81%8E%E3%81%AA%E5%B2%AC%E3%81%AE%E7%89%A9%E8%AA%9E-DVD-%E5%90%89%E6%B0%B8%E5%B0%8F%E7%99%BE%E5%90%88/dp/B00S5QR57W) [How about now?](http://eiga.com/movie/79698/gallery/6/)", "class": 1}]}