{"comments": [{"text": "this is true innovation", "class": 1}, {"text": "Ideas start here", "class": 1}, {"text": "It's an ambiguous statement: could be WU or UW or UUU", "class": 0}, {"text": "RegEx 4lyf", "class": 1}, {"text": "It's all fun and games until someone is too cavalier with their * operators and then as a result, you get \"Catastrophic backtracking\" causing major performance issues.. \n Sometimes it pays off to write a proper parser instead of writing a hacky regular expression taking exponential time to match.", "class": 0}, {"text": "Hold a referendum! Sever ties with U double U in favour of triple U!", "class": 1}, {"text": "INNOVATION", "class": 1}, {"text": "Water water water! U U U!", "class": 1}, {"text": "DISRUPTIVE", "class": 1}, {"text": "shut up nerd", "class": 1}, {"text": "Shit", "class": 1}, {"text": "Found you, mother fucker.", "class": 1}, {"text": "I've never been on reddit at work for more than 5 minutes and still feel unproductive as fuck.\nTo those of you who do surf the net at work, do you actually get stuff done? How do you not feel guilty? Am I just a slowpoke or are you underworked?", "class": 0}, {"text": "My co-op is always on reddit too.", "class": 0}, {"text": "There are so many Matts that are paranoid right now.", "class": 0}, {"text": "Hey! Thanks for keeping us, aspirants, motivated. Being a CBSE student(from India), I was wondering if grade 11 scores influence the admission decisions. Because I spent my entir 11th grade learning something other than what is taught in school like bit of graph theory, astrophy etc. So my 11th scores are quite <let's not talk about it> range. But I'm conceptually well ahead of my class. So I believe you'll be able to answer my question from experience. How were you're 11th grade scores? \nAlso before you judge me, I'd like to add that my predicted grades will be as high as 94% and I have an average ec, but it's related to math. ", "class": 0}, {"text": "What do you think my chances are of getting into computer engineering as an Canadian going to school in California with a 3.83 weighted gpa and a 32 act? ", "class": 0}, {"text": "Couldn't find an answer for this anywhere. When calculating your average, to what decimal place does admissions use? Like if the mark for a course is 97.48%, would they see that as 97%, 97.5%, or 97.48%?", "class": 0}, {"text": "I believe for individual marks it's just whatever the number is... meaning say if your report card/OUAC shows a 97, it'll be a 97. It won't show up as a decimal place to Waterloo. (I am speaking from an Ontario perspective - I have no clue how the grades work in other places, so if you receive your grades up to a decimal point, then I guess that's what Waterloo sees as well). \n\nFor the average, I am pretty sure they round to 2 decimal places. \nSources (from 2014, but I am sure the process hasn't changed regarding this): \n\nhttps://profbillanderson.wordpress.com/2013/09/06/admissions-2014-how-its-going-to-work/\nhttps://profbillanderson.wordpress.com/2014/04/18/april-2014-admissions-update/ \n\n(Ctrl-F \"decimal\").", "class": 0}, {"text": "Hi I'm a grade 11 (going into 12)student from Manitoba. English is not my first language and I'm told if my 4 most recent years of full-time education have not been in an English-language school system, I have to do some test they listed (as far as I know, there are IELTS, IBT, CAEL) just to show my English proficiency but I'm not sure how much high score do they want me to get on the test.", "class": 0}, {"text": "https://uwaterloo.ca/find-out-more/admissions/english-language-requirements\n\nGoogle bud.", "class": 0}, {"text": "[deleted]", "class": 0}, {"text": "Read PM", "class": 0}, {"text": "Hey I'm just wondering does anyone know the process of transferring from Software Engineering at Guelph to Computer Science at Uoftsg or Utsc. What average must you keep first year? Does highschool marks matter? And how likely will Uoft accept students trying to transfer? Do I need specific courses first year? And which credits don't get carried on? ", "class": 0}, {"text": "Wrong subreddit man.", "class": 0}, {"text": "Hey anyone here whos currently in comp eng in stream 4 and could tell me if it was really difficult to find a coop after 1 sem?", "class": 0}, {"text": "It depends on your experience/projects. The employment rate is 85% IIRC for 1A.", "class": 0}, {"text": "Hi i got a conditional acceptance to Comp sci coop but am now worried i may not meet the conditions. I need an 80 in calc but if i don't get that will I be kicked out of the program? Also this is the conditions as it is on quest\n\"You must achieve a minimum final admission average of 80% that includes required Grade 12 courses (or equivalents). You must also achieve a minimum final average of 80% in the required Mathematics courses.\" \nI thought this meant i need 80 in math, 80 in calc and 80 overall avgbetween english calc and math. but a friend of mine said it might mean 80 avg between calc and math, and 80 between all 3. Which is it? I'm really nervous please help\n", "class": 0}, {"text": "It is 80 average between English, Calc, and Advanced Functions. Your friend is wrong but you should still do your best in school since thats quite a drop. Email the school if you need to", "class": 0}, {"text": "Does that mean I need to get above 80 in my Calc class or just between the three? Because it says \"You must also achieve a minimum final average of 80% in the required Mathematics courses.\" as well so that's the part I was more confused about.", "class": 0}, {"text": "You may have different terms than what I know of. Just call the school. Also, get higher than 80 anyway", "class": 0}, {"text": "You should email future-ugrad@cs.uwaterloo.ca if you want an answer for sure. I wouldn't be surprised at either answer. That said, if you're having trouble maintaining an 80 in high school, things might not look good in first year.", "class": 0}, {"text": "If you can't maintain 80 in MCV you will struggle at UW.\n", "class": 0}, {"text": "I'm currently in grade 11, and I just want to make sure I have right courses next year for CS. I currently plan on taking English, Advanced, Calc, Comp Sci, Communications Technology, International Business, and Econ (I have to take 7 courses next year cause I have a spare this year), and my question is does waterloo and other universities look at the difficulty of your courses? The reason why I'm wondering this is because one of my friends this year got rejected with a 94-95 average, and got rejected, while another student got accepted, with the same 94-95 average. The difference between them was that the later student had harder courses: eng, adv, calc, chem, physics, comm tech, while the former student had easier courses: eng, adv, calc, comp sci, and 2 comm techs. I'm sure the later student also had a better AIF but my main question is, does taking easier('bird') courses affect your chances? If so, I might add chemistry next year, instead of an easier course.", "class": 0}, {"text": "All courses are taken as equal for as much as I know. The only difference would be between school boards. I ended up dropping chemistry in Gr 12 and still got in.", "class": 0}, {"text": "Hey guys, I'm a grade 11 student from BC interested in UW Actuarial Sciences. I'm doing pretty well in math and English (98% math 12, taking calculus next year, and 93% in English.) Getting mid 90s in physics and chem, and high 80s to low 90s in everything else. Is this enough to get into that area? Appreciate any help, especially from those who are in or have already taken the program.", "class": 0}, {"text": "98% is pretty low, I'd aim for 99.3%+ in math. Otherwise you're looking OK. Do some exams pre-university. Goose luck.", "class": 0}, {"text": "Hi, just curious has anyone here applied from the States and been accepted into Waterloo's honors co-op CS program? If so what kind of gpa/SAT do you need to get in?", "class": 0}, {"text": "If my application on the Quest portal still says 'We have received your application, but no decision has been made yet', is it a pretty safe assumption to make that I won't be admitted?", "class": 0}, {"text": "Thats really strange, everyone I know who didnt make it already got an outright rejection. Call them about it.", "class": 0}, {"text": "I will, thank you.", "class": 0}, {"text": "Still waiting to find out what happened. ", "class": 0}, {"text": "Was bounced around on the phone lines so I went in person, was told that a decision should be coming through shortly. Still haven't heard anything. Think I have five days to decide on a U of T admission, but I'd really like to stay in the city. Really upset man", "class": 0}, {"text": "Is it hard to get a work term job(coop mechanical eng), im hoping to pay back some of the high costs of tuition thru coop. Im an avg student tho, n idk if ill have a v good gpa at Waterloo", "class": 0}, {"text": "It's more about the connections and networking too, if you have that down you should have a decent (not easy but not too hard) time finding coop", "class": 0}, {"text": "If you make a decent amount, you should be able to cover tuition. I think the average amount for your second co-op is about 17 CAD/hr; I lived at home for that time and made enough to pay for tuition and living expenses. It's feasible to break even, even if it's hard at first. ", "class": 0}, {"text": "Im a decent student with a 90 avg, im going to mechanical eng coop at waterloo. Will i survive at the uni? N what r the chances of getting in a coop program n how do i make sure i got get recked. Also i haven't taken calc in highschool so im worried. Advice plez", "class": 0}, {"text": "It depends on your high school. If you feel the marks are inflated and alot of people have 90+ then do some prep in the next few months. If your 90 is one of the higher marks then you should be okay. Also note that admission averages correlate with supply and demand not difficulty, so mech eng may very well be more difficult than soft eng (where im going). If you want to be safe then do some self studying, especially calc if you have to take it", "class": 0}, {"text": "If you get a faculty-specific scholarship, would you get an email for that? Also, should it be concerning if you have a scholarship email, but no physical copy of the scholarship through mail?", "class": 0}, {"text": "Hi, I have been accepted into the Mechatronics Engineering program, and based on what others have told me, Waterloo Engineering is a very competitive program, and most of the students are trying to get an upper hand on the others. Is this true? Although I like challenges and the fulfilling courses that Waterloo engineering offers, but I also like to work collaboratively with others and ask my peers for help when I need it, and of course return the favour, so would Waterloo's competitive environment be the right place for me? Also, does each student need a certain average to continue or receive certain incentives (eg. a specific co-op) in the program? Feel free to correct me if I'm wrong about any of my assumptions, I just want an inclusive and helping environment for my university experience. Thanks for the help! :D", "class": 0}, {"text": "I haven't met a single person who wants others to do badly in my first year. Yes, there are cocky students, the student who asks 100 questions every lecture and that one student who gets 95+ who doesn't ever talk. But as for taking challenges together, I'd say most students if not all are pretty open to that.\n\nAs for certain averages, you need to obviously pass to stay in the program. And getting low averages won't help in getting good co-op, though I wouldn't say it would hinder you if you have good side projects.", "class": 0}, {"text": "Would you recommend aiming for a high average and few side projects, or better side projects and slightly better then average marks to get better coops?", "class": 0}, {"text": "Your classes should be your first priority during your term. A 65% doesn't look as good as a 80% which doesn't look as good as a 95% in first year especially if you don't have experience in the industry, which most first years don't have much of. \n\nIt never hurts to get higher grades, but it isn't the only factor employers look at. Especially down the road, your experiences are more valuable than your courses.\n", "class": 0}, {"text": "> I haven't met a single person who wants others to do badly in my first year.\n\nThen you haven't met AFM students.", "class": 1}, {"text": "You build friendships through suffering.\n\nI don't think Tron is super competitive. The nice thing about a cohort system is that you're supposed to get closer to your class, and I think it's not as cutthroat as you think.\n\nYou have a lot of opportunities to work with people since every term you have should have at least 2 group projects. We also help each other out a lot, and the upper years definitely share their resources with the younger years. ", "class": 0}, {"text": "Do AP courses help at all to be considered or should you just take normal courses so your average looks higher?", "class": 0}, {"text": "AP doesn't even show up on your Ontario transcript, so it probably wouldn't help directly in the application process. You could however claim credit for a course if you get a 4 or 5 on the relevant AP exam, although even then I don't think it's a good idea to skip the course because of that - you'll miss a couple things that you might not have learned. \n\nI took all AP Math + Science (Physics, Chem and Bio) because it was more academically interesting, but that was about it. ", "class": 0}, {"text": "Waterloo will see your AP scores if you send them in.", "class": 0}, {"text": "On your aif they do ask you to list your grade 12 courses and the level you took them at (AP, U, etc) so they will know, but I still suggest taking U since theres no guarantee it helps. No one I know who has taken a lot of AP's have benefitted from it in terms of uni acceptances.", "class": 0}, {"text": "Was this post really necessary?", "class": 0}, {"text": "No.", "class": 1}, {"text": "[Faker](https://67.media.tumblr.com/997e9b1f47b2335d1671305a0f2848de/tumblr_no3irao7kG1u0jzt2o1_r1_500.gif)\n\n", "class": 0}, {"text": "http://imgur.com/sG9sq3k", "class": 1}, {"text": "ok", "class": 1}, {"text": "u wot", "class": 1}, {"text": "Flair tip #2: You can see flairs on your mobile app as well.", "class": 0}, {"text": "This is one of the most profound questions ever asked on this sub. It must be answered!", "class": 0}, {"text": "Waterloo has an extensive coop program", "class": 0}, {"text": "LOL! So much so that we even got an engineering student going for acting.\n\n(I say engineering because pretty sure 99.9999% of leather jackets I've seen are in eng, except that one guy I've seen who's jacket says \"Faculty of Arts\" on it. Never seen him since.)", "class": 0}, {"text": "yeah WeMesh positions filled up", "class": 1}, {"text": "I'd say see here http://asianwiki.com/Cape_Nostalgia for context but that doesn't actually really give you any more insight to why he's wearing that", "class": 0}, {"text": "Looks like the director's been to Toronto, could have swung through waterloo or got it in TO. http://www.newswire.ca/news-releases/new-film-festival-connects-toronto-audiences-with-japanese-filmmakers-in-a-celebration-of-japanese-film-and-culture-509736411.html", "class": 0}, {"text": "I can only get so erect.", "class": 1}, {"text": "And the plot thickens...", "class": 0}, {"text": "This only raises more questions", "class": 0}, {"text": "[Hiroshi Abe](http://asianwiki.com/Hiroshi_Abe) is a career actor and has probably never set foot in Waterloo, ON. He's also previously been cast as a [Roman in Japan](http://asianwiki.com/Thermae_Romae) so anything goes for him.\n\nMy guess is that the production team picked up the jacket in a thrift store or something somewhere. Or maybe they wanted the jacket to be recognizable at the Montreal World Film Festival.\n\nNow I have to watch this movie to see what it's about.", "class": 0}, {"text": "The first half of thermae Romae is amazing and hilarious but it gets a lot weaker ", "class": 0}, {"text": "please keep us posted with a detailed synopsis and review of the movie once you watch it ", "class": 0}, {"text": "This is actually the greatest find ever", "class": 0}, {"text": "[Here is a better look at the jacket in some other frames](http://imgur.com/a/Zk6yl)", "class": 0}, {"text": "Furthermore, [why was this crossposted to /r/ImagesofBelgium](https://www.reddit.com/r/ImagesOfBelgium/comments/4r8hxq/why_is_he_wearing_a_waterloo_jacket/)?", "class": 0}, {"text": "> Images of is two networks of subreddits. They automatically collect image posts of time periods and places.\n\nhttps://en.wikipedia.org/wiki/Waterloo,_Belgium", "class": 0}, {"text": "MOTHER OF GOD", "class": 1}, {"text": "What i really need to know is which faculty is written on that jacket.\n\n\nbut like wtf rofl", "class": 1}, {"text": "From [this post](https://www.reddit.com/r/uwaterloo/comments/4r8hw8/why_is_he_wearing_a_waterloo_jacket/d4z78m6), I can't see his faculty/program but I think he was class of '87.", "class": 0}, {"text": "the picture inside the circle shows one arm with nothing. Looks like the guy didn't pay for any sewing (it costs an extra hundred IIRC to have the your year/class sewn on).", "class": 0}, {"text": "EXTRA HUNDRED wtf forget that just pass me a sharpie", "class": 1}, {"text": "Finally something I can cosplay.", "class": 1}, {"text": "I will post a question on the Japanese Yahoo Answers or something to see if I can find anything interesting ", "class": 1}, {"text": "Report back plz", "class": 1}, {"text": "> Asians went to UW\n\nWOAH SO SURPRISING", "class": 1}, {"text": "But that's Japanese, not Chinese/Korean", "class": 1}, {"text": "So?", "class": 1}, {"text": "> Asians went to UW", "class": 1}, {"text": "Great Scott!", "class": 1}, {"text": "Japanese are Asian.", "class": 1}, {"text": "It stands for Javascript, a modern markup language based on the popular object-oriented language Java.", "class": 0}, {"text": "> markup language\n\n> based on the popular object-oriented language Java\n\nPlease stop spreading misinformation", "class": 1}, {"text": "GTFO engineer, you know nothing about computer science. REEEEEEEEEEEEEEEE", "class": 1}, {"text": "University of Waterloo, yes. Are you feeling alright?", "class": 0}, {"text": "No, I think I'm coming down with yellow fever.", "class": 0}, {"text": "Same tbh", "class": 1}, {"text": "Ah so", "class": 1}, {"text": "Nani?!", "class": 1}, {"text": "Dafuqq\n\nWhat does the title translate to?\n", "class": 1}, {"text": "The story of the Strange Cape.\n\nThe english title though is _Cape Nostalgia_.", "class": 0}, {"text": "what the fuck\ninb4 mystery of the year", "class": 1}, {"text": "Somebody watch it and report back.", "class": 0}, {"text": "M'ladies and neckbeards, there is a new beginning for us here in /r/uwaterloo. A new mystery amongst the legends like the SAFE is born.", "class": 1}, {"text": "[When you're at a party and some fucking random steals your beer](http://imgur.com/a/jrqQR)", "class": 1}, {"text": "Same tbh", "class": 1}, {"text": "LOL", "class": 1}, {"text": "From the shot on the bottom left this is in multiple scenes too", "class": 0}, {"text": "Because he's on his way to Waterloo with his Asian family", "class": 0}, {"text": "I hate when they change the shape of the ten-ten and characters. It makes it much more difficult to read. ", "class": 1}, {"text": "I'd bet a timbit this will turn out to be an image appropriated from another source, and the artist that took it was too lazy to change the logo.  There'll be some pic of a white dude from Imprint from the early 90's that matches it or something. ", "class": 0}, {"text": "Calling dibs on that timbit", "class": 1}, {"text": "So who do you owe the Timbit to?", "class": 1}, {"text": "To whomever finds the source material", "class": 0}, {"text": "[Do I get a timbit?](https://www.amazon.co.jp/%E3%81%B5%E3%81%97%E3%81%8E%E3%81%AA%E5%B2%AC%E3%81%AE%E7%89%A9%E8%AA%9E-DVD-%E5%90%89%E6%B0%B8%E5%B0%8F%E7%99%BE%E5%90%88/dp/B00S5QR57W) [How about now?](http://eiga.com/movie/79698/gallery/6/)", "class": 1}, {"text": "I remember this sign used to be bright as **FUCK** and would basically compete with the sun and blind every driver passing by. \nIt was so fucking bright Valve added it as a replacement for the flashbang to CSGO holy jesus\n\n\nim glad they fixed that", "class": 0}, {"text": "No joke, at one point I could see it from Dana Porter", "class": 0}, {"text": "It's been like that for a few days at least and no one's gotten around to fixing it. I tried taking a photo a few days ago and the LED matrix fucked with my camera lol\nIt reminds me of a time I was at Connestoga and one of the Koodo hallway booths had a slideshow running and on the screen had \"THIS COPY OF WINDOWS IS NOT GENUINE\" in a giant dialog box. None of them could dismiss it because it was handled remotely. ", "class": 0}, {"text": "Does nobody know how to configure a damn display kiosk?\n\nThis is once again just a bad setup.  I've never had one of my displays never pull shit shit because I DISABLE things like updates.", "class": 0}, {"text": "I’d just like to interject for a moment. What you’re refering to as Windows, is in fact, NSA/Windows, or as I’ve recently taken to calling it, NSA plus Windows. Windows is not an operating system unto itself, but rather another locked down component of a fully functioning NSA system made useful by the NSA corelibs, shell utilities and vital system components comprising a full OS as defined by the government.\nMany computer users run a modified version of the NSA system every day, without realizing it. Through a peculiar turn of events, the version of NSA which is widely used today is often called “Windows”, and many of its users are not aware that it is basically the NSA system, developed by the NSA.\nThere really is a Windows, and these people are using it, but it is just a part of the system they use. Windows is the kernel: the program in the system that allocates the machine’s resources to the other programs that you run. The kernel is an essential part of an operating system, but useless by itself; it can only function in the context of a complete operating system. Windows is normally used in combination with the NSA operating system: the whole system is basically NSA with Windows added, or NSA/Windows. All the so-called “Windows” versions are really versions of NSA/Windows.", "class": 1}, {"text": "So \"NSA\" is to GNU, Windows what windows is to Linux.  \n\nFor those interested, the kernel in Mac OSX is called Darwin and is open source.  \n\nIs \"NSA\" open source?  Did the National Security Agency really name their kernel after themselves?  I've never heard anyone talk about the Windows kernel. ", "class": 0}, {"text": "https://wiki.installgentoo.com/images/2/29/Windows10.jpg", "class": 0}, {"text": "Eh, you can turn these off, and just disable auto updates through the register", "class": 0}, {"text": "Ok Rusty Shackleford", "class": 1}, {"text": "Holy cow dude, these photos are stunning! \n\nWhat gear are you rocking?", "class": 0}, {"text": "Thanks for the praise :)\n\nAll the shots were with my Sony a6000 and the 50mm lens. My only other lens is a 14mm, which I didn't use because I think it's too wide for most shots and it's also fully manual in a situation where autofocus was key.", "class": 0}, {"text": "a6000 dayumm those things are good. Kinda guessed it was Sony, judging by the colours. If I had not invested so much into Canon lenses, I'd jump lol. \n\nPS: if you're around next term, you should join us at Imprint, we always welcome great photography talent! 🙂", "class": 0}, {"text": "> Sony a6000\n\nhnnnng", "class": 1}, {"text": "U of T and UW had their own student unions came out first. Then the engineering societies (U of T, Mac, Engsoc) came out together, with so much more enthusiasm. And none of the politicising signs, for U of T. \n\nSKULE was the best though, with the flatbed truck and cannon: http://imgur.com/a/oNMmu\n\n", "class": 0}, {"text": "> SKULE was the best though\n\nThis line is giving me way too much anxiety", "class": 0}, {"text": "Nice pics! You guys killed at the parade", "class": 0}, {"text": "This was incredibly fun to shoot, so many colours! I got really good at walking backwards.\n\nThe full album is about 260 photos, that will be going up on the EngSoc flickr account soon.", "class": 0}, {"text": "These are awesome. I was watching from a rooftop and have to say you guys looked pretty badass!", "class": 0}, {"text": "Thanks! We tried to bring the hype", "class": 0}, {"text": "Damn, the underarm hair on [this girl](https://www.flickr.com/photos/liurobin/28093482535/in/album-72157670004181381/).", "class": 0}, {"text": "That's.... not a girl", "class": 0}, {"text": "Nice car.", "class": 1}, {"text": "Yeah it runs on 1 meow power", "class": 1}, {"text": "Owner has been found! Apparently it was missing for 4 days.", "class": 0}, {"text": "Bring that pussy home!", "class": 1}, {"text": "Good on ya mate", "class": 1}, {"text": "Nice man good job", "class": 0}, {"text": "Cat*", "class": 0}, {"text": "That's fucking  nice  kitty right there.  The crosseyed ones are always the most expensive.", "class": 0}, {"text": "http://i.imgur.com/iRgfR.jpg", "class": 1}, {"text": "Would you download a car?", "class": 1}, {"text": "yes", "class": 1}, {"text": "https://www.reddit.com/r/uwaterloo/comments/4qls60/serious_is_it_wise_to_invest_in_a_car/\n\nhttps://www.reddit.com/r/uwaterloo/comments/4qxazl/serious_is_it_wise_to_invest_in_a_cat/\n\n", "class": 1}, {"text": "Can't exactly tell if that's water or milk... but adult cats (and other animals) shouldn't be given milk. Just so you know.\n\nHope the lil guy finds his owner!", "class": 0}, {"text": "Yeah gave it water instead.", "class": 0}, {"text": "yo what's its make & model?", "class": 1}, {"text": "meowrarri", "class": 1}, {"text": ">meowrarri\n\n[Purrari](https://i.ytimg.com/vi/_sSwwK5NTlQ/maxresdefault.jpg)", "class": 1}, {"text": "So fluffy. Careful with those flowers fam.", "class": 0}, {"text": "nice pussy", "class": 1}, {"text": "Is that one of those newfangled organic smartcars I keep hearing about?", "class": 1}, {"text": "Not mine but I would like to keep it\n\nIt's a good one", "class": 0}, {"text": "Yeah pretty expensive", "class": 0}, {"text": "If only you were taking PSCI courses last year or the year before. Easiest course I ever TA'd for, had you watch a bunch of movies, and a few quizzes based on those movies and a final exam. Professor was amazing as well. I think he is currently on sabbatical.\n\nI can't really recommend any Spring courses unless the Middle East interests you. If it does, then Bessma Momani's course PSCI 257 might be good. Momani is an amazing professor and the course is 2nd year so not all that hard and it will be interesting. \n\nIn the Winter, PSCI 150 is a really good one. I have TA'd for that course as well. Its all introductory so the content is easy and interesting enough. The course does deal with alot of the current world issues so its highly relevant. Eric Helleiner is an amazing professor, one of the best at Waterloo.\n\nThe final course I can recommend is PSCI 244 instructed by Jingjing Huo. Course content might be a bit challenging but its still a second year course so it isn't that difficult. it is also one of the few, if not the only that has no paper writing requirements. You have a mid-term and a final. It makes your life easier and it makes the life of the poor bastard that has to mark all that easy as well. And who knows by the end of it, you too might end up joining the JingJing Huo fan club on facebook.", "class": 0}, {"text": "> makes the life of the poor bastard that has to mark all that easy as well\n\nI felt sorry for our TA, because she had to deal with my messy AF writing and inconsistent double/single spacing (kept forgetting to double space during the middle of the test). \n\nDamn, no wonder I type my notes out. It takes me longer to decipher what the hell I wrote than to actually register the knowledge in my head. \n\n> you too might end up joining the JingJing Huo fan club on facebook.\n\nI'm in that group ayy. \n\nFunny story about JJ and I. One time he mentioned how he was from Xi'an, China, which happened to also be where I was born and lived in as a little kid. I immediately put my hand up and he was like \"yes? what is your question?\" and I screamed \"YOOOO FAM WE ARE FROM THE SAME HOMETOWN!!!\" and being JJ, he responded with \"uhm so what is your question?\" \n\nAwkward. ", "class": 1}, {"text": "PSCI 150 is exactly what you're looking for", "class": 0}, {"text": "Not sure if trolling but ... \n\nwww.jackyzhai.ca/course-notes. \n\nRead my term summaries - they have detailed descriptions of the courses.\n\n I would suggest looking at 244, 252, 264. 100/150 were also nice, but nothing fancy. 259 had too much history imo, 281 was too theoretical, and 231 was boring for me (not a huge econ fan). ", "class": 0}, {"text": "*cats", "class": 1}, {"text": "Furraris", "class": 1}, {"text": "I enjoy this.", "class": 1}, {"text": "ayylmao", "class": 1}, {"text": "So the lack of creativity in this sub is apparently enough that a typo gets pointed out in a separate post. I guess it's no different from \"I think baby hippos don't get enough love in this sub\" followed by \"while you guys are sitting there gawking over hippos, I'm amazed by how cute elephants are\" type of attention and approval seeking in an anonymous setting.", "class": 0}, {"text": "What is the appeal of LoL", "class": 1}, {"text": "well it's a really fun game aside from the twenty minutes of boring shit before it actually gets interesting.\n\nHotS, the blizzard version, skips that slightly, but it's not everyones cup of tea.", "class": 0}, {"text": "ok\n\nI guess I don't really have interest in fantasy themed games\n\nI have similar levels of obsession and time invested in another game", "class": 0}, {"text": "I'm a huge fan of HoTS. It takes all the good aspects of a MOBA and makes a much more polished game. No carries, 20 minutes of farming, and much less toxicity in the community. \n\nBut I guess some people don't like teamwork and want to 1v5 to feel like hot shit. ", "class": 0}, {"text": "The only reason i used to play lol was because my friends played lol. Just a way to spend time 'with' friends. I never played on my own.", "class": 0}, {"text": "what is the appeal of umaru", "class": 1}, {"text": "Umaru is a way of life that saved me from spiralling depression\n\nIts also keks and for lads", "class": 1}, {"text": "Umaru is love Umaru is life", "class": 1}, {"text": "Didn't realize at first.. but zoom in a bit and you can see this is quite an old picture :p", "class": 0}, {"text": "How's that only a UW thing?", "class": 0}, {"text": "Using the couch / laptop as a mousepad.....", "class": 0}, {"text": "Takes maybe 5 minutes provided there are no issues.", "class": 0}, {"text": "It shouldn't take that long if cultural vistas hooked you up with the whole folder of documents. ", "class": 0}, {"text": "Greyhound typically doesn't like it too much when someone takes too long in secondary -- are you sure there's no other way?", "class": 0}, {"text": "Getting a J1 at Pearson takes like 2 minutes tops if you have all your paperwork ready. Probably not a big deal.", "class": 0}, {"text": "Today the line took 1.5 hours. :') ", "class": 1}, {"text": "Don't think so :(", "class": 0}, {"text": "Other than the first entry, entering with a J-1 shouldn't take much longer. I've done this several times without any problems. There were usually 4~5 people entering with visas on every bus trip. \n\nWhat I would recommend is taking a trip to the border (get your parents to drive you maybe) to get admitted with your J-1 prior to the bus trip if you are concerned that it might take too long. ", "class": 0}, {"text": "This info is in your pre-departure training package on Learn.", "class": 0}, {"text": "They charge you $6 extra for some reason, compared to flying. Takes the same time as flying, and it's really no big deal.", "class": 0}, {"text": "> They charge you $6 extra for some reason, compared to flying. Takes the same time as flying, and it's really no big deal.\n\nIt's the fee to issue/print an I-94. You pay for it as part of your flight taxes when you fly (so yeah - even Canadian visitors who don't need an I-94, pay for it if they're flying).", "class": 0}, {"text": "Happy birthday!\n\nI think 168 Sushi lets you eat for half-price on your birthday.", "class": 0}, {"text": "Happy birthday :)\nI know menchies give half-price yogurt of ur birthday. Have a great day !", "class": 0}, {"text": "kinkaku", "class": 1}, {"text": "contemplate on the perils of growing up", "class": 1}, {"text": "[Happy Birthday](http://img.ifcdn.com/images/b32b7f197401bfd6851bff60320c23360f729a8ed31f0b5009f94d3e3ae2b490_1.jpg)", "class": 1}, {"text": "Any ECE course. It is almost uncanny how they flock to the mere mention of an embedded circuit system.  ", "class": 1}, {"text": "I've heard most hot girls take PMATH courses (they like Rings).\n\nDon't take Arts courses, they're sausage fests.", "class": 1}, {"text": "CS452", "class": 0}, {"text": "All of the ones you don't.", "class": 1}, {"text": "Try Phils101", "class": 1}, {"text": "> 1B Women's Studies\n\nThis person knows whats up, they *study women*.", "class": 1}, {"text": "Whatever courses they want. ", "class": 0}, {"text": "Laurier 101", "class": 1}, {"text": "I took ENGL208C (Children's Literature) as an elective and the class of ~30 students had 3 men.\n\nAbout 30% of the class had red hair, which struck me as extremely unusual.", "class": 0}, {"text": "Virtually any course at UW, because women aren't herd animals.", "class": 0}, {"text": "Lots of girls take Bio courses.\n\nBIOL 309 the ratio of Female:Male was >1", "class": 0}, {"text": "You could just go outside and meet some.", "class": 0}, {"text": "You may find what you're looking for at our liberal arts department.", "class": 0}, {"text": "All the ones you're in.", "class": 0}, {"text": "any SMF course...", "class": 0}, {"text": "Psych at UW\n\nOtherwise Laurier is the place to be....", "class": 1}, {"text": "AFM101", "class": 0}, {"text": "for real?", "class": 0}, {"text": "If you remove the 'hot' part, yes.", "class": 0}, {"text": "Hahahahaha", "class": 1}, {"text": "Aesthetics 101 ", "class": 1}, {"text": "You can have mine.............. :(", "class": 1}, {"text": "-_-\nthanks though =) might drop into the women's centre since it's more discrete. thanks!\n\nany chance you know what brand it is?", "class": 1}, {"text": "> more discrete\n\nInteresting. I prefer my condoms continuous, personally.", "class": 1}, {"text": "tks for the prompt reply! i'm not to well versed in condoms et all. i looked in /r/sex and it seems the main consensus there is the main stream ones (ie durex, trojan ultrathin ones)\n\nthe crown skinless reliable? you seem to have some first hand experience w/ them! I'm always wary of buying from ebay....is that where you get yours?\n\nI DEFINITELY WILL. THIS WEEKEND MANG. but need to get this shit first LOL.", "class": 1}, {"text": "heh... a big ass-basket. heh", "class": 1}, {"text": "Side note: You don't have to be a woman to go to the Women's centre and grab this stuff. I have told a few friends and they all seem to think that you can only go to the Women's Centre if you are a woman. \n\nAlso ladies they have free pads so if you are ever caught in campus and need some they are on the same shelf as the condoms are.  \n\n", "class": 0}, {"text": "No, you have to be a **Womyn**.", "class": 1}, {"text": "Maybe if it were not called the \"Women's Centre\" ", "class": 1}, {"text": "[Congrats!](http://fc00.deviantart.net/fs71/f/2011/148/2/d/congrats_on_the_sex_by_musicrocks852-d3hh2l8.jpg)", "class": 1}, {"text": "Asks not to be upvoted. That's an upvotin'.", "class": 1}, {"text": "truth be told, i just wanted a QUICK reply and did NOT want this on the front page. some friends frequent reddit and if they found out my username and made the connection i'd never hear the end of it -_-", "class": 0}, {"text": "Never hear the end of it?? What are we, in eighth grade now?\n\n\"Hahahaha guys, look at phoenix-ikku! He's getting laid and using condoms! I'll bet he doesn't even get her pregnant or catch a disease or ANYTHING! Safe sex is for pussies, what a loooooooooser!!\"", "class": 1}, {"text": "Sex is for dicks AND pussies", "class": 1}, {"text": "Watch this become the most upvoted post on /r/uwaterloo ", "class": 0}, {"text": "AAAAAAAAAAND it is. More popular than the uwaterloo colours making it to the Reddit homepage.", "class": 1}, {"text": "It is currently the top thread of all-time in /r/uwaterloo, trolololo", "class": 1}, {"text": "well i just downvoted myself...god dammit this better not be.", "class": 1}, {"text": "surprise! a few hundred people showed up to counter your self-downvote.", "class": 1}, {"text": "Don't delete the post if you can help it. It may actually be useful to someone some day.", "class": 0}, {"text": "Currently sitting at #2, need only 50 more upvotes to be #1...\n\nEDIT: Now #1. The most popular thread in /r/uWaterloo is a dude asking for condoms lololololol.", "class": 1}, {"text": "You waited 2 months to ask this?!", "class": 0}, {"text": "better late than never?...i think that's the saying. in all literal and figurative sense lol.", "class": 0}, {"text": "Dude, it's Waterloo, not Laurier.", "class": 0}, {"text": "I wasn't referring to the school year. See his profile: /u/phoenix-ikku.", "class": 0}, {"text": ">Don't upvote\n\n\nCongratulations, you now have the 7th most upvoted post of all time in this subreddit\n\n*edit: [Now #2, with two more upboats you'll have the most upvoted post of all time here](http://i.imgur.com/N2FEP.gif)", "class": 0}, {"text": "Don't tell me what to do. Upvoted. ", "class": 0}, {"text": "Turnkey desk gives them out for free.", "class": 0}, {"text": "I think the best way to get up votes is to say don't up vote. ", "class": 0}, {"text": "They do give them out at health services. I feel like they're durex, but I could be wrong. You could also run out to a convenience store nearby, or any grocery store.", "class": 0}, {"text": "Greetings from Western Australia. I hadn't even heard of the University of Waterloo before this post, but I came to this subreddit just to upvote it after seeing it on /r/firstworldanarchists", "class": 1}, {"text": "WHAT.....=.=;; awkward. how the heck does waterloo post appear in another section O.o...\n\nbtw how are you alive? i call shenanigans. Australia and you havent been destroyed by the demon animals yet? shenanigans i say!", "class": 1}, {"text": "[deleted]", "class": 0}, {"text": "> As a bit of a forever alone\n\n64 bits?", "class": 1}, {"text": ">56 upvotes.\n\nYOU HAD ONE JOB!", "class": 1}, {"text": "You can get them from turnkey or from The Women's Centre/GLOW, both of which are located on the 2nd floor of SLC, near the Bomber. Go in, grab what you need, walk out.", "class": 0}, {"text": "There are some in vending machines in the any of the residences.", "class": 0}, {"text": "Go to Sobeys and buy condoms at the self-checkout.", "class": 0}, {"text": "Jeeze, 23 upvotes and it wasn't even approved for main page yet :P\n\nJust goes to show you can't tell the internet what to do...", "class": 1}, {"text": "next time. i'm gonna put some stupid title that'll purposely get it downvoted to hell. something like \"ARTS > EVERYONE ELSE\"........", "class": 1}, {"text": "too far", "class": 0}, {"text": "at least it wouldnt get upvoted and front paged -_-\n\ni have a bad feeling my friends are going to link this account to me and i'm going to get hell tomorrow...FML. ", "class": 0}, {"text": "Get hell for getting condoms? trolololol only at Waterloo", "class": 1}, {"text": "Dude, you're friends should be like \"congrats on the sex. Remember to wrap it\" not \"look at this idiot asking for condoms!\" \n\nYou can tell them I said they're shirty friends if try pull the second option.", "class": 1}, {"text": "thanks for the kind words =) unfortunately they went with the latter statement plus more. update up above. thanks though =) much appreciated.", "class": 0}, {"text": "Well if you need someone to talk to pm me. I'm in Waterloo and might be able to relate. ", "class": 0}, {"text": "FUCK YOU I UPVOTE WHO I WANT WHEN I WANT!", "class": 1}, {"text": "You can buy it at any pharmacy, which could help you avoid seeing people you know. Basically any Zehrs will sell it :)", "class": 0}, {"text": "See the store/pharmacy in the basement of the SLC.", "class": 0}, {"text": "Go to walmart, bro.", "class": 0}, {"text": "Just use safeway plastic bags instead, they are reusable too.", "class": 1}, {"text": "Does one actually have to attend UW to get these free condoms?  Also what is the resale value.\n\n", "class": 1}, {"text": "I am so happy that they went with interlocking stone as opposed to pavement. This looks great!", "class": 0}, {"text": "No more mud! This is fantastic! ", "class": 0}, {"text": "I wish that path was there when I was still at UW! It looks gorgeous :)", "class": 0}, {"text": "Double great news because they also paved that path from the DC Cafeteria entrance area to the area between Chemistry and MC. I was under the impression that it was only the path to the main DC entrance that was being paved.", "class": 0}, {"text": "I think they threw that in for free.", "class": 0}, {"text": "Free stuff on campus is always good. ", "class": 0}, {"text": "You grace me with your presence oh great poorophet. ", "class": 0}, {"text": "finally! can't believe it took this long :P", "class": 0}, {"text": "30 years", "class": 0}, {"text": "Great job SCI!", "class": 0}, {"text": "When I was a kid my mom told me a story from her days at Trent University about how they built a new building on campus that didn't have any paths leading up to it.  \n\nShe was confused at first, but a year later they observed where the grass was worn down around the building and that is where they built the paths.\n\nI always took that to be a story about the wisdom of academics.  Imagine my disappointment when I started attending Waterloo (which in my mind was the place where all the most intelligent people in the country were) and noticed that the paths were in all the wrong places.\n", "class": 0}, {"text": "Great job Sustainable Campus Initiative! It's been a long time coming!", "class": 0}, {"text": "[They have machines that do that in an hour, and they still rely on man power](https://i.imgur.com/KqoTo.jpg)", "class": 0}, {"text": "The fuck are you talking about, they used this machine. \n\nIve seen that baby around campus so many times -- its what they used when they interlocked the front of DC too.\n\nEDIT: Foot in mouth -- I was pretty sure I saw this thing. Now, I'm still pretty sure I did, but others are saying otherwise. I'm 100% certain I saw them use said machine for the front of DC, but I guess they didn't use it in the back?", "class": 0}, {"text": "I was literally walking by yesterday and people were manually laying down the bricks... I was having lunch at DC at 11:30-12:15, so if it was any time other than that, then I missed it", "class": 0}, {"text": "I am pretty sure this was done completely manually.", "class": 0}, {"text": "Judging by my downvotes, it seems like it wasn't...", "class": 0}, {"text": "I demand photographic proof.", "class": 0}, {"text": "As do I, of it being done manually.", "class": 0}, {"text": "I have proof.\n\nhttp://i.imgur.com/Og9EfyE.jpg\nhttp://i.imgur.com/jCaabVB.jpg", "class": 0}, {"text": "Do you think putting that kid and the Impact font will make us agree with anything you say?", "class": 1}, {"text": "No, I expect you to be able to identify the argument being raised through the use of the images.", "class": 1}, {"text": "Was it the side paths? They manually lay the starts, the ends, and the small side paths. ", "class": 0}, {"text": "It must have been, but it was a good 4 feet from the end when I saw it, so I just assumed that they did the whole thing manually\n\nEdit: The side paths still had a person putting sand for them to set the bricks on.", "class": 0}, {"text": "I could be wrong actually. The machine is expensive and I'm fairly sure I saw it, but not in use this time. So well see. ", "class": 0}, {"text": "Naw you are retarded. Was done by hand I watched.", "class": 0}, {"text": "Then the school is retarded. I watched them use the machine when they did the front path ", "class": 1}, {"text": "It seems that the machine is good for when the interlock stones are of the same size, but I bet it's a lot harder to make it work when there are stones of varying size that need to be put together nicely like the ones on the DC pathway.", "class": 0}, {"text": "Not 100 true, people still can manually arrange them in the machine. I guess if they're different sizes they'd have to be stored conveniently to reach, but they can definitely still use the machine easily so long as they do that. \n", "class": 0}, {"text": "I was wondering how they laid it so quickly. I completely forgot that machine existed. ", "class": 0}, {"text": "The WatCard song was good, the co-op song was a banger, black and gold was eh (big points for rapping about that kid yu-gi-oh duelling people in the V1 cafeteria though), and this wasn't as good as the others. The autotune was nuts.\n\nStill cool to see that someone in Waterloo can get the girls.", "class": 1}, {"text": "I missed the vid of the Dueling master and it was taken down :(", "class": 0}, {"text": "To be fair, the original song is extremely autotuned too", "class": 0}, {"text": "Appreciate your feedback, especially as someone who's well versed in all my songs! Autotune was definitely an artistic decision: it was in the spirit of typical highly autotuned song parodies, and so you guys didn't think that I thought I could actually sing :P  ", "class": 0}, {"text": "Yeah man not hating whatsoever. Definitely agree with what the other person said about the original song being autotuned to begin with. Appreciate the work you put in to the videos; the production quality is always great. Looking forward to your next projects. Your vlogs aren't too bad either!", "class": 0}, {"text": "Thanks. It's always fun to bring the crew down to Waterloo and put these vids together. I'll make sure my bars are up to scratch for the next one aha", "class": 0}, {"text": "Some of the shots in his videos are crazy good. That E5 bridge (?) drone shot in this was nice and the ending skyline.", "class": 0}, {"text": "CuckFaptchas putting the drones to use", "class": 1}, {"text": "Thanks! Flying the drone is always fun, so we try to include it in every video ", "class": 0}, {"text": "May not be the best flow-wise, but the production value was through the roof here", "class": 0}, {"text": "We definitely tried to focus more on storytelling, as I was really keen on this video idea, and I wanted to switch it up from our normal video format. I know some people appreciate lyrics a lot more - my own brother likes Co-op the most cause it actually has decent bars. Thanks though!", "class": 0}, {"text": "I still remember freaking out when he started performing at FRC worlds. What a legend ", "class": 0}, {"text": "This guy fucks", "class": 1}, {"text": "This guy ~~fucks~~ cucks\n\nFTFY", "class": 1}, {"text": "Autotune bling", "class": 1}, {"text": "Should switch to Management Engineering then I can pick up all the chicks like he does.", "class": 1}, {"text": "It's where all the bitches be.", "class": 1}, {"text": "Who is the blonde girl?", "class": 1}, {"text": "He used to be good but now he's clearly lost a step. He looks like he is trying too hard in this one.", "class": 0}, {"text": "JG you're my hero", "class": 1}, {"text": "Where can I get the 2 things with long hair he has in the video?", "class": 0}, {"text": "If this is how much time an engineer student has I should be golden in LS", "class": 0}, {"text": "Only took a day to film it..", "class": 0}, {"text": "Damn what's the name of this sample?", "class": 0}, {"text": "Cover that new Cudi now", "class": 1}, {"text": "Still, more free time compared to what my parents try to scare me to believe", "class": 0}, {"text": "JG pls teach us your ways :O", "class": 1}, {"text": "> Grills at UWaterloo in Video \n\n> Clearly Fake \n\n\n\n\n", "class": 1}, {"text": "D I S R U P T I V E", "class": 1}, {"text": "This gave me stage 4 cancer.", "class": 1}, {"text": "Not realistic. STC is always packed. You can never find an empty classroom there.", "class": 1}, {"text": "Saturday", "class": 0}, {"text": "Check the open classrooms widget on Portal", "class": 0}, {"text": "Fin to find a study space like dorsal.", "class": 1}, {"text": "Or make use of cs136 assignment 1", "class": 0}, {"text": "U wat m8?", "class": 1}, {"text": "Puts all his effort into good videography to mask the horrible music..", "class": 0}, {"text": "Is this ethnic music\n\ncan we have no more ethnic music", "class": 1}, {"text": ">literally anything UWquant posts\n\nLol.", "class": 1}, {"text": "Ayyyy", "class": 1}, {"text": "I kek'd.\n\nQuant reminds me of that guy who deleted his account some time ago who also basically only posted trolly or racist shit. Can someone remind me what his name was again?", "class": 1}, {"text": "I ain't trollin mang", "class": 1}, {"text": "Are you sure it was Yunca? He didn't post trolly or racist shit, he just used to post his very unpopular/right-winged ideologies.", "class": 1}, {"text": "> I don't think you're racist but lately you've definitely been trolly\n\nI guess. I got sick of being so serious all the time.\n\n> That's your own decision\n\nIndeed it is.. :/\n\n> If you think that's the only reason he's doing it, then sir, you are direly wrong. That's what Trump's saying to get the votes of more rednecks; his actual reasons are fuelled by his own racist agendas (and don't say he isn't racist, he's openly racist and this is widely agreed upon).\n\nI feel like the way people insinuate that all white Republicans who have a mind to think about border & national security are these stupid recknecks is actually pretty racist. The US has always been like this - as are many other countries in the world. And look what happens when you *aren't* like that: you end up like Sweden and Germany (or Chicago)\n\nMany other countries as in China, Israel.. Some of our godly cannot-be-criticized-*ever* allies. Then there is Russia, Japan, Switzerland, Denmark.. These are some pretty.Important countries and you're going to call the US population who follows a common sense approach followed by a  large part of the civilized globe \"racist\"? By this logic if you're not for wide open borders and one world government you're a racist - which is pretty convenient.\n\n> Equating ISIS to Islam and ISIS extremists to Muslims is extremely ignorant of you\n\nI didn't equate the two. I said Islam has been attacking the West for 1500 years. Have they not? Who has been trying to invade Europe through Spain for 1500 years if not Islam? Who is invading (even the Pope in all his Liberalism is now calling it such) Europe right now? Who? \n\n> Seriously dude? I thought you were better than this.\n\nUhm? You agree with me about Hillary but say this? It's obvious Hillary will be the Democratic nominee. If she wins I'm not moving to the States. What's the issue with that?\n\n> And here's a trolly snippet from comment 1:\nHonestly I don't really care either way - it's not like the illegals will be competing with me for Banking industry jobs.\n\nRight, Trump is talking about deporting the illegal immigrants. I'm saying that I support that, but if it doesn't happen because Cruz or another Republican wins, does it really make a difference to someone in banking? The complaints about them are that \"dey took er jerbs\"... Well, they can't do mine, so meh", "class": 0}, {"text": ">I guess. I got sick of being so serious all the time.\n\nTBH, same. That's why I changed my flair which has been the same since I started coming to this sub in 1A. With all the open statements to X/WPIRG/SJW/PC shit on this sub lately, I decided I'd be less serious and just troll the obvious shitposts and retarded-ass threads like [this](https://www.reddit.com/r/uwaterloo/comments/4a256g/if_i_fail_out_of_computer_engineeringcan_i/d0wv18n) one yesterday which I'd normally ignore. But as soon as you do that, the downvotes start coming in, which is why I felt compelled to add that edit.\n\n>I feel like the way people insinuate [...] which is pretty convenient.\n\nI actually agree with you here and I agree 100% with increasing border security at the Mexican border; illegal immigrants are a problem and the drugs that are smuggled into the US are too, but this guy's beliefs on immigration policies (which is a very different topic than illegal immigrants and border security) are flat out insane. Not to mention this guy said he'd deport every illegal immigrant in the states back to their country (lmao). A lot of politicians had a laugh about this one.\n\n>I didn't equate the two. I said Islam has been attacking the West for 1500 years. Have they not? Who has been trying to invade Europe through Spain for 1500 years if not Islam? Who is invading (even the Pope in all his Liberalism is now calling it such) Europe right now? Who?\n\nLet's be real here, it's pretty obvious you're misinformed on this topic: [Non-Muslims Carried Out More than 90% of All Terrorist Attacks in America](http://www.globalresearch.ca/non-muslims-carried-out-more-than-90-of-all-terrorist-attacks-in-america/5333619).\n\n>Right, Trump is talking about deporting the illegal immigrants. I'm saying that I support that, but if it doesn't happen because Cruz or another Republican wins, does it really make a difference to someone in banking? The complaints about them are that \"dey took er jerbs\"... Well, they can't do mine, so meh\n\nYeah, and it's not something that would affect most people with a decently reputable degree from a decently reputable post-secondary institution but I was just saying it was kinda trolly.\n\nThat being said, there was this from a couple weeks ago:\n\n>You guys can keep your anorexic half asian girl\n\nwhich you have to admit is pretty racist.", "class": 1}, {"text": "> Let's be real here, it's pretty obvious you're misinformed on this topic: Non-Muslims Carried Out More than 90% of All Terrorist Attacks in America.\n\nThat's completely besides the point I was making and only speaks to the hard work of the CIA and immigration officials who keep America safe.\n\n> A lot of politicians had a laugh about this one.\n\nI'm sure a lot of them laughed about giving women the right to vote too\n\nYea I guess that's kinda racist. I was pretty annoyed at how much they attacked me over my comment & lashed out a bit", "class": 0}, {"text": "uwsohard prolly same dude", "class": 1}, {"text": "there was uwsohard and someone else... uofwateroo i think? idk all i remember is that the latter went full /pol/ at the height of the whole WPIRG/referendum shitstorm\n\ncoincidentally they all have/had very similar typing styles", "class": 1}, {"text": "yea that's both the accts i remember cuz of math finance", "class": 0}, {"text": "Yunca?\n\nEdit: Nvm remembering wrong", "class": 1}, {"text": "Iirc yunca was a grad student in amath, so it can't be him.", "class": 0}, {"text": "He was pmath undergrad.", "class": 0}, {"text": "YES LOL\n\nThank you. It bothered me I couldn't remember his name.", "class": 1}, {"text": "Yeah I was giggling up until that point but I actually laughed aloud when I read that.", "class": 0}, {"text": "shoutout to the guy who opted out of the WPIRG fee and used it to pay for my Reddit gold", "class": 1}, {"text": "That's a pretty spicy maymay u got there", "class": 1}, {"text": "If I know anything about quality satire comics on uWaterloo, you're becoming a mod. Congratz!", "class": 1}, {"text": "http://i.imgur.com/QcwYzHd.jpg", "class": 1}, {"text": "#D I S R U P T", "class": 1}, {"text": "[>Bottom right corner] (http://imgur.com/gallery/D08rEwL)\n", "class": 1}, {"text": "So much OC today", "class": 1}, {"text": "We all need to do our part and make /r/uwaterloo great again.", "class": 0}, {"text": "We need to build a wall and make the geese pay for it.", "class": 1}, {"text": "oc transpo", "class": 1}, {"text": "lol this was fucking great\n\n10/10\n\ndid you draw this yourself?", "class": 1}, {"text": "Its from 4chan. ", "class": 1}, {"text": "It's... so beautiful...", "class": 1}, {"text": "I like how Auntie's kitchen being crap is a meme now.", "class": 1}, {"text": "Hey thnx for putting me in ur maymays", "class": 1}, {"text": "ur welcum my man", "class": 1}, {"text": "Quality material. So worth the gold. ❤", "class": 1}, {"text": "After taking part in the shitshow that was the original open letter thread, I am happy to see more people expressing disappointment in some of this sub's users, calling for stricter moderation, and shitting on UWquant. I don't necessarily think anything in particular needs to change, but it's a good sign that people want to make this sub less of a shithole.", "class": 0}, {"text": "Pure art", "class": 0}, {"text": "Best post 2012", "class": 1}, {"text": "Do you have the original pic?", "class": 0}, {"text": "http://boards.420chan.org/616/src/1434955374860.png", "class": 1}, {"text": "> OP's first day on /pol/", "class": 1}, {"text": "Holy shit. After seeing the original, I have even more respect for what a great job you did on the captions. A lot of them fit better in your version than in the original, like the \"I have an 85% can I get in?\" one and the very last pane with the emergency services number. Damn, absolutely brilliant.", "class": 0}, {"text": "tl dr", "class": 1}, {"text": "[vote to replace old goose with new goose](/goose)", "class": 1}, {"text": "Is E5 balcony the new place for LinkedIn pics?", "class": 0}, {"text": "yes.", "class": 1}, {"text": "[](/goose) Get the fuck out of my hood, humie [](/goose)", "class": 1}, {"text": "i genuinely love this subreddit", "class": 1}, {"text": "can we get a rap song about it?", "class": 1}, {"text": "quality picture\n\nhonk honk", "class": 1}, {"text": "I watched the geese honk and fly onto the balcony. They were loud AF.", "class": 1}, {"text": "goose version of \"get off my lawn\"", "class": 1}, {"text": "[thank mr goose honk honk](/goose)", "class": 1}, {"text": "photogenic goose", "class": 1}, {"text": "This can easily be an album cover", "class": 0}, {"text": "thank mr goose", "class": 1}, {"text": "Looks like it has been pecking away at the foam for its nest.\n", "class": 0}, {"text": "Practice. Lots of practice and learning when to use what proof in what scenario. ", "class": 0}, {"text": "Dan Wolczuk usually writes the exams but Rubinstein is doing it this term and he doesn't like putting any computation on his exams. He said his exams are going to be really different from Dan's. His questions are usually hit or miss type questions, judging from the midterm.", "class": 0}, {"text": "Get your full time employer to hire a good immigration lawyer.", "class": 1}, {"text": "Why are you worried ? Its not the end of the world if you don't work in the US for your first 2 co-op terms. Most people only get US jobs from their 3rd work term anyway.\n\nEdit: On a more serious note, I know of other international students who were able to get their J1 for their 2nd work term. The 2 year requirement is sufficient, but not necessary if the officers processing your visa deem that you have settled and integrated well into Canada and used to the culture.", "class": 0}, {"text": "Im not bothered about coop terms and dont care whether I work there in my first 2 terms. Im more concerned that when I get a full time offer im gonna be screwed in my H1 visa thanks to the requirements. I just have no faith in the bureaucracy of india.\n\nAlso what does \"Sufficient but not necessary mean\"", "class": 0}, {"text": "The two-year home country residency requirement is a U.S. policy and has nothing to do with India. ", "class": 0}, {"text": "Yeah but u need the indian consulate to submit a \"im okay with you skipping the two years\" declaration. And for that u need 3 forms from 3 different ministries.\n\nRed tape max\n", "class": 1}, {"text": "What if you worked all your coops in Canada and never apply for a J1? And once you graduate you can apply for the H1 without the residency requirement", "class": 0}, {"text": "I would be okay with that but i think i would need at least one or 2 states coops to cover my fees", "class": 0}, {"text": "Ohh sorry, I get your question now. \n\nI assumed your initial question was regarding getting the J1 visa in the first place (which according to CECA requires 2 years of staying in Canada as an international student). I was confused about why you were talking about bureaucratic stuff / 20 years etc.\n\nSo looks like you're question is about the waiver from the Indian embassy in Washington DC in order to get the H1 visa. I don't have much info about this, but I can ask around and get back to you.\n\nSufficient as in, if you've been in the country for 2 years, and meet the other requirements you'll almost certainly be granted the J-1. Not necessary as in, it is still possible to get the visa even if you haven't been in the country for 2 years. Sorry about that, should have made it clearer.\n\nEdit: Also, search on this sub for H1 visas, there have been a few questions regarding international students going on to work full time in the US.", "class": 0}, {"text": "Thank you it'd be great if u got back to me", "class": 0}, {"text": "Holy fuck I'm in the SLC right now and MC has disappeared, where did math magic take you and how do you still have signal OP?", "class": 1}, {"text": "Quite spooky, stay safe fam", "class": 1}, {"text": "They're likely satellite, hence being stopped simultaneously.", "class": 1}, {"text": "They probably are all synced together. I recall all the clocks in my high school were delayed by the same amount, so there is probably a way to sync clocks.", "class": 0}, {"text": "'#MakeAmericaGreatAgain #BuildTheWall #MakeCOOPSGreatAgain #BanAllCECAEmployees #MakeGeomaticsPayForIt #UWGo \n\n\n^^^^kek", "class": 1}, {"text": "Waterloo has the highest concentration of memes of any university in canada, thus the uw reddit hivemind inadvertently absorbed too much /r/the_donald \n\nso yes ", "class": 1}, {"text": ">any university in the world\n\nFTFY", "class": 1}, {"text": "https://www.youtube.com/watch?v=mbXfk5lpLew", "class": 1}, {"text": ">[**\"Trump supporters are mostly childless single men who masturbate to anime\" [0:40]**](http://youtu.be/mbXfk5lpLew)\n\n> [*^Gillian ^Seed*](https://www.youtube.com/channel/UCF1F7MlqTIl_1CK30YFR0Jg) ^in ^News ^& ^Politics\n\n>*^122,691 ^views ^since ^Jan ^2016*\n\n[^bot ^info](http://www.reddit.com/r/youtubefactsbot/wiki/index)", "class": 1}, {"text": "yes", "class": 1}, {"text": "We are a bunch of savage dogs. Please go to UofT instead.", "class": 1}, {"text": "While I admit I agree with some of the things he says, I still think he's an idiot.", "class": 1}, {"text": "Even a stopped clock is right twice a day.\nThe Donald?  Only once a week or less.", "class": 1}, {"text": "I am still worry that I am not able to get  COOP job in US after Trump cancels  H1B visa. ", "class": 0}, {"text": "Coops use J1 visas", "class": 0}, {"text": "https://www.rte.ie/news/2015/0818/722082-donald-trump-immigration/\n\n\"He said the scheme will be \"terminated and replaced with a resume bank for inner city youth provided to all corporate subscribers\" to the J1 visa programme.\"", "class": 0}, {"text": "Between Hillary \"Bosnian Sniper' Clinton and Donald \"Build the Wall!!' Trump, I'm just having a great time with US politics", "class": 1}, {"text": "yes\n\nt. trump supporter", "class": 1}, {"text": "TIL /r/uwaterloo is also Facebook....", "class": 1}, {"text": "when people use a meme too much, people get sick of it and start downvoting it. eventually people stop using it. ", "class": 1}, {"text": "L2memetics. Memes come and go from overuse.", "class": 1}, {"text": "it became a fad", "class": 1}, {"text": "it was too D I S R U P T I V E\n\n\n\n^^^kek", "class": 1}, {"text": "You can probably get an override for 135. ", "class": 0}, {"text": "MTHEL 131 has no math. It's practically a course on the history of insurance. Do not take it if you don't have to, it's probably the most boring course there is at UW.\n\nIf you really want a challenge, go for an override to Math 145 (you can always drop down to 135 later if you feel it's too challenging)", "class": 0}, {"text": "Pm me bud. What do you ride? ", "class": 0}, {"text": "I'm just replying, currently my bike is out of town but it will be up here in a few weeks. CB350", "class": 0}, {"text": "Shoot me a PM when it gets here bud", "class": 0}, {"text": "Don't.", "class": 1}, {"text": "No choice, watched silicon valley and caught up on one piece during the weekend. Now I have 2 assignments due in the next 2 days. Dug my own grave fuccccck", "class": 1}, {"text": "You had a choice, and you made the wrong one. ", "class": 0}, {"text": "This is true as well. But I am no Waterloo guy.", "class": 0}, {"text": "relax, it is better to miss some notes and be less efficient than to burn out focusing too hard\n\ntake a short break every time you use up your lp \n\nkeep drinking water, don't eat too much or drink other stuff or you will be sleepy\n\nnap is good but be careful, if you really are too tired you will sleep through any alarm\n\nfinally set realistic goal, your idol is happy you are working so hard for your goal, but she also wants you to stay happy and healthy !\n\n\n", "class": 0}, {"text": "It's *extremely* hard on the body. I've done it thrice over the past 3 years. I always hit a major wall around the 24-26 hour mark. You can get past it, but the second day is fucking miserable and I want to kill myself every time. I don't think there's any healthy way to do it. But if you have to do it, avoid eating shitloads of food, that will make you very tired. And getting dehydrated will also make you very tired. But be warned, doing the all nighter can result in weeks of sleep issues.", "class": 0}, {"text": "-Drink lots of water. No coffee, maybe tea. No energy drinks. Those will make you crash.\n\n-Don't eat filling meals. Eat something like cereal, or crackers, or fruit. Bigger warm meals will make you wanna sleep.\n\n-Stretch every few hours. Stand up. Walk around. It'll help blood circulation which helps you stay up. ", "class": 0}, {"text": "Usually I grab like 2-3 Rockstars^^because-fuck-the-1-a-day-warning. After I finish the first, I just wait until I'm feeling kinda tired before taking another (good couples hours...). You can feel the cancer growing in your body and your organs trying to implode, but you are definitely awake and not falling asleep...I never really have a crash from the Rockstars - just a crash afterwards from being tired in general.", "class": 0}, {"text": "Modafinil", "class": 1}, {"text": "Meth. I know a guy who knows a guy. Hmu", "class": 1}, {"text": "Ever since I left DC, you...", "class": 1}, {"text": "Started reading less and going out more...\nGlasses of PB out on Phil's dance floor?", "class": 1}, {"text": "Hanging out with Laurier girls I've never seen before...", "class": 1}, {"text": "*runnin' through the quad with my woes*", "class": 1}, {"text": "hhahha", "class": 1}, {"text": "You don't deserve the upvotes for this comment but given the quality shitpost I gave you one too", "class": 1}, {"text": "lol ", "class": 1}, {"text": "This is high quality content. Fucking top job mate", "class": 1}, {"text": "Couldn't agree more", "class": 0}, {"text": "Is this ethnic music?", "class": 0}, {"text": "I believe the politically correct term is \"jungle beatz\"", "class": 1}, {"text": "So many crossed arms", "class": 0}, {"text": "That was the mech photoshoot today, just saying", "class": 0}, {"text": "Engineering also, my friend is there", "class": 0}, {"text": "I'm not your friend b-baka", "class": 1}, {"text": "    R U D E\n    U\n    D\n    E", "class": 1}, {"text": "Only Management Engineering students take headshots on the E5 bridge.", "class": 0}, {"text": "fake, ECE and tron too m8", "class": 1}, {"text": "Nawww. If anything, SYDE more than both of those.", "class": 1}, {"text": "You forgot EngSci", "class": 0}, {"text": "Wrong school", "class": 0}, {"text": "I thought UofT is a subordinate of ours? You know, like Conestoga College", "class": 1}, {"text": "Your first statement only works if UofT was a partition of UW though.", "class": 0}, {"text": "Nice meme", "class": 1}, {"text": "These guys are from my class stream 8 mech eng", "class": 0}, {"text": "I've heard that a lot of places really, really hate these photos. They're so generic, I'm real damn tired of seeing them.", "class": 0}, {"text": "Agreed, there's plenty of good places to take professional portraits on campus. E5 bridge has become the go-to lazy portrait location.", "class": 0}, {"text": "\\#teamQNCbridge", "class": 1}, {"text": "\\#TeamRCHBasement", "class": 1}, {"text": "hobo confirmed", "class": 1}, {"text": "#TeamMC4thFloorWashroom", "class": 1}, {"text": "People need to start taking professional photos with geese.\n\nIt's different and looks pretty badass.", "class": 0}, {"text": "Gotta use the giant walkway for something since traffic is minimal.", "class": 0}, {"text": "exactly. Its barely used and connects 2 farely quiet floors of the buildings. 2 million dollar fancy photo booth is what it is really I'd say nyeahh.", "class": 1}, {"text": "For a second I thought someone else were doing AFM memes..", "class": 1}, {"text": "They were still there at ~6:30pm.... at least they're committed. ", "class": 0}, {"text": "here is my bingo bongo matrix\n\n\n\n[javascript](https://www.reddit.com/r/uwaterloo/comments/3zmnve/waterloo_student_cant_finish_assignment_offers_to/) | [rampart](https://www.reddit.com/r/uwaterloo/comments/3p01vz/wilfrid_laurier_university_lockdown_lifted/cw263xx) | [93.3%](https://www.reddit.com/r/uwaterloo/comments/3u0ol7/hi_i_need_advices_from_those_with_real_admission/) | [41hr lab week](https://www.reddit.com/r/uwaterloo/comments/2aai1k/anyone_who_has_taken_2a_ece_what_are_your_best/citiwjx) | [goose ban](https://www.reddit.com/r/uwaterloo/comments/3ylk7k/meta_we_need_the_goose_back/cyepxqm)\n---|---|----|----|----\n[ideas stop here](https://www.reddit.com/r/uwaterloo/comments/ihowl/why_do_all_the_ideas_stop_at_laurier/) | [merry shitmas](https://i.imgur.com/FevhbsB.jpg) | [le train meme](https://www.reddit.com/r/uwaterloo/comments/3wt8p1/cs_452/) | [1A pig4](https://www.reddit.com/r/uwaterloo/comments/3u9aa4/seriousyoure_about_to_start_1b_term_and_you_have/) | [dae rich chinese super car xD](https://www.reddit.com/r/uwaterloo/comments/3xlac3/university_of_waterloo_starter_pack/)\n[epic 4chan 2for1 meme](https://www.reddit.com/r/uwaterloo/comments/3xcllp/submitted_aif_on_google_chrome_am_i_screwed/cy3f5nx) | [uh oh spaghettio](https://www.reddit.com/r/uwaterloo/comments/3g2bzf/on_the_verge_of_mental_breakdownfailing_eng_2nd/) | [FREE SPOT TIMELES CLASIC](https://www.reddit.com/r/uwaterloo/comments/12kiaf/approaching_asian_girls_help/) | [CLEAN FACE IN THE DC GONE SEXUAL](https://www.reddit.com/r/uwaterloo/comments/3z3ok9/facials_in_waterloo/cyj04w6) | [1A pig4 double whammy](https://www.reddit.com/r/uwaterloo/comments/3u9aa4/seriousyoure_about_to_start_1b_term_and_you_have/)\n[bad shitpost](https://www.reddit.com/r/uwaterloo/comments/3udjfv/what_will_you_tell_your_parents_when_they_ask_why/) | [my own meme](https://www.reddit.com/r/uwaterloo/comments/3uy13y/any_clubsorganizations_that_do_professional/cxirjwj?context=3) | [unicycle man no longer drowning in pussy](https://www.reddit.com/r/uwaterloo/comments/3u7fl0/lost_unicycle_in_eit/cxci2rw) | [I failed PD1... _for the ninth time!_](https://www.reddit.com/r/uwaterloo/comments/3ud4lp/passed_pd/) | [2016 orientation](https://www.reddit.com/r/uwaterloo/comments/3vwo9y/just_lost_virginity_thanks_dj_khaled/)\n[actually pig5](https://www.reddit.com/r/uwaterloo/comments/3yz47x/coop_at_mr_paninos/) | [lol](https://i.imgur.com/cYIHe.jpg) | [sloppy 106ths](https://www.reddit.com/r/uwaterloo/comments/i9nmf/questions_for_engineering_coop_students/c221c4x) | [8=D](https://www.reddit.com/r/uwaterloo/comments/3ulq05/help_anybody_got_an_immersion_hand_mixer_handy_my/cxfyahm?context=3) | [m'lady](https://www.reddit.com/r/uwaterloo/comments/3869ex/girls_of_uwaterloo_would_you_like_it_if_a_random/crvxz9z)", "class": 1}, {"text": "Yo that velocity v-neck looks sexy.", "class": 1}, {"text": "I think \"J A V A S C R I P T\" is the only thing the above bingo needs\n\nmaybe replace lennyface since we don't see it that often", "class": 1}, {"text": "It definitely needs \"Failed a course, what do I do?\"", "class": 1}, {"text": "Quality shitpost 👌", "class": 1}, {"text": "/ R / S H I T P O S T = / R / U W A T E R L O O", "class": 1}, {"text": "You missed \"4.0 GPA, NOBODY WILL CO-OP ME\"", "class": 1}, {"text": "Why is \"Sudden Paninos\" in red? That's systematic discrimination against businesses operated by ethnic minorities.", "class": 1}, {"text": "ayyy, my\n\n    S E D R A\n    M\n    I\n    T\n    H\nmade it\n\ni feel so honored. i would like to thank my mom and dad for birthing me so can have the opportunity to shitpost. and fuck you mr. stanley for not believing in me ", "class": 1}, {"text": "http://imgur.com/AYgActS", "class": 1}, {"text": "another one", "class": 1}, {"text": "How has nobody called bingo yet?\n\nBINGO!!!!", "class": 1}, {"text": "☝👆👆🙆OH MY GOD🙏☝THIS!!!👆👍🙌I LITERALLY😏😜CAME💦HERE😰💨😎TO POST📩📝💬📲THIS💻👆☝EXACT👌🙈😏COMMENT📄📬📨", "class": 1}, {"text": "im fucking dead", "class": 1}, {"text": "Is Paninos disruptive enough?", "class": 1}, {"text": "http://imgur.com/AYgActS", "class": 1}, {"text": ">implying I did not bingo twice already", "class": 1}, {"text": "What does that mean?", "class": 1}, {"text": "Everything on the bingo that was mentioned ITT.\n\n", "class": 1}, {"text": "Feridun sneaky sneaky", "class": 1}, {"text": "http://imgur.com/AYgActS", "class": 1}, {"text": "Wait what I didn't get a bmw in my I week bag :(", "class": 1}, {"text": "Rich mainlander comes to Canada starter pack", "class": 1}, {"text": "It's missing a bejeweled backpack and drop crotch joggers", "class": 1}, {"text": "OP making a throwaway account just to make this single shit post.\n", "class": 1}, {"text": "Seriously...\n\nOP actually went looking for 5 different images on Google, copied & pasted them on MS paint, and uploaded it to Imgur.\n\nI think this is even more hilarious... and sad.", "class": 1}, {"text": "Yes. This. Lower effort posts from future OPs pls.\n\nStop trying so fucking hard.", "class": 1}, {"text": "He's not taking any risks", "class": 0}, {"text": "More like FOB starter packer\n\nEdit: wait, waterloo is full of FOB", "class": 1}, {"text": "My friends grandma once came visiting and asked if the Canada goose logo was waterloo's school logo", "class": 0}, {"text": "So true", "class": 0}, {"text": "Lol that shit haircut", "class": 1}, {"text": "Those Canada Goose jackets are everywhere this year", "class": 0}, {"text": "hmm. What's up with the implied hate for people wearing Canada Goose jackets? If it's about down or fur, other jackets use it too. Why specifically Canada Goose?", "class": 1}, {"text": "Some people wear it as a status symbol, since it's a relatively expensive jacket and it doesn't actually get extremely cold around here. Also the other jackets you're talking about aren't close to as popular as Canada Goose.", "class": 0}, {"text": "> doesn't actually get extremely cold\n\nhttp://memesvault.com/wp-content/uploads/What-Meme-09.jpg", "class": 1}, {"text": "this ain't winnipeg", "class": 1}, {"text": "Wut? Last year it dropped to -25 ambient with a **-38 wind chill**", "class": 0}, {"text": "for what like a day? thats honestly nothing ", "class": 0}, {"text": "U waterloo data shows strings of days in 2014 (2015 data isn't out) below -20. That's just ambient. Would not call that just \"one day\" \nhttp://weather.uwaterloo.ca/data.html", "class": 0}, {"text": "I wasn't entirely sure I was asking. Regardless those conditions are easily defeated by proper, inexpensive gear and smart layering. The jacket is a status symbol, functional but superficial.", "class": 0}, {"text": "It's a symbol of wealth, with Moncler and Parajumper occupying higher tiers", "class": 1}, {"text": "Every year", "class": 0}, {"text": "> this year\n\nHow was frosh week?", "class": 0}, {"text": ">this year ", "class": 1}, {"text": "White BMW? Plebs. White Porsches are the new standard.\nEdit: Spelling. Also, Ha ha. very funny.", "class": 1}, {"text": "All about the Gold Jeep.", "class": 1}, {"text": "Is that gold jeep still kicking around? I remember seeing gold wrapped one for sale on Autotrader that looked exactly like it....", "class": 0}, {"text": "No clue.", "class": 0}, {"text": "Idk how you'd drive anywhere on your porch", "class": 0}, {"text": "http://i2.kym-cdn.com/photos/images/newsfeed/000/278/427/13d.jpg", "class": 1}, {"text": "Wish I had a BMW", "class": 0}, {"text": "I don't own any of those things but ok", "class": 0}, {"text": "You don't own an international student yet? They are pretty useful. ", "class": 0}, {"text": "got 2 in my home, practically pay for themselves! Oh wait no that's exactly what they do, pay for themselves.", "class": 0}, {"text": "Mine is somewhat of a leecher. I'll give you him and $4 for one of yours? ", "class": 0}, {"text": "You're gonna have to do a firmware update.", "class": 0}, {"text": "Out of the loop, why are international students disliked/made fun of so much at Waterloo?", "class": 0}, {"text": "Mostly cause they act completely entitled, don't integrate into local culture and drive very very poorly. At least thats why I hate on them...I dont even go to waterloo", "class": 0}, {"text": "TIL I have a car and I am not integrating into the local culture", "class": 0}, {"text": "[deleted]", "class": 0}, {"text": " 操你妈", "class": 1}, {"text": "草泥马", "class": 1}, {"text": "what were you trying to achieve with that post?", "class": 0}, {"text": "He watched too much south park and thinks he's le edgy.", "class": 1}, {"text": "le edgy? i found the FES", "class": 1}, {"text": "Philosophizing like this is only ever possible during exam month.", "class": 0}, {"text": "/r/showerthoughts", "class": 1}, {"text": "Deep insight, but why'd you make a throwaway for this lol", "class": 1}, {"text": "because /r/uwaterloo", "class": 1}, {"text": "We need a /r/showerthoughts specifically for UW.", "class": 1}, {"text": "PM me your shower thoughts", "class": 1}, {"text": "2 months.  Legit.", "class": 0}, {"text": "More like /r/showermemes or something\n\nAfter watching the Attack on Math 136 video, I'm hoping the meme quality ramps up this summer", "class": 1}, {"text": "I'll be waiting for MATH TWO DIRTY FIVE (coming this December 2016).", "class": 1}, {"text": "thank mr goose", "class": 1}, {"text": "wtf this actually makes senses", "class": 1}, {"text": "Dude where do you get your weed", "class": 1}, {"text": "Just hit up (519) 888-1039.  They have the best stuff.", "class": 1}, {"text": "> (519) 888-1039\n\n>actually tried calling this for a lark\n\n>thick asian accent picks up\n\n>it's fucking paninos\n\nmfw", "class": 1}, {"text": "Oh my God this made my night, thank you good chums", "class": 0}, {"text": "Ahahahaha, top level dank", "class": 1}, {"text": "thank mr goose", "class": 1}, {"text": ">Implying geese are capable of being anything other than bloodthirsty killers", "class": 1}, {"text": "thank mr goose", "class": 1}, {"text": "So is an outgoing Canada Goose a Canadas Canada Geese Goose?", "class": 1}, {"text": "Canada Geese Canada Goose?", "class": 1}, {"text": "thank mr goose", "class": 1}, {"text": "thank mr goose", "class": 1}, {"text": "thank mr goose", "class": 1}, {"text": "This is the reason why people fail exams.", "class": 0}, {"text": "Well there's also spray painted, ASCII art, drawn in QNC walls, picture of paninos made up of pictures of paninos, picture of paninos made of paninos receipts. There's no end.", "class": 1}, {"text": "Uwaterloo confirmed best subreddit in existence oh my god", "class": 1}, {"text": "This reminds me of that one post about a minecraft server for the subreddit that I believe was never followed up on? Now I'm sad :(\n\nAnyways good work OP.", "class": 1}, {"text": "I remember that. Hope someone else decides to make a server.", "class": 0}, {"text": "i have a 24 slot server that a few of my friends play on ocassionally but i think it would be neat to have ppl from our school get on too. should i make a post? ", "class": 0}, {"text": "Love the idea but I believe that given the response in the previous thread, 24 slots might not be enough to handle that many people.\n\nThe choice is yours, but I'm considering looking into a larger server once exams are over.", "class": 0}, {"text": "Tempted to make one in fallout 4 now", "class": 0}, {"text": "Do it. This sub can never have enough Panino's.", "class": 1}, {"text": "Just take my upvote already!", "class": 1}, {"text": "What's up with all the Panino posts? Did something happen? (Haven't been to Waterloo in ~3 years.)", "class": 1}, {"text": "It's just a frantic karma grab after the first panino variation was posted.", "class": 1}, {"text": "/r/outoftheloop", "class": 1}, {"text": "I wouldn't expect them to know much about what's happening regarding a small restaurant in a small plaza somewhere. Last time I've been to that location, there was some kind of Mexican restaurant whose name I can no longer find.\n\nedit: The Mexican restaurant was where Chen's is now. It was called Casa Salsa.", "class": 1}, {"text": "Mr. Paninos is a bit of a joke in itself, considering that it's a chinese restaurant called Mr. Paninos (the owners were too cheap to change the name, apparently). That's about it.\n\nAnyways, I suppose the recent influx of Panino shitposts is due to exam stress, coupled with a subreddit full of lemmings who run a mediocre joke into the ground.\n\n\n", "class": 1}, {"text": "You and are aren't lemmings though, because we both agree that everyone else is.", "class": 0}, {"text": "And *just* as I thought I would get sick of these abstract Panino Shots, this comes along.", "class": 1}, {"text": "The sign need balkan chevaps", "class": 0}, {"text": "Thanks Simon! m(_ _)m", "class": 1}, {"text": "Is that Mr Innovation himself?", "class": 1}, {"text": "Seems disruptive", "class": 1}, {"text": "Is that MS paint 👍", "class": 1}, {"text": "I used Photoshop", "class": 0}, {"text": "thought i clicked the hide shitposts button", "class": 1}, {"text": "5/7 țop tier meme ", "class": 1}, {"text": "Chin needs to be less wide. Aside from that, 5/7 dank shitpost", "class": 1}, {"text": "> Software Developer Intern\n\n> Google\n\n> Not selected\n\n:')", "class": 1}, {"text": "Maybe that's why google didn't select me for an interview :'(", "class": 1}, {"text": "Ouch it's too real", "class": 1}, {"text": ">59.6 average\n\ntop fucking kek", "class": 1}, {"text": "Pebble - Check\n\nNexus 5 - Check\n\nSedra Smith 7th edition - Check\n\nHoly fuck I didn't realize I was a living meme. What a time to be alive.", "class": 1}, {"text": "Lol about half of ECE 3rd years can't even hack the Sedra course. ", "class": 0}, {"text": "That's the 6^th edition!", "class": 0}, {"text": "I know, I own the 7th though so I had to make the distinction. I am an ECE fuckboy afterall", "class": 0}, {"text": "I can testify to the accuracy of this.", "class": 0}, {"text": "Browsing my comment history and making fun of me wherever I go. That's a very mature and well thought out tactic when you have a minor disagreement with someone on the internet, don't you think?", "class": 0}, {"text": "I just saw your comment while looking at this post mane.", "class": 1}, {"text": "What's the obsession with Sedra Smith on this sub? Is his textbook really that good?", "class": 0}, {"text": "It's good as far as textbooks go. And it's just a meme. ", "class": 1}, {"text": "you forgot the tech company laptop stickers!", "class": 1}, {"text": "Finals must be approaching because these maymays are danker than ever", "class": 1}, {"text": "You're forgetting the $600 graphics you convinced your mom was critical to your program. ", "class": 1}, {"text": "Isn't that schedule for 2a? Also missing glorious first time jobmine. ", "class": 0}, {"text": "Yeah, but you start complaining about the schedule in 1B.", "class": 0}, {"text": "lol wow courses are so different back then...\n\nThese were my courses:\n\nECE 100  Fundamentals of Elec Eng'g\n\nECE 102  Class Prof. Seminar\n\t \nECE 104  Numerical Methods\n\nMATH 119  Calculus 2 for Engineering\n\t\nMSCI 261  Eng. Econ: Fin Mgt for Eng's\n\nPHYS 125  Physics for Engineers", "class": 0}, {"text": "things were rearranged to aid with coop in first year", "class": 0}, {"text": "yeah honestly ECE 104 and MSCI 261 were pure bs...\n\nand nobody goes to class prof hour anyway", "class": 0}, {"text": "Needs more hackathon swag.", "class": 1}, {"text": ">2016\n\n>use ancient smartwatch ", "class": 1}, {"text": "i like ur smartwotch", "class": 1}, {"text": "my nexus 5 is pretty much toast ;_;", "class": 1}, {"text": "Not even half of these things are ECE-exclusive.", "class": 0}, {"text": "that's the point pf the joke. That even when the person doesn't have to have the item because of the field, they still share the same qualities and tastes. The humour is that it's a stereotype.", "class": 0}, {"text": "Wow nice joke!", "class": 1}, {"text": "you must be really fun to hang out with", "class": 0}, {"text": "I sexually Identify as Geomatics. Ever since I was a boy I dreamed of reprojecting spatial data. People say to me that a person being Geomatics is Impossible and I'm fucking retarded but I don't care, I'll get more offers than you. I'm having Peter Johnson inject me with Arc Licenses. From now on I want you guys to call me \"ARC/INFO\" and respect my right to Encounter a Serious Error and be Unable to Continue. If you can't accept me you're a geophobe and need to check your degree privilege. Thank you for being so understanding.", "class": 1}, {"text": "I'd just like to interject for moment. What you're refering to as ArcGIS, is in fact, ARC/INFO, or as I've recently taken to calling it, Arc plus Python. ArcGIS is not a GIS unto itself, but rather another proprietary component of a fully functioning GIS made useful by the ARC/INFO corelibs, shell utilities and vital system components comprising a full GIS as defined by ESRI.\nMany computer users run a modified version of the ARC/INFO GIS every day, without realizing it. Through a peculiar turn of events, the version of ARC/INFO which is widely used today is often called ArcGIS, and many of its users are not aware that it is basically ARC/INFO, developed by ESRI.\nThere really is an ArcGIS, and these people are using it, but it is just a part of the program they use. ArcGIS is the wrapper: the program in the program that allocates the program's resources to the tools that you run. The wrapper is an essential part of a program, but useless by itself; it can only function in the context of a complete program. ArcGIS is normally used in combination with ARC/INFO: the whole system is basically ARC/INFO with Python added, or ARC/INFO + Python. All the so-called ArcGIS versions are really versions of ARC/INFO!", "class": 1}, {"text": "Here's the thing. You said a \"ARCGIS is a GIS.\"\nIs it in the same family? Yes. No one's arguing that.\nAs someone who is a scientist who studies Geomatics, I am telling you, specifically, in science, no one calls ARCGIS GIS. If you want to be \"specific\" like you said, then you shouldn't either. They're not the same thing.\nIf you're saying \"GIS family\" you're referring to the taxonomic grouping of GIS, which includes things from ARCGIS to ARCGIS to ARCGIS.\nSo your reasoning for calling a ARCGIS a GIS is because random people \"call the black ones ARCGIS?\" Let's get ARCGIS and ARCGIS in there, then, too.\nAlso, calling someone a human or an ape? It's not one or the other, that's not how taxonomy works. They're both. A ARCGIS is a ARCGIS and a member of the GIS family. But that's not what you said. You said a ARCGIS is a GIS, which is not true unless you're okay with calling all members of the GIS family ARCGIS, which means you'd call ARCGIS, ARCGIS, and other ARCGIS GIS, too. Which you said you don't.\nIt's okay to just admit you're wrong, you know?", "class": 0}, {"text": "Richard Stallman\n\nOh I thought you were serious fuck me", "class": 1}, {"text": "I was only 9 years old  \nI loved ESRI so much, I had all the software products and geodatabases  \nI pray to ESRI every night, thanking him for the jobs I've been given  \n\"ArcGIS is love\" I say, \"ArcGIS is life\"  \nMy dad hears me and he calls me a CS reject  \nI knew he was jealous of my devotion to spatial data analysis  \nI called him a filthy code monkey  \nHe slaps me and sends me to sleep  \nI'm crying now, and my face hurts  \nI lay in bed and its really cold.  \nA warmth is moving towards me  \nI feel something touch me  \nIts ESRI  \nI am so happy  \nHe whispers in to my ear \"This is my error code\"  \nHe grabs me with his powerful advanced arcinfo license and puts me on my hands and knees  \nI'm ready  \nI create a shared folder for ESRI  \nHe penetrates my active directory  \nI push against the ERROR 99999999  \nI want to please ESRI  \nHe roars a mighty roar as he encounters a serious issue and is unable to continue  \nMy dad walks in  \nESRI looks him straight in the eye and says \"It's all spatial data now\"  \nESRI leaves through my window  \nESRI is love, ESRI is life  ", "class": 1}, {"text": "I just learned 3 years worth of Geomatics courses from this meme.", "class": 1}, {"text": "My Professor coded his whole life. I was about 20 years old when my dean said to him, 'If you ever want to get tenured in Environment, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he got an honourary CS degree. It was really sad and destroyed me. My dean said to me- 'Don't ever code. Please don't put your faculty through what your Professor put us through.\" I agreed. At 28, I have never touched a code terminal. I must say, I feel a very slight sense of regret for never having done it, because your post gave me a degree in CS anyway.", "class": 0}, {"text": "/#MakeGeomaticsGreatAgain", "class": 1}, {"text": "Let's dispel once and for all with this fiction that r/uwaterloo users doesn't know what they're doing. They know EXACTLY what they're doing. UW students are undertaking a systematic effort to change this subreddit, to make r/uwaterloo more like Piazza.\n\nThat's why they posted Geomatics memes and Paninos and Geomatics counter-offers and the deal with EasyAce. It is a systematic effort to change UW. When I'm mod of r/uwaterloo, we are going to re-embrace all the things that made r/uwaterloo the greatest subreddit in the world and we are going to leave our children with what they deserve: the single greatest degree in the history of UW.", "class": 1}, {"text": "We've got all the memes. The best memes.", "class": 1}, {"text": "We're telling you, we used to use the word incompetent. Now we just call them stupid. we went to a top-tier program. We're very highly educated. We know memes, we have the best memes...but there is no better meme than the Navy Seal Copypasta. Right?", "class": 1}, {"text": "That is the greatest conspiracy I've ever heard of.", "class": 1}, {"text": "Geomemers r the best shitposters ", "class": 1}, {"text": "I used to edit features onto OSM maps at a local park. Not a thing that I'm particularly proud of but I became quite good at it. I was taking GIS courses so I was shooting massive loads and it became something of a sport to me. For anyone interested here is your best strategy. first, you need to find an isolated spot so you don't become a banned user. I found a short kind of channel area where I saw the editors would ignore. Next, you create some data. I was usually content with envisioning the random output from the Create Random Raster tool in ARC/INFO and that was enough to fuel the fire but if you're not as cartographically charged as me just take some maps on the go. After you're good and ready, you get some WiFi. My login preferred mobile data hotspots but new users might have a taste for public WiFi. Small, secluded areas are unfilled and unmonitored so remember that. Once you are seated on the bench and ready to do the deed, whip your laptop out and join a network within a few feet of you. use your judgement based on how far you know you can get signal. I was a lonely and depraved soul who could hit targets the size of a park at distances up to 400 feet. You wait for the editors to begin working elsewhere and to get comfortable with your presence. At this point, you want to edit gently and fix broken lines to gain their trust. Now you're finally ready to edit your feature. This is a tough part because the rapid motion of editing is very frightening to the admins, so you have to be subtle. Once you master a technique, you simply wind it up and let it go, aiming depending on your past editing experiences. I always edit high areas so I would aim for the bottom of the hill and catch it right in the peak. It's an extremely satisfying and erotic feeling, seeing those editors reel around fixing mistakes and maybe even replacing it with further mistakes. Either way I haven't done it in years but every now and then I catch myself gazing wistfully at a seashore, finger twitching and waiting for them to land under my cursor.", "class": 1}, {"text": "hi every1 im new!!!!!!! holds up toolbox my name is roger but u can call me t3h F@t43R oF G1S!!!!!!!! lol…as u can see im very random!!!! thats why i came here, 2 meet random geomatiks stdnets like me _… im 13 years old (im mature 4 my age tho!!) i like 2 watch E$rI tut0rials w/ my QGIS softwair (im bi if u dont like it deal w/it) its my favorite tv show!!! bcuz its SOOOO random!!!! gis is random 2 of course but i want 2 meet more random ppl =) like they say the more the merrier!!!! lol…neways i hope 2 make alot of freinds here so give me lots of commentses!!!!  \nESRIIIIIIIIIIIIIIIII!!!!!!!!!!!!!!!! <--- me bein random again _^ hehe…toodles!!!!!\n\nlove and spatial data,\n\nt3h F@t43R oF G1S\n", "class": 1}, {"text": "forgive english, i am Geomatics.\n\ni come to study vector and raster at Waterloo university. i am here little time and i am very hard stress. i am Arc-sexual also and this very difficult for me, i am very open-source person. i never act to be proprietary with other programs before. but after i am in Geomatics 6 weeks i am ArcGIS together he is geomatics also. He was show me GIS fashion and then we are map.\n\nWe map together. I never before now am tell my hackathon buddies about proprietary because i am very shame. As i clip this GIS data it is very good to me but also i am feel so guilty. I feel extreme guilty as I begin buffer. I feel so guilty that I pick up my telephone and call buddy in CS. I awaken her. It too late for stopping so I am encountering ERROR 9999999. I am very upset and guilty and crying, so I yell her, \"I AM CLIP FROM RASTER\" (in ARC/INFO). She say what? I say \"I AM CLIP FROM RASTER\" and she say you boy, do not use proprietary software, and I say \"NO I AM MAP FROM WORK WITH ARC/INFO, I AM IN GEODATABASE, I CLIP IN SHP\" and my buddy very angry me. She not get scared though.\n\nI hang up phone and am very embarrass. ARC/INFO encounters a serious error and cannot continue. I am guilt and feel very stupid. I wonder, why do I map with Arc? But I continue because when it clip it feel very good in enterprise geodatabase.", "class": 1}, {"text": "I hate ESRIboos. I don't conisder myself an ESRIboo, I'm actually a GIS analyst for real, well almost. I will be when I live in ArcGIS though. Right now I'm studying Python, ArcServer and I'm following ArcGIS Online Help, the way of the analyst. This is why I hate ESRIboos that know 5 tools in ARC/INFO and use them all the time, clip buffer ERASE FEATURE ME MOTHERFUCKER. I'm actually trying to become an analyst for real unlike all these faker users. **** YOU ESRIBOOS", "class": 1}, {"text": "these memes are way too esoteric 4me", "class": 1}, {"text": "Fresh off the boat, from highschool, kid? heh I remember when I was just like you. Braindead. Lemme give you a tip so you can make it in this cyber sanctuary: never make jokes about geomatics like that. You got no reputation here, you got no name, you got jackshit here. It's survival of the fittest and you ain't gonna survive long on /r/uwaterloo by saying stupid jokes that your little hugbox cuntsucking CS friends would upboat. None of that here. You don't be DISRUPTIVE. You don't spend close to 10k on tuition per term. This ain't  CS, kid. This is geomatics. We have REAL intellectual discussion, something I don't think you're all that familiar with. You don't like it, you can hit the bricks on over to MC, you code monkey son of a bitch. I hope you don't tho. I hope you stay here in EV2 and learn our ways. Things are different here, unlike any other place that the light that other programs don't see. You can be anything here. Me ? heh, I'm a judge.. this degree.... this degree has a lot to offer... heh you'll see, kid . . . that is if you can handle it.\n", "class": 1}, {"text": "I'd like to call /u/Uthorr out on this recent influx of geomatics shitposting. Not only is he ｄｉｓｒｕｐｔｉｎｇ the meme and ｉｎｎｏｖａｔｉｖｅ shitpost culture here at /r/uwaterloo, he is also taking away the chance of others achieving the top memer status, he has clearly diluted the geomatics meme market to a point where they are now no longer seen as innovative, but rather as a non-trendy, shitty way to respond to a post.\n\nI think its time that we revolt against this uprising of geomatics memes and take down the market once and for all. We are the 99 percent, and we won't let the 1 percent hoard all the memes. It just isn't right. Put the power of the meme back in the hands of the people.", "class": 1}, {"text": "*slow claps*\n*steps out of the shadows*\nHeh... not bad, kid. Not bad at all. Your mapping, I mean. It's not bad. A good first attempt. It's plenty dank... I can tell it's got some thought behind it... lots of quotable material...\nBut mapping isn't all sunshine and rainbows, kid. You're skilled... that much I can tell. But do you have what it takes to be a GISster? To join those esteemed GIS ranks? To call yourself a member of the ESRI’s Corps? Mapping takes talent, that much is true. But more than that it takes heart. The world-class GISsters - I mean the big guys, like John Snow and Derrick Robinson - they're out there day and night, burning the midnight map-oil, working tirelessly to craft that next big meme.\nAnd you know what, kid? 99 times out of a hundred, that new map fails. Someone dismisses it as database overload, or says it's “ArcGIS encounters a serious issue and unable to continue” or ignores it as they copy/paste the latest shitpost map analysis dreamt up by those sorry excuses for cut-rate mappers over at GEOG281. The Map Game is rough, kid, and I don't just mean the one you just lost :^). It's a rough business, and for every artisan map you craft in your map bakery, some cocksucker at 9gag has a picture of a duck or some shit that a million different Johnny No-Names will attach a milion different captions to. Chin up, kid. Don't get all mopey on me. You've got skill. You've got talent. You just need to show your drive.\nSee you on the boards...", "class": 1}, {"text": "I sexually Identify as a web mapping service. Ever since I was a boy I dreamed of supplying map tiles on an ArcGIS Online Enterprise Account. People say to me that a person being a WMS is Impossible and I’m fucking retarded but I don’t care, I’m  spatial data. I’m having a plastic surgeon install 10cm resolution drone imagery, CRUD capabilities,  and digital elevation data on my body. From now on I want you guys to call me AGOL and respect my right to supply high resolution base maps to many online maps. If you can’t accept me you’re a mapophobe and need to check your leaflet privilege. Thank you for being so understanding.", "class": 1}, {"text": "M A P私は性的にW E BのマッピングサービスP I N Gとして私が少年だったので、A r c G I Sのオンライン企業アカウントC Rのマップタイルを供給することを夢見ていました。私は、人々はそれが私がクソ遅くW M S などの人には F U C K I N G 私は気に、R E T A R D E Dにしないでください、空間データです。私は10センチメートル解像度ドローン画像形成外科医は私の体、C R U D機能であり、P L A S T I C データをインストールすることです。私が今したいので、皆さんは私がA N G E Lを呼び出し、オンライン地図の多くのベースマップのB A S E M A P尊重することです。あなたは受け入れることができない場合、私は、r eとあなたのリーフレット「U oをb iをoをyとm個のO n個のOのP hの権限をチェックする必要があります。T H A N K  Y O U にありがとうございます。", "class": 1}, {"text": "ｔ・ｭｈ・･ａ・ｵｔ・ｭｓ・ｭ ・ｭｓ・･ｏ・｣ｍ・｡ｅ・･ ・ｨａ・､ｅ・ｭｓ・･ｔ・ｨｈ・ｷｅ・ｴｔ・･ｉ・ｭｃ・ｲ ・｡ｓ・｡ｈ・ｭｉ・ｭｔ・｡ ・･ｒ・｡ｉ・ｴｇ・｡ｈ・ｴｔ・ｭ ・ｷｔ・｣ｈ・｡ｅ・ｴｒ・｡ｅ・｣", "class": 1}, {"text": "I was 26 years old, analysing data at the bottom of EV2, when I saw my ArcMap session encounter a serious error and be unable to continue. It's spatial data flew into the cloud, bounced off the HTTP protocol and instead of going into the database, actually crashed the tool and dropped the database instead, deleting 6 weeks of data. That was the most brutal drop I had ever experienced... Until I read this comment.﻿", "class": 1}, {"text": "Really...that's all? You think a couple GIS memes going webscale is all we gotta worry about? What the hell do you think that starts the fall of geomatics? I'll tell you its when we start learning about EigenVectors in GEOG, not from EasyAce; next thing we know we'll have a bunch of CS coding through the web on MacBooks \"in the name of accessibility\" it'll be like hackathons but instead of a nice little arena the whole field is the battle ground. Bunch of bollocks coming from ESRI this CS proxy company front for MLH.", "class": 1}, {"text": "FFFFFFFFFFFFFFFFF WHAT DID YOU FUCKING CALL ME ?\nA CS REJECT?\nDO YOU FUCKING KN OW WHAT BEING DEFERRED INTO GEOMATICS EVEN MEANS? IT MEANS I GOT AN OFFER. A FUCKING JOB. A DEGREE. A PRANCING LALA FRUITY DISRUPTIVE SCHEDULE. YOU COME HERE, AND CALL ME FUCKING THAT? DO YOU HAVE ANY IDEA HOW MANY GIGABYTES OF MODIS IMAGERY FEATURING ONLY FUCKING !!!EV3!! I HAVE? DO YOU HAVE ANY IDEA HOW MANY TIMES A DAY I MASTURBATE TO THIS COLLECTION, HOW MANY HOURS I SPEND EXPANDING IT? NO, NO YOU FUCKING DON'T, YOU JUST COME IN HERE AND MAKE A FUCKING JUDGEMENT ON ME LIKE YOu\"RE SOME KIND OF JUDGER OF PROGRAMS WHEN I STILL SMELL OF THE SEMEN FROM JACKING IT TO THE BEST DEGREE OF THIS FUCKING SCHOOL OFFERS?? ITS NOT FUCKING /CS/ ALRIGHT IT'S /UWATERLOO/\nWHIPE THAT SMILE OFF YOUR FUCKING FACE. I BET I HAVE AT LEAST TEN TIMES THE AMOUNT OF PICTURES OF ARCGIS YOU DO, ARCGIS ARC ARC FRUITY WHOOPSY DOO-DOO LAA LAA ENG BOY GET THE FUCK OFF MY BOARD", "class": 1}, {"text": "This program is not worth your time. This program is like an error 9999999 entering your session while you work. This program is the equivalent of unreferenced imagery. I would rather be Clipped with a **** covered in NaNs than pay for another semester of  math 136. This is a shameful display.\n\nI am no longer willing to wait for a good CS Program. I will instead take my money and spend it on something good, like a degree in Honour's Geomatics.\n\n(Found on UWFlow user reviews for CS undergrad)\n\nEDIT: Obligatory Thanks for the Gold Mr.Goose.", "class": 1}, {"text": "I've never witnessed such a high-level shitpost. You actually bought gold for yourself...twice. Such dedication.", "class": 1}, {"text": "DIRTY CS SCUM GET OFF MY HARD EARNED GOLD I EARNED WITH MY OWN SWEAT TEARS AND FECES GET OUT OF HERE WE DONT SUPPORT CODE HEADED BASTARDS LIKE YOU THIS IS A FIRST WORLD PROGRAM WHERE WE DONT SHOVE OUR HEADS INTO MC AND DRINK SOYLENT ALL DAY U LIL CODENIKUNT I BET I CAN REK U IN A RACE OWP SORRY ALREADY HAPPENED M4 MORE LIKE M-NOT AMIRIT HYUK HYUKHYUK GO BACK TO YOUR LINE HAR HAR MEANWHILE ILL BE HERE TEACHING MY SON HOW TO RIDE MY BIKE AND MEET PETER JOHNSON IN THAT PRESS MEETING WE HAVE O LOOK IM GETTING A CALL FROM HIM RIGHT NOW OH HELLO PETER JOHNSON HOW IS THE BUSINESS REPORT GOING SPLENDID MHM YES INDEED WELL IVE FINISHED PAYING MY BILLS AND GOING TO PLAY BILLIARDS SEE YOU AT WORK CLICK\n\nalso happy cake day", "class": 1}, {"text": "Thanks.", "class": 0}, {"text": "No problem", "class": 0}, {"text": "I don’t give a fuck which program you are in or where you co-oped. You can count on me to be there to bring your fucking jobs to a GEOG281 lab forever. I’ll put you in so much fucking pain that it’ll make staring at a Mercator projection look like a fucking back massage on a tropical island. I don’t give a fuck how many JobMine rankings or how many surveys you've done IRL, how well you can map, or how many fucking projections you own to represent your maps with. I’ll fucking show up at your computer when you aren’t there. I’ll disable all your extensions, downgrade your ArcGIS to 10.1, create tools that will do every possible task you could possibly think of, and upload them into an online GIS web application. You’re going to start losing your job opportunities, more people could use GIS without a Geomatics degree, and you’ll apply to Esri to try to disrupt new ways to make GIS alive again. You’ll go to GIS for a for a new job, and the last thing you’ll see when you’re being put in your shitty office is me at your door, dressed like your boss. When you just finished your next task, wondering what you just did when it's already done. You’ll lose your job on your first day for a lack of demand of GIS specialists. And when you walk out the front door of Esri to go home I would have done the same for remote sensing; say good bye to PCI as well. I just want you to know how easily I could fucking destroy your pathetic excuse of a life, but how I’d rather go to a great fuckng length to make sure your last remaining days are spent in a living, breathing fucking neo-geography 2.0. It’s too late to save yourself, but don’t bother switching programs either… I’ll do it to the next field and keep you unemployed you again myself you bitch-faced cartographer. Welcome to neo-neo-geography, population: Geomatics students.", "class": 1}, {"text": "No. No. You just wait a FUCKING SECOND. What the fuck did you just call me? WHAT THE FUCK DID YOU JUST CALL ME? I'll have you know I'm a geomatics student and PROUD. You don't INSULT me. And by the way, no. No, it's not \"web-ready\" Do you even KNOW where ArcGIS came from? ESRI. \"Arc\" CAME FROM ESRI. THE PROPER TERM FOR \"Arc\" IS ARC/INFO. Just because I'm twenty doesn't mean that I can't be a geographer. I'm mature. I write GIS tools. I have many people who like my GIS tools on OSM and GitHub. I read The Canadian Geographer every day. GIS is my life. I couldn't live without GIS. I would die without it. I know everything about ARC/INFO. I'M NOT STUPID. I read my first Arc helpage when I was ten. I'm NOT like the other kids, SO STOP SAYING THAT I AM. I'm sick of it. I'm so fucking sick of all of it. I'll have you know that I knew what a Kriging analysis did when I was NINE FUCKING YEARS OLD. NINE. I WAS FUCKING NINE. I BET YOU DIDN'T KNOW WHAT GIS WAS WHEN YOU WERE NINE. I type with proper grammar, and you don't. You aren't better than me. You don't even use the right word for WebGIS It's not GIS Web application. Do your research. By the way, GIS web applications are disgusting. It's nothing like GIS and it's unrealistic, and uncapable. The Web code is usually not even shorter than the Desktop GIS. It's disgusting. Fuck all of you. I'm twenty and I'm not \"stupid\" because I actually know the origin of GIS and you don't. Fuck you. Fuck off", "class": 1}, {"text": "if /u/Uthorr bae 💑💏 got ArcGIS 💉🏥😷💀 it's bout to turn into ArcGI-US 👫 cause we in this together 😍😘", "class": 1}, {"text": "IM DELETING YOU, MR ARC/INFO!😭👋🎺\n██]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]] 10% complete.....\n████]]]]]]]]]]]]]]]]]]]]]]]]]]] 35% complete....\n███████]]]]]]]]]]]]]]]] 60% complete....\n███████████] 99% complete..... 🚫ERROR 99999999🚫 💯True💯 GIS are irreplaceable 🎺I could never delete you Mr ARC/INFO!🎺 Send this to ten other 😎 GISs 😎 who give you 💪 ERROR 999999 💪 Or never get called 👑 a spatial analyst 👑 again❌❌😬😬❌❌ If you get 0 Back: ArcGIS has encountered a serious error and is unable to continue 🚫🚫👀 3 back: your clip is now 🎺 ⏰ 5 back: your a true analyst", "class": 1}, {"text": "I used to edit features onto OSM maps at a local park. Not a thing that I'm particularly proud of but I became quite good at it. I was taking GIS courses so I was shooting massive loads and it became something of a sport to me. For anyone interested here is your best strategy. first, you need to find an isolated spot so you don't become a banned user. I found a short kind of channel area where I saw the editors would ignore. Next, you create some data. I was usually content with envisioning the random output from the Create Random Raster tool in ARC/INFO and that was enough to fuel the fire but if you're not as cartographically charged as me just take some maps on the go. After you're good and ready, you get some WiFi. My login preferred mobile data hotspots but new users might have a taste for public WiFi. Small, secluded areas are unfilled and unmonitored so remember that. Once you are seated on the bench and ready to do the deed, whip your laptop out and join a network within a few feet of you. use your judgement based on how far you know you can get signal. I was a lonely and depraved soul who could hit targets the size of a park at distances up to 400 feet. You wait for the editors to begin working elsewhere and to get comfortable with your presence. At this point, you want to edit gently and fix broken lines to gain their trust. Now you're finally ready to edit your feature. This is a tough part because the rapid motion of editing is very frightening to the admins, so you have to be subtle. Once you master a technique, you simply wind it up and let it go, aiming depending on your past editing experiences. I always edit high areas so I would aim for the bottom of the hill and catch it right in the peak. It's an extremely satisfying and erotic feeling, seeing those editors reel around fixing mistakes and maybe even replacing it with further mistakes. Either way I haven't done it in years but every now and then I catch myself gazing wistfully at a seashore, finger twitching and waiting for them to land under my cursor.", "class": 1}, {"text": "apology for poor mapping skills\n\nwhen were you when deferred to geomatics?\n\ni was sat at home shitposting when quest ring\n\n'offer is defer'\n\n'no'", "class": 1}, {"text": "*slow claps*\n\n*steps out of the shadows*\n\nHeh... not bad, kid. Not bad at all. Your geography references, I mean. It's not bad. A good first attempt. It's plenty dank... I can tell it's got some thought behind it... lots of quotable material...\nBut geomatics isn't all sunshine and rainbows, kid. You're skilled... that much I can tell. But do you have what it takes to be a Memester? To join those esteemed ENV ranks? To call yourself a member of the Arcman's Corps? Mapping takes talent, that much is true. But more than that it takes heart. The world-class Mapsters - I mean the big guys, like ESRI and Peter Johnson - they're out there day and night, burning the midnight Arc-oil, working tirelessly to craft that next big map.\n\nAnd you know what, kid? 99 times out of a hundred, that new tool fails. Someone dismisses it as useless, or says it's \"tryhard,\" or ignores it as they copy/paste the latest QGIS tool dreamt up by those sorry excuses for cut-rate geographers over at Laurier. The GIS Game is rough, kid, and I don't just mean the one you just lost :^). It's a rough business, and for every artisan tool you craft in your GIS bakery, some cocksucker at UofT has a tool for clipping or some shit that a million different Johnny No-Names will attach a milion different pull requests to. Chin up, kid. Don't get all mopey on me. You've got skill. You've got talent. You just need to show your drive.\nSee you on the journals...", "class": 1}, {"text": "I am very secure about my maps. You have obviously never made maps if you think mine look bad, and that is very sad for you. You should get a GIS right away so you will have some knowledge of maps and not sound like a fool when you speak. Again, I would ask you to prove your own map making skills if you think you are capable of judging others so harshly. But that would require something well beyond your capabilities. You really should try GIS, it is quite engaging and you won't sound so stupid when you comment.", "class": 1}, {"text": "TLDR.", "class": 1}, {"text": "👌👀👌👀👌👀👌👀👌👀 map shit go౦ԁ sHit👌 thats ✔ some map👌👌shit right👌👌there👌👌👌 right✔there ✔✔if i do ƽaү so my self 💯 i say so 💯 thats what im talking about right there right there (chorus: ʳᶦᵍʰᵗ ᵗʰᵉʳᵉ) mMMMMᎷМ💯 👌👌 👌НO0ОଠOOOOOОଠଠOoooᵒᵒᵒᵒᵒᵒᵒᵒᵒ👌 👌👌 👌 💯 👌 👀 👀 👀 👌👌map shit", "class": 1}, {"text": "DAE think geomatics = high school 2.0?", "class": 1}, {"text": "You motherfucker.I was having incredibly passionate GIS analysis with my ARC/INFO workstation, because I can get jobs because I'm not a socially retarded engineering student like you.Anyway, I was performing advanced SQL joins on the ESRI enterprise geodatabase, and it was incredible. It was using 100% of my CPU and clipping raster data and calling me \"John Snow Cholera Map\", just how I like it, when I remembered your stupid fucking comment. ArcGIS immediately encountered a serious error, so serious in fact, that it could not continue, you fucking weeaboo. I used to give pimple faced fucks like you swirlies in high school when I wasn't busy being the captain of the spatial data club and running advanced Arc/INFO licenses on the supercomputer clusters. My computer wanted to know why my huge, perfectly sorted GIS data folder caused ArcGIS to crash like a scared little puppy, so I told ESRI through the error reporting dialogue about your stupid ass comment.And guess what, you fuck stain? ESRI called back and told me that it got AIDS from hearing the vocal abortion you called that comment. You better hope my software never becomes runnable again, because the second it does, I'm going to buffer your mom in her stupid horse looking face. And she'll fucking love it.There's a reason why my name is Steve Waterman.", "class": 1}, {"text": "\n\\>my face when pleb programs call geomatics \"high school\"\n\n\\>my face when pleb programs call gis \"google maps\"\n\n\\>my face when pleb programs call python \"not a real language\"\n\n\\>my face when pleb programs call the greatest building on campus \"ev3\"\n\n\\>my face when pleb programs call afm \"the meme program\"", "class": 1}, {"text": "I'll come fight you - give me your address and I'll look it up though GIS since I've already got Google maps installed", "class": 1}, {"text": "It should be noted that I've upvoted every single person who's disagreed with me here, as far as I know.\n\nThat said.\n\nIn 7th grade, I took an ESRI test without preparing for it at all, it was spur-of-the-moment, I knew about it about an hour ahead of time and didn't do any research or anything. I scored higher on it than the average person using it to apply for work in my area.\nAn IQ test has shown me to be in the 99.9th percentile for IQ. This is the highest result the test I was given reaches; anything further and they'd consider it to be within the margin of error for that test.\n\nMy mother's boyfriend of 8 years is a Spatial Analyst who graduated ESRI lectures. At the age of 15, I understand GIS better than him, and I owe very little of it to him, as he would rarely give me a decent explanation of anything, just tell me that my ideas were wrong and become aggravated with me for not quite understanding thermodynamics. He's not particularly successful as an analyst, but I've met lots of other analysts who aren't as good as me at GIS, so I'm guessing that's not just a result of him being bad at it.\nI'm also pretty good at CS. I don't have a degree, and other than GIS I don't have a better understanding of any aspect of geomatics than any actual analyst, but I have lots of ingenuity for inventing new things. For example, I independently invented kriging before finding out what it was, and I was only seven or eight years old when I started inventing georeferencing solutions (my first idea being to use a powerful infrared laser to transmit coordinates; admittedly not the best plan).\n\nI have independently thought of basically every branch of geography I've come across. Every question of projections which I've seen discussed in SMBC or xkcd or Reddit or anywhere else, the thoughts haven't been new to me. geography has pretty much gotten trivial for me; I've considered taking a geography course just to see how easy it is.\n\nPsychology, I actually understand better than people with degrees. Unlike geomatics, there's no aspect of psychology which I don't have a very good understanding of. I can debunk many of even Sigmund Freud's theories.\n\nI'm a good enough writer that I'm writing a book and so far everybody who's read any of it has said it was really good and plausible to expect to have published. And that's not just, like, me and family members, that counts strangers on the Internet. I've heard zero negative appraisal of it so far; people have critiqued it, but not insulted it.\n\nI don't know if that will suffice as evidence that I'm intelligent. I'm done with it, though, because I'd rather defend my maturity, since it's what you've spent the most time attacking. The following are some examples of my morals and ethical code.\n\nI believe firmly that everybody deserves a future. If we were to capture Hitler at the end of WWII, I would be against executing him. In fact, if we had any way of rehabilitating him and knowing that he wasn't just faking it, I'd even support the concept of letting him go free. This is essentially because I think that whoever you are in the present is a separate entity from who you were in the past and who you are in the future, and while your present self should take responsibility for your past self's actions, it shouldn't be punished for them simply for the sake of punishment, especially if the present self regrets the actions of the past self and feels genuine guilt about them.\n\nI don't believe in judgement of people based on their personal choices as long as those personal choices aren't harming others. I don't have any issue with any type of sexuality whatsoever (short of physically acting out necrophilia, pedophilia, or other acts which have a harmful affect on others - but I don't care what a person's fantasies consist of, as long as they recognize the difference between reality and fiction and can separate them). I don't have any issue with anybody over what type of music they listen to, or clothes they wear, etc. I know that's not really an impressive moral, but it's unfortunately rare; a great many people, especially those my age, are judgmental about these things.\n\nI love everyone, even people I hate. I wish my worst enemies good fortune and happiness. Rick Perry is a vile, piece of shit human being, deserving of zero respect, but I wish for him to change for the better and live the best life possible. I wish this for everyone.\nI'm pretty much a pacifist. I've taken a broken nose without fighting back or seeking retribution, because the guy stopped punching after that. The only time I'll fight back is if 1) the person attacking me shows no signs of stopping and 2) if I don't attack, I'll come out worse than the other person will if I do. In other words, if fighting someone is going to end up being more harmful to them than just letting them go will be to me, I don't fight back. I've therefore never had a reason to fight back against anyone in anything serious, because my ability to take pain has so far made it so that I'm never in a situation where I'll be worse off after a fight. If I'm not going to get any hospitalizing injuries, I really don't care.\n\nThe only exception is if someone is going after my life. Even then, I'll do the minimum amount of harm to them that I possibly can in protecting myself. If someone points a gun at me and I can get out of it without harming them, I'd prefer to do that over killing them.\nI consider myself a feminist. I don't believe in enforced or uniform gender roles; they may happen naturally, but they should never be coerced into happening unnaturally. As in, the societal pressure for gender roles should really go, even if it'll turn out that the majority of relationships continue operating the same way of their own accord. I treat women with the same outlook I treat men, and never participate in the old Reddit \"women are crazy\" circlejerk, because there are multiple women out there and each have different personalities just like there are multiple men out there and each with different personalities. I don't think you do much of anything except scare off the awesome women out there by going on and on about the ones who aren't awesome.\n\nThat doesn't mean I look for places to victimize women, I just don't believe it's fair to make generalizations such as the one about women acting like everything's OK when it's really not (and that's a particularly harsh example, because all humans do that).\nI'm kind of tired of citing these examples and I'm guessing you're getting tired of reading them, if you've even made it this far. In closing, the people who know me in real life all respect me, as do a great many people in the Reddit brony community, where I spend most of my time and where I'm pretty known for being helpful around the community. A lot of people in my segment of the community are depressed or going through hard times, and I spend a lot of time giving advice and support to people there. Yesterday someone quoted a case of me doing this in a post asking everyone what their favorite motivational/inspirational quote was, and that comment was second to the top, so I guess other people agreed (though, granted, it was a pretty low-traffic post, only about a dozen competing comments).\n\nAnd, uh, I'm a pretty good moderator.\n\nAll that, and I think your behavior in this thread was totally assholish. So what do you think, now that you at least slightly know me?", "class": 1}, {"text": "Look at this shit. Look at this STUPID BULLSHIT. \"This application has encountered an error and needs to close\". This shit comes up on my computer. Every. Single Day. Automatically. \"ERROR 9999999.\" Every single day. And every single day I re-run the tool. Do you know why I re-run the tool? Because there is no option to debug the software. I'd like to debug the software. I want to fix this issue and NEVER have to install these BULLSHIT, MEANINGLESS, SUPERFLUOUS, I HATE THEM! I HATE THESE BULLSHIT ERRORS. LOOK AT THIS SHIT. EVERY DAY THIS COMES UP. And you know what happens after you re run the tool a few times? When a few days goes by and you keep trying it over and over because you don't want to fucking talk to some ESRI rep in India, you just want to put it off, this automatic bullshit that interrupts your work and makes you turn off your fucking computer, and you try again every day, eventually it takes away the option to even try again, and it just says, \"These are your only options\", its basically putting a knife to your head and saying you can either fucking wait for the tool to finish and we'll just try to do it successfully FOR YOU or you can just, yknow bite the bullet and shut it off now. It doesn't even give you a choice to say no. It just comes up, whenever it wants, automatically, and says \"FUCK YOU, we're crashing this piece of shit software, no matter what you're doing\". Look at this shit. I AM FUCKING CLIPPING SOMETHING YOU COCK SUCKER. I'M DOING IMPORTANT SHIT. WHY DO YOU NEED TO CRASHING MY COMPUTER. WHAT ERRORS? SOME MORE FUCKING ARC/INFO MODULES THAT WILL CRASN IN 10.3 SO THAT ESRI CAN KEEP WATCHING WHAT I'M DOING, LOOKING AT MY DICK PICS AND WATCHING ME JACK OFF??? SPYING ON ME? JACK DANGERMOD, YOU FUCKING CODE MONKEY! I'M A GIS FAILURE. YOU MADE ME A GIS FAILURE.", "class": 1}, {"text": "Why do I feel like /u/uthorr , /u/fuzzycuff , and /u/mcvittal are all the same geomatics guy arguing with himself, and giving himself gold?\n\nEdit: I've summoned them.", "class": 1}, {"text": "Because I am", "class": 1}, {"text": "yes", "class": 1}, {"text": "What the fuck did you just fucking say about me, you little High School Applicant? I’ll have you know I graduated top of my class in Honours Geomatics, and I’ve been involved in numerous Federal Co-ops, and I have over 300 confirmed rankings on Jobmine. I am trained in spatial analysis and I’m the top ARC/INFO scripter in the entire Faculty of Environment. You are nothing to me but just another point feature. I will georeference you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me on r/uwaterloo? Think again, fucker. As we speak I am contacting my enterprise geodatabase of data across campus and your X and Y are being traced right now so you better prepare for the Clip, maggot. The Clip that wipes out the pathetic little thing you call your entrance offer. You’re fucking mapped, kid. I can map anywhere, anytime, and I can remove your nodes in over seven hundred ways, and that’s just with my basic ARC/INFO license. Not only am I extensively trained in Vector Data, but I have access to the entire arsenal of the United States Geological Services Raster Library and I will use it to its full extent to wipe your miserable shitpost off the face of this page, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will Buffer fury all over you and you will drown in it. You’re fucking Erase Featured, kiddo.\n\n", "class": 1}, {"text": "This is top quality right here.\n*ducks back out*", "class": 1}, {"text": " map shit mapԁ sHit thats ✔ some mapshit rightthere right✔there ✔✔if i do ƽaү so my self 💯 i say so 💯 thats what im talking about right there right there (chorus: ʳᶦᵍʰᵗ ᵗʰᵉʳᵉ) mMMMMᎷМ💯  НO0ОଠOOOOOОଠଠOoooᵒᵒᵒᵒᵒᵒᵒᵒᵒ   💯     map shit", "class": 1}, {"text": "I didn't even do geomatics. Just plain geography. Geomatics wasn't a program when I started. Now I do software engineering full time. So evidently geomatics guarantees you a job tier job. ", "class": 1}, {"text": "So I scroll into my local ESRI dealer looking to buy a copy of Defense ArcGIS. I grab the license and take it to the charming maiden at the register. I say \"pardon me, milady.... But could you ring me up? A shame I don't have your number, or I'd ring you up instead...\" She giggles and takes the license, blushing as her polygon features brush mine due to my large buffer.\n\nHer eyes widen as she reads the license's title \"Wow, I've never seen anyone buy this before! You must do a lot of analysis!\". I smile and ready a witty response when suddenly a voice rings from behind. \"Hahaha look at what this faggot is buying! That's not Education ArcGIS! What a piece of shit!\" I quickly turn around, my spatial extensions clattering to the floor behind me, to discern the source of this rude outburst.\n\nStanding before me is generic GEM caricature with a Geography sweater and \"WATER WATER WATER\" shirt just standing over the guffawing.\n\n\"Excuse me sir... you may disparage my person if you wish, but it is untoward to swear in front of a lady.\"\n\n\"Fuck you faggot!\" The man replied.\n\n\"As you wish...\"\n\nI quickly swing my expanded functionality into his vector data before he can react, he bellows and charges forwards. I expertly sidestep him and the cashier screams as he crashes into the counter. I draw my line feature and mutter a quiet oath as I drive it deep into his map.\n\n\"...ERROR 9999999...\"\n\nAs I clean my blade the girl walks out from behind the counter, twirling her hair with her fingers. \"So...maybe you'd \nlike to come over to my place and use that license sometime... ?\" the cashier asked me.\n\n\"No thanks milady, It's single use only. Besides...\" I send an error report.\n\n\"You're not my type\"\n\nI skate away on my Heelys into the sunset.\n\nEdit: Formatting", "class": 1}, {"text": "That is literally how you buy ArcGIS.\n\nLiterally.", "class": 1}, {"text": "Holy fuck op", "class": 1}, {"text": "Okay. There's an incredibly easy way to solve this. Go to PM. Give me your Skype name. I'll add you and you can talk to me. I will also give you my LinkedIn profile. You can check it while you're talking to me and see that the photo and I are the same person, and also that I have almost a decade's worth of spatial analysis under my belt. Amongst my contacts is the name of the current Dean of Environment. You will be able to see that we've worked on several studies together. This is a 100% legitimate offer. You know why? I'm sick of little shits like you sitting there thinking you know ANYTHING about my industry. You don't know SHIT. So get your ass on Skype and I will show you exactly that. Ball's in your court. \n\nedit: And it you're too chickenshit to do that, you can go back through my history and see the numerous times I've talked about this subject on reddit in the last two years. \n\nedit2: Quick, I don't want you thinking you can wait three hours and then say I had time to fake stuff. Do it right now. Come on, you were quick enough to answer my first post. Within a minute, in fact. You're so damn confident, all over this thread, with your ignorant bullshit about an industry you're nowhere near. Step up, son. I'm already logged into Skype. \n\nedit3: No-show. Of course. Don't know what I was thinking. With a name like 'FuckCaptchas', you're probably 12 fucking years old.", "class": 1}, {"text": "me irl", "class": 1}, {"text": "First they came for the ERS students and I didn't speak out because I wasnt in ERS\n\nThen they came for the planners and I did not speak out coz I wasnt in Planning\n\nThen they came for GEM and I didn't speak out coz I wasnt in pleb Geomatics\n\nFinally they came for Geomatics and no one spoke out coz all the ENV students were gone", "class": 0}, {"text": "You're too good. ", "class": 1}, {"text": "TELL ME ABOUT GOOSE\n\nWHY DOES IT BLOCK THE ROAD", "class": 1}, {"text": "Perhaps he's wondering why someone should shoot a man, before sending him off to finals.", "class": 1}, {"text": "You're a big bird\n", "class": 1}, {"text": "UUUU", "class": 1}, {"text": "4 u", "class": 1}, {"text": "Goose chases AFM kids off E5 bridge, saves day.", "class": 1}, {"text": "He's a honking guardian... a watchful propooper...", "class": 1}, {"text": "SWEAR TO ME! ", "class": 1}, {"text": "Hello", "class": 0}, {"text": "Mr Goose himself", "class": 1}, {"text": "More like the hero we don't need nor deserve.", "class": 1}, {"text": "cause people aren't so stuck up like you are", "class": 0}, {"text": "\"Me and my friends have this great idea that'll make millions, you can be a co-founder if you make the whole fucking thing\"", "class": 0}, {"text": "http://i.imgur.com/Up5Tenq.jpg", "class": 0}, {"text": "dafuq does that even mean?", "class": 1}, {"text": "\"Disruptive\" technology is the investor buzzword for \"the next big thing\". \n\nSmartphones would be an example, the way society worked changed within a decade of them coming to market.\n\nI remember thinking that putting a camera on a phone was stupid because I had a 35mm SLR for taking photos which digital couldn't hope to compete with. A decade later and people are using their phone cameras to do everything from taking photos of their dessert to live streaming events they are attending to the internet. ", "class": 0}, {"text": "Yeah, the modern internet was like that as well. I kinda grew up with the early consumer internet, Win 3.1, and its interesting how much things have changed over 25 years.", "class": 0}, {"text": "Give everyone high doses of radiation so their kids have birth defects", "class": 1}, {"text": "we're disrupting the disruption field with disruptors ", "class": 1}, {"text": "[DISRUPTED]", "class": 1}, {"text": "startups in Waterloo are like mixtapes in Scarborough.", "class": 1}, {"text": "So ... fire?", "class": 1}, {"text": "That's good thinking on the company's part, they know they're going to fail, so they are only going to hire a co-founder for 4 months!", "class": 0}, {"text": "We've hit peak jobmine.", "class": 1}, {"text": "If you go through their LinkedIn profiles, it is an obvious attempt at getting a developer to do all the work. \n\nI can see it now. \"So what did you do at your last co-op term?\" ... \"Well sir, you see I was a co-founder and made minimum wage\". ", "class": 0}, {"text": "What company is this?\n", "class": 0}, {"text": "\"Iris Technologies\". Go check out that LinkedIn.", "class": 0}, {"text": "I don't know about you people, but I don't want to live in a world where someone else makes the world a better place better than we do.", "class": 0}, {"text": "But do they pay in equity?", "class": 0}, {"text": "WeMesh?", "class": 1}, {"text": "D I S R U P T I V E", "class": 1}, {"text": "Facebook was founded by second year students.  So there is that.", "class": 0}, {"text": "I feel bad for who I thought it was now..", "class": 0}, {"text": "Oh right... #fedsdoesthat", "class": 1}, {"text": "Sigh, Feds get ~$300k funding per term and still can't do ish. ", "class": 0}, {"text": "300K........................................................... MFW", "class": 1}, {"text": "You're allowed to swear on the Internet.", "class": 0}, {"text": "There's also all the fuckers who are too lazy to walk their trash to the garbage bins, and instead insist on shoving chip bags between the cushions of chairs.\n\nLet's be honest here, Feds leaving flyers everywhere is annoying, but at least it isn't dirty. The shit some people leave in places makes me want to vomit. I don't even sit on half the chairs in the building anymore just because of how gross they are.", "class": 0}, {"text": "have u seen the cesspit that is math comfy with these nasty fuckers sleeping there after not taking a shower for a week and the putting their filthy feet all over the place???? i hate ppl", "class": 1}, {"text": "Sleeping there is a rite of passage, you aren't a true student until you've done it. Sure, that place gets nasty, but there comes a point when sleep is more important than how dirty the bed is. Thankfully, being female gives me access to a couple nap rooms on campus located inside washrooms.", "class": 1}, {"text": "sry i am civilized human being not a disgusting animal", "class": 1}, {"text": "Can you explain more what a nap room is?", "class": 0}, {"text": "I won't reveal too much details, but there are a few rooms on campus that are fairly private with couches in them.", "class": 0}, {"text": "All this litter reminds me of my hoarder mother, and the abuse I suffered at home. Stop triggering me, feds. #stoptriggeringme", "class": 0}, {"text": "there's also unwarranted sjw propaganda at DP (the he/she/it stick figures \"art\")", "class": 1}, {"text": "But it teaches us *so* much about the complex issues in our society and that these people face!  I understand and am infinitely more aware after seeing those stickers everywhere!  /s", "class": 1}, {"text": "Triggered.  Comment thread terminated.", "class": 1}, {"text": "I've been there. Most of that junk is actual junk, like chip bags, wrappers, and other crap. Also, what is with the BlancRide shit? Feds might be promoting stuff, but who cares. Moving a flat piece of paper is one thing, moving an entire orange peel and a chip bag and some sort of sticky substance from the chair before you sit in it is fucking gross.", "class": 0}, {"text": "Install them higher up so only adults can reach them.", "class": 0}, {"text": "Wow. Some kids in UW still really have no chance of having sex. ", "class": 1}, {"text": "> UW", "class": 1}, {"text": "rekt", "class": 1}, {"text": "> some", "class": 1}, {"text": "These condoms are there for people who need them, to provide 24/7 access because GLOW, Women's Centre, and Health Services are only open during business hours. The dispensers are designed to be able to take only a few at a time. Please do not abuse this resource, or it will have to be removed, which would be sad :(", "class": 0}, {"text": "I'd say just put them at the Turnkey desk and have people ask. People are less likely to take a whole bunch if they have to ask someone, and with someone controlling the amount they get, they'd last longer and be less likely to be abused the way they are now.", "class": 0}, {"text": "The only problem with that is that there are lots of people who are too embarrassed to ask. The washroom is a more private place for those who wouldn't ask a Turnkey staff member.", "class": 0}, {"text": "If they are too embarrassed to ask they probably aren't mature enough to be having sex.", "class": 0}, {"text": "See this makes sense.", "class": 0}, {"text": "The condoms are a solution to STI's and pregnancy, not immature sex lives, how is this even relevant lol", "class": 0}, {"text": "If you're embarrassed to show that you're a responsible, functioning adult that makes good decisions (ie. practising safe sex), your emotional maturity level is probably not able to handle the consequences that can/do arise from having sex.  \nThe people giving out the condoms won't care that you're getting your dick/pussy wet. This is University, not high school.", "class": 0}, {"text": "Those people people are still gonna have sex anyway though. ", "class": 0}, {"text": "Charge a quarter per condom?", "class": 1}, {"text": "The number of people who carry quarters around is probably too low to justify that. Would probably be better to just put a 1-minute cooldown on the dispenser.", "class": 0}, {"text": "That's a neat solution, if hard to implement", "class": 0}, {"text": "Make them put in their phone number -> get a text with a code -> enter code -> free condom.", "class": 0}, {"text": "watcard", "class": 1}, {"text": "Honestly if you had to swipe to take, they wouldn't necessarily even need to charge, just put caps on high-use accounts.  ", "class": 0}, {"text": "\"The administration discriminates against me for having too much sex!\"", "class": 1}, {"text": "I think that if the student could demonstrate that their exceptionally high condom usage was all due to having massive quantites of sex, then adminstration wouldn't begrudge a higher cap for them.  The desire after all is that students having sex do so safely.  Our sexual statistical outlier could just eat into the allocation nominally reserved for mathies ;).  ", "class": 0}, {"text": "Hah. Reminds me of the orientation packages we received as first years in residence. All of the mathies received either one or zero condoms. Most other faculties got two. One of the engineers got four (and it was in fact the person most likely to use them quickly).", "class": 0}, {"text": "I actually think it's a great idea. Hopefully, the novelty will wear off and we'll act more maturely.\n\nIt would be a shame if we had to get rid of it because a few people think they're held to the same standard as a 13 year old.", "class": 0}, {"text": "It takes a few to ruin it for many. Also, sex-ed is not taught properly in middle and high school and so many approach sex much like a 13 year old would. As they say, \"Behind every skeptic is a disappointed optimist.\" and I am one of those skeptics.", "class": 0}, {"text": "condoms are immoral\n\nEvery sperm is sacred", "class": 1}, {"text": "People have apparently missed the reference here. Sad times...", "class": 0}, {"text": "If every sperm is sacred then a wet dream is genocide. ", "class": 1}, {"text": "Then go get a vasectomy so none of your sperm will ever leave the safe confines of your balls then. ", "class": 0}, {"text": "[This is relevant](https://www.youtube.com/watch?v=fUspLVStPbk)", "class": 1}, {"text": "This went over so many heads...", "class": 0}, {"text": "One of the lesser known Monty Python skits I think.", "class": 1}, {"text": "Shows how immature the boys are at the school. The dispenser in the girls washroom is full. ", "class": 0}, {"text": "Hooray for sexism!", "class": 1}, {"text": "Is it now? On Friday it was empty and the day before it was full", "class": 0}, {"text": "Turnkey didn't give them out for free last time I asked (admittedly, a year ago).", "class": 0}, {"text": "Nowadays they have a bowl on the counter.", "class": 0}, {"text": "Sometimes they have a bowl on the counter. Sometimes, they don't. It's been like that for at least the past 5 years.", "class": 0}, {"text": "The food bank offers them too! They're on a shelf with food in the back of the room so it's probably the most discreet option :)", "class": 0}, {"text": "Do they have Magnum XXXXL?", "class": 1}, {"text": "Just tape up a garbage bag with electrical tape mate and you'll be set.", "class": 0}, {"text": "How do you eat a condom", "class": 1}, {"text": "Turnkey only gives them out when Health Services has extra that they donate, not all the time.", "class": 0}, {"text": ">Also, if you want something to put on your penis that's laughable, buy it a top hat or something.\n\n[nsfw](https://i.imgur.com/JMWr1CN.jpg)", "class": 1}, {"text": "Wow that's probably one of the most polite asking for notes messages I've seen. Totally did not require those asshole remarks. Did the person who responded name show up? ", "class": 0}, {"text": "That's why I'm so annoyed at this. :( It was a very polite request that really did not warrant such a response.\n\nThe guy who responded included his full name in his signature. I erased it though, in case someone gets any funny ideas. ", "class": 0}, {"text": "I don't understand how some people can be so socially inept. I've been told that some coop employers day that Waterloo students can come off as rude and entitled, it's things like this that fuel that stigma", "class": 0}, {"text": "i totally agree with you. That reply is completely unnecessary and is in no way constructive. I just don't understand what the sender was thinking when he sent that, and what he was trying to achieve. ", "class": 0}, {"text": "I see it all the time when I was attending UW.\n\nIt's the \"I'm smarter than you so I can act like an asshole syndrome.\"\n\nThe sad thing is that they don't even know it.\n\n", "class": 0}, {"text": "This is also a reminder to bcc: everyone on emails like this.", "class": 0}, {"text": "YES x100", "class": 0}, {"text": "This reminds me of when I was at uottawa last year...\n\nhttp://i.imgur.com/Q3uygv7.png", "class": 0}, {"text": "Yikes. That is cringe-worthy.", "class": 0}, {"text": "And now the poor guy might never have the courage to reach out for help again ...", "class": 0}, {"text": "Welp that guy who replied won't be able to rely on anyone to lend their notes to him/her now. ", "class": 0}, {"text": "Not at all. Shitty people exist everywhere obviously, but Waterloo is not some special breeding ground for this. The people here are nice!", "class": 0}, {"text": "Reddit is Exhibit 1A for jerking over the internet. ", "class": 1}, {"text": "You're only in 2A. People turn really bitter as the year goes by.", "class": 0}, {"text": "People turning bitter is a bullshit cop out. Shit to deal with only increases after graduation if you cant handle upper year quit now.", "class": 0}, {"text": "Things get better after graduation.\nI have no idea what you're talking about.\nSeriously, my life is so much better after I left UW.\nI'm more fit, happier, etc.\n\n\n", "class": 0}, {"text": "Nope, nope and nope. Your perspective just changed.", "class": 0}, {"text": "3 Nopes in one sentence, I'm convinced.", "class": 0}, {"text": "I would expect this to happen but I have many upper-year friends and two housemates in fourth year and they don't seem any less friendly than my peers... I guess I'll know for sure in three years.", "class": 0}, {"text": "\"Candidate for BMath\"\n\nLmao, woopty fucking doo.", "class": 1}, {"text": "Hey! I actually have stat 340 notes with me! If you need them here you go! [http://www.filedropper.com/stat340lecturenotesfinal](http://www.filedropper.com/stat340lecturenotesfinal)", "class": 0}, {"text": "well, no matter how polite you are, this email is basically a spam to everyone in the class. If you need help, post on piazza, ask prof or simply go to class and ask the guy besides you. Group sending uwaterloo email is VERY annoying. This replier probably have seen way too many emails like these.", "class": 0}, {"text": "If you lose your shit over e-mails you have bigger issues...", "class": 0}, {"text": "Yeah, seriously. I wish the biggest problem in my life was spam email. But noooooo, I have bills and responsibility etc. etc. Silly me.", "class": 0}, {"text": "Not sure why you're getting downvoted.. This is probably the very reason that triggered this response. On average I get one of those per week (almost always for a psych course too) and no matter how nicely they ask it gets seriously grating after a while. That response obviously went overboard, but at least I can see why it would've made someone so annoyed/angry.", "class": 0}, {"text": "Someone did that to me this semester too. They sent me fake notes that said \"GO TO CLASS' and CC'd the entire class. I was really polite too and offered to trade notes for anything they'd missed. Sorry I missed one fucking class?\n\nPeople are assholes.", "class": 0}, {"text": "Why don't you release the name so we can all beat the piss out of him", "class": 1}, {"text": "well just search up \"waterloo actuarial science 2017 candidate\" and the 3rd link looks about right", "class": 0}, {"text": "We should light a bag of poop on fire and put it at is doorstep...dat butt chin tho", "class": 1}, {"text": "\"BE NICE! BE NICE\"\n*Punch* *kick*\n\"BE NICE DAMN YOU!\"", "class": 1}, {"text": "( ͡° ͜ʖ ͡°) ", "class": 1}, {"text": "[( ͡° ͜ʖ ͡°)](https://www.reddit.com/r/dirtymindbots)  \n    *DiblertMelendez, you have summoned me?*", "class": 1}, {"text": "well...that escalated quickly....", "class": 1}, {"text": "[We found him y'all](https://www.linkedin.com/in/ssciclun)", "class": 1}, {"text": "Jesus people are so uptight about this shit. ", "class": 0}, {"text": "Jeez, hope everything's okay. \n\nThis is the first time I've stumbled upon my school's subreddit on top>hour as opposed to just searching it.", "class": 0}, {"text": "HE'S ALL GOOD guys. It's just that UW ECE can be really stressful. Good luck to all ECE's out there. Keep working hard!!", "class": 0}, {"text": "good to hear he is okay, hopefully this wasn't some cruel prank played on the mom", "class": 0}, {"text": "hes prob in danger from that midterm that just destroyed us\n\nbut in all seriousness i dont know any davids", "class": 0}, {"text": "Is your league name transpiercer. I think I've played with you and have you on my friend list lol wtf", "class": 0}, {"text": "yes who r u", "class": 1}, {"text": "IGN is Diana Jungle, I think we just played like one time a few months ago lol. Cool coincidence", "class": 0}, {"text": "Right I have you on my FL but dont remember from where. Haha", "class": 0}, {"text": "Dude there are Davids in our class...", "class": 0}, {"text": "transpiercer doesn't go to class though. He pretty much only knows his lab partners and league buddies ;)", "class": 0}, {"text": "ECE fam :(", "class": 1}, {"text": "Glad everything is ok.", "class": 0}, {"text": "ask them to submit a cover letter and two letters of reference from people you have known for at least five years.", "class": 0}, {"text": "Seriously. Where the fuck am I gonna get 3 letters of reference over a weekend?", "class": 0}, {"text": "fucking chalk river", "class": 1}, {"text": "To be fair it's for security and it is a nuclear facility ", "class": 0}, {"text": "how does having a 5 year reference make a candidate more safe? wont it make more sense if they just ran things like background checks or security clearance? ", "class": 0}, {"text": "Well they are doing a background check. And also because it's standard for secret clearance, I had to do it for chalk river and it's not that bad and I also had to do it when I worked in defence. \n\nI also needed to get references from people when a tech company did a background check on me.\n\nThe 5 year thing is probably just so that you can't just quickly become friends with someone and then ask them to vouch for you. ", "class": 0}, {"text": "Right? I wanted to apply there so badly. I don't even mind that it's all the way up in Chalk River, just imagine how sweet \"Canadian Nuclear Laboratories\" would look on your future resume. Plus, there aren't many applicants and there are plenty of openings, so chances are pretty decent.\n\nEdit: Shit grammar.", "class": 0}, {"text": "i dont think i have known a person for five years whom i know professionally. If you want to hear how great my mom thinks I am, I still wouldnt get it, my mom doesnt think i am that great.", "class": 0}, {"text": "I think this is new, but you can now submit a professional reference that you knew for less than 5 years and a personal reference that you knew for 5 or more years as a substitute for 1 professional reference that you knew for 5 years. \n\nThis is still a huge barrier, unless they expect people to have their middle school teachers to refer them to a nuclear lab. ", "class": 0}, {"text": "\"Co-founder position available\"", "class": 1}, {"text": "Drivers license required.  \n\nPaid parking lot available.", "class": 1}, {"text": "Sounds like a pyramid scheme ", "class": 0}, {"text": "I'm looking at you, job with \"Answer three of these nine technical questions and submit a one-page coding sample\".\n\nApplied with just my resume lol.", "class": 1}, {"text": "I mean, when it's you and two other people who've applied, you're probably going to get an interview at least.", "class": 0}, {"text": "\"must have minimum 80% average\"", "class": 0}, {"text": "\"Cover letter required.\"\n\nHaven't written a single cover letter and still got a job that said they wanted one", "class": 0}, {"text": "I always see jobs posted that require one to have their own vehicle but pay just over min wage.  Who can afford a car on $14/hour?", "class": 0}, {"text": "\"Cover letter required\" \n\nAaaand stop right there. Red card, I'm out. No one competent asks for a cover letter in tech jobs to be quite honest. You know it's gonna be a shitshow at that exact moment.", "class": 0}, {"text": "I once didn't notice that a company required a cover letter, and just sent a resume. Still got an interview. ", "class": 0}, {"text": "I remember Khan Academy being the annoying exception.", "class": 0}, {"text": "for me its just that I'm too lazy to write one", "class": 0}, {"text": "you should never read job descriptions\n\nif you are new it is only discouragement and if you are old you can just ignore it", "class": 0}, {"text": "??? but then how do you even know what the job is?", "class": 0}, {"text": "My way:\n\nForget to post the job.\n\nFuck. Anyone want a stressful af YCW14 startup job working on real shit? Mobile/Web/Fullstack/all of the above. \n\nPre series A, buncha big clients (Tinder, Target, RMN, more) that you work directly with.. engineering team of 3. Toronto. MaRS. Good pay. Hard work. \n\nAnyone? Anyone?\n\nI'll pick from the round 2 scraps. ", "class": 1}, {"text": "You hiring people still looking for spring co-op? (Pls save me)", "class": 0}, {"text": "Send me your resume in pm", "class": 0}, {"text": "¯\\_(ツ)_/¯ poor Vic.\n\nEither way, piggybacking to say it's super cool shit :+1:", "class": 1}, {"text": "I would but I don't know shiiiit", "class": 0}, {"text": "Lots of great kids get to round 2 I think. If it was me, I'd look out for those first year prodigy's that don't have a huge amount of experience.", "class": 0}, {"text": "It's more of a senior job for sure. ", "class": 0}, {"text": "Does the coop get 25% equity?", "class": 0}, {"text": "Pffft naw", "class": 1}, {"text": "Is all about those jobs with \"personal transportation is an asset but not required\".", "class": 0}, {"text": "What did you think personal transportation was? A liability? ", "class": 0}, {"text": "It could be an equity.", "class": 0}, {"text": "\"Include a minimum one page writing sample\"", "class": 0}, {"text": "\"Please note that there will be a 30-minute related written exercise during the interview process\" \n\nJokes on you, I like writing stuff. ", "class": 1}, {"text": "Them: \"Cover letter\"\n\nMe: \"See ya\"", "class": 1}, {"text": "So basically, be RBC.", "class": 0}, {"text": "Well they're RBC and should be ignored on that front", "class": 0}, {"text": "Step 1:\n    WeMesh job opening", "class": 1}, {"text": "3 and 5 piss me off so much lmao", "class": 1}, {"text": "finna ride my bike to afghanistan", "class": 1}, {"text": "just when I thought it couldn't get danker ", "class": 1}, {"text": "wait til we get /u/shitty_watercolour to draw [Mr. Paninos](https://media-cdn.tripadvisor.com/media/photo-s/04/ce/05/40/mr-panino.jpg)", "class": 1}, {"text": "definitely would be the peak of our entire institution", "class": 0}, {"text": "Someone needs to make a 3D rendering", "class": 0}, {"text": "This really Microsoft Paint'd my Panino's meme", "class": 1}, {"text": "Dfkm", "class": 1}, {"text": "I just got the WeMesh rank. It's a JobMine miracle!", "class": 1}, {"text": "Congratz! I got one too. Maybe we'll see each other there :')", "class": 1}, {"text": "I didn't :'(", "class": 0}, {"text": "hahahahahahahahahahahahahahahahahahahahahahahahahahaha", "class": 1}, {"text": "at least you got selected for an interview with that dank WeMesh, fam", "class": 1}, {"text": "dafuq is this WeMesh meme?", "class": 1}, {"text": "WeMesh is just a particularly dank employer. According to my roommate who works there they have teams dedicated to \"hacking netflix\" and automating the production of dank maymays.", "class": 1}, {"text": "Okay that's not true. They have a VR team who is trying to make a VR app similar to Netflix's. ", "class": 1}, {"text": "Holy shit. They brought something like that up (about Netflix) in the interview, actually.\n\nMemes aside, what does your roommate think of them? I just realized I might have an offer from them and then just rankings for a few other places, not sure if I wanna take a risk on them...", "class": 0}, {"text": "what the fuck did i just read", "class": 0}, {"text": "WeMesh is no meme. It's probably the greatest shitpost ever.\n\nIt's this startup where the 2 founders are doctors fresh out of med school, who wanted to be millionaires and disrupt shit and cash out, and have no idea how to code. I think they do the most advertising for their product during info session times. From what I gather, their product is some video synching app, like TogetherTube or something, where you can watch things with your friends. They're known for hiring high numbers (~15) of co-op students and having a high co-op to student ratio. Basically they took a sip out of their Kool-Aid and got drunk, and think it's the greatest shit ever. Overall, 5/7", "class": 0}, {"text": "6/7 with rice.", "class": 1}, {"text": "> high co-op to student ratio\n\nShouldn't it be ~1 usually?", "class": 0}, {"text": "I feel like most places usually hire 1-2 co-ops, and then a team will have 5-6 full-time employees, so the ratio sits at around 2 full-timers per 1 co-op student. But I dunno, I've only had 1 work term so far and sample size = 1.", "class": 0}, {"text": "Let's read that again\n\n> co-op to student ratio\n\n", "class": 0}, {"text": "lol, that's what I get for posting so late! :)", "class": 1}, {"text": ">The first years were nestled all snug in their crappy v1 beds, While visions of San Francisco danced in their heads\n\nBrilliant, OP.", "class": 1}, {"text": ">With job mine open I spy an active app now fresh, I knew in a moment it must be WeMesh\n\nLiterally had this just happen (company similar to WeMesh)...", "class": 0}, {"text": "Posts like these make life worth living", "class": 0}, {"text": "Darth", "class": 1}, {"text": "Net", "class": 0}, {"text": "> Sun Microsystem\n\nwas this written in 2010", "class": 1}, {"text": "No, but 2010 was the last time they upgraded Jobmine", "class": 0}, {"text": "Dardikus", "class": 1}, {"text": "Pm me your poem bruh, shit was so dank ", "class": 0}, {"text": "Was confused as fuck fir a second and then I got it haha", "class": 1}, {"text": "Use 2 line breaks bruh", "class": 0}, {"text": "Man, have you heard of the period?", "class": 0}, {"text": "it's because his line formatting is messed because of leddit markdank", "class": 1}, {"text": "University of Waterloo Simulator 2016", "class": 1}, {"text": "I'd pay for a goat simulator mod", "class": 1}, {"text": "You guys should have used Pied Piper for this. ", "class": 0}, {"text": "bruh what's your Weissman score", "class": 1}, {"text": "this is even better than the math 135 livestream", "class": 0}, {"text": "This is a thing?", "class": 0}, {"text": "How do you keep your drone up there for so long?", "class": 0}, {"text": "> How do you keep your drone up there for so long?\n\nWith your tuition dollars!\n\nKidding aside, it's just a webcam pointed at the goose from my office window.", "class": 0}, {"text": "How do you keep the webcam on your drone powered, and why do you keep the drone on the wrong side of the office window!?", "class": 0}, {"text": "I did a BCS, that was a hardware problem.", "class": 0}, {"text": "I love this response.", "class": 0}, {"text": "wow, so exciting", "class": 1}, {"text": "I hope you're not getting turned on by this /u/thegooseandthegander, we're not *that* kind of stream.", "class": 1}, {"text": "This is field work for me. ", "class": 0}, {"text": "Usually frowned upon, it was sitting in the exact same spot for 2 weeks through 2 snowstorms and we didn't think her reserves would last much longer.", "class": 0}, {"text": "Just FYI, feeding bread to geese and other birds is usually discouraged because of the lack of protein it provides. Maybe give it chicken feed if you're going to feed it somewhat regularly.", "class": 0}, {"text": "Noted. We'll be better humans next year.", "class": 0}, {"text": "> poop machines.\n\n[Bioengineering](https://uwaterloo.ca/bioengineering-biotechnology/) has to start somewhere.", "class": 1}, {"text": "How can I donate to this cause?", "class": 0}, {"text": "As mentioned to /u/Frabbit:\n\n> There's not much to really fund, we're reusing old webcams and the university's bandwidth to stream it to YouTube.\n\n...unless you want to be [#disruptive](http://www.redbubble.com/people/agentsql/works/15964423-university-of-waterfowl)", "class": 0}, {"text": "That squirrel is braver than the majority of the students at this university.", "class": 1}, {"text": "Oh, it's you! Thanks for the textbook pdfs, really helped me throughout high school.", "class": 0}, {"text": "Yup, that's me!", "class": 1}, {"text": "I'd rather watch a condor hatch and someone dying ", "class": 0}, {"text": "Once the eggs hatch, is someone going to bring the goslings down? It's not like they can live up there till they can fly, since they eat by themselves, and eat way too much for parents to be able to somehow feed them.", "class": 0}, {"text": "They fall down to the ground, which isn't as morbid as it seems. Last year, when we didn't quite have a live stream going, I witnessed them walk along the ledge and flop to the dirt below. They survived and wandered off somewhere and I lost track of them.", "class": 0}, {"text": "Is there a way we can help fund this", "class": 0}, {"text": "There's not much to really fund, we're reusing old webcams and the university's bandwidth to stream it to YouTube.", "class": 0}, {"text": "They've hatched!\n\nhttp://www.cbc.ca/news/canada/kitchener-waterloo/university-waterloo-goslings-goose-cam-1.3553834\n\n\nQuestion... how do they get off the roof?", "class": 0}, {"text": "9.81 m/s^2", "class": 1}, {"text": "lol, well if the babies of Barnacle Geese can sustain 400 foot drops wile bouncing off rocks...\n\nhttp://www.dailymail.co.uk/news/article-2816408/Wait-Incredible-moment-tiny-barnacle-goose-follows-mother-leaping-400-feet-clifftop-miraculously-survives-despite-not-able-fly.html", "class": 0}, {"text": "They fell off today.", "class": 0}, {"text": "I'm sitting here shitting and every single person who has used the urinals is just walking away after pissing", "class": 1}, {"text": "It could be worse. Yesterday a guy in the stall next to me finished up and walked out without washing his hands.", "class": 0}, {"text": "It's 2015, the urinal should flush itself.", "class": 1}, {"text": "Guy wasn't using the urinal...", "class": 0}, {"text": "It could be even worse, yesterday a guy in the stall next to me finished up and washed his hands in the unflushed urinals\n", "class": 0}, {"text": "`A`\n\n     \n     \n     \n\n`M`  \n`AO`", "class": 1}, {"text": "That is disgustingly common. ", "class": 0}, {"text": "Worse is when people take a shit and dont flush the toilet. So pls OP flush the toilet", "class": 0}, {"text": "Worst is when they shit in the urinal.. If they flush or don't flush.", "class": 0}, {"text": "I did, I'm not a savage.", "class": 0}, {"text": "maybe forget, because of all these fancy auto flushing urinals everywhere", "class": 0}, {"text": "I think it's because they only pull down on the handle once, when you actually have to hold it down to get it to flush properly.", "class": 0}, {"text": "Follow them out of the washroom stealthily and lambast them for not washing/flushing in public. That'll get 'em.", "class": 0}, {"text": "Some kid on my floor pissed all over the seat, didn't flush or clean up at all and just left. Well, at least we have more than 1 urinal&cleaners(who I feel really sorry for...)", "class": 0}, {"text": "Time to John Cena some people from behind.", "class": 1}, {"text": "[RKO](https://www.youtube.com/watch?v=1TQ1I6Ey5hc) the bastards", "class": 1}, {"text": "To answer seriously, the culture in China is to flush the toilet before use. If you need to use it, you flush it, and not care about the next person. As you know, there are lots of people who were born and raised in China at UWaterloo. \n\nIt's not to say everybody is like this, but it is extremely common amongst Chinese people. \n\nEdit: I guess there are more water saving environment preserving people than it I initially thought. I'd like to clarify that this isn't the only reason nor am I hating on Chinese people as a whole, but simply what I've observed to be a common occurence. I hope I haven't offended anyone, and if I did then you deserve to be offended.", "class": 0}, {"text": "Don't blame this on people from China. I'm from Canada and I never flush a urinal because I was taught \"If it is yellow let it mellow, if it is brown flush it down\". For me it's simple water conservation.", "class": 0}, {"text": "I'm not, there are other factors too, but it is definitely more prevalent than your water conservation reasoning. ", "class": 0}, {"text": "where exactly are you from?  really small town with nothing but septic tanks or something? ", "class": 0}, {"text": "I've actually heard and grew up with the same phrase, and I'm from Waterloo. \n\n[](#goose)", "class": 1}, {"text": "I don't really think this is a valid reason. It's polite to learn the cultural customs of a country when you go there, especially regarding personal hygiene.\n\nThen again, it's a urinal, who gives a shit? As long as you aren't pissing all over the floor then whatever.", "class": 0}, {"text": "The better question is: Why are you fuckers pissing in the stalls and subsequently all over the place?", "class": 0}, {"text": "People don't wanna touch a handle that likely other people touched after holding their penis", "class": 0}, {"text": "HA! You're complaining about flushing. What about all the idiots who don't even wash their hands? Disgusting.", "class": 1}, {"text": "My dick is probably way cleaner than the urinal handle LOL", "class": 1}, {"text": "Agreed, after flushing you will be washing your hands anyway.\nNothing sicker than pissing and having someone's urine splashing back at you because they didn't flush.", "class": 0}, {"text": "Diffusion of responsibility. ", "class": 0}, {"text": "Ok that's pretty bad but the worst part is all the fucking pubes on the urinals... like what the fuck, do you shed down there or something? and holy fuck those fuckers are like 3 inches long. Trim it once in a while!", "class": 0}, {"text": "OP, don't be a little whiney bitch.  If it's yellow, let it mellow.  Why waste the unnecessary water?  A little bit of pee never hurt anyone.  And if you're shitting in a stall then it shouldn't even matter to you if you're not using the urinal.  But again, stop being a whiney bitch.", "class": 0}, {"text": "It's a huge waste of water. Is your piss too special for dirty water?", "class": 0}, {"text": "its not a waste of water. Its unsanitary not to flush. ", "class": 1}, {"text": "How is it unsanitary? It's not like you sit there and dangle your junk in it. ", "class": 0}, {"text": "If you can't handle it, then don't use the washrooms at school.", "class": 0}, {"text": "How about properly use the urinal and  fucking flush and then I'll be able to handle it ", "class": 0}, {"text": "Posting on this subreddit will change absolutely nothing. If you want to raise awareness, hang some posters up.", "class": 0}, {"text": "That's political science for you fellas. Changing the world through posters.", "class": 0}, {"text": "Why is everybody so mad when they see my fair says I'm in political science?", "class": 0}, {"text": "Did you not read the previous posts about them? I heard it was founded by two docs who wanted to be disruptive.", "class": 0}, {"text": "Yeah two arrogant docs that don't know technology. They were both dressed up like a typical big 4 banks CEO, they apparently don't know how to run a tech start-up. Was talking on their phone during the interview. When I asked them questions about the position, they didn't have any idea about it! ", "class": 0}, {"text": "I read this in Donald Trump's voice ", "class": 1}, {"text": "China!", "class": 1}, {"text": "Those guys aren't winners, like I am. ", "class": 1}, {"text": "They don't have big hands either", "class": 1}, {"text": "I know nothing about this company, but I read so much shit like this on r/uwaterloo. If what everyone is saying is accurate then... How does a company like that still exist?", "class": 0}, {"text": "OR Maybe only people dissatisfied about company posts about it ", "class": 0}, {"text": "Cos Software industry is fucked. You can literally raise money on anything these days. ", "class": 0}, {"text": "also see: watrhub. Look at their website. Can you figure out what they actually do?", "class": 0}, {"text": "They seemed like a good company when they interviewed me. They do data science related to the water industry.", "class": 0}, {"text": "Is there a dark story about WatrHub too? Care to elaborate?", "class": 0}, {"text": "The company hierarchy is:\n\n2 sales people\n\nAn HR person\n\nCo-op students", "class": 0}, {"text": "To be fair, that's not terribly uncommon. Lots of companies survive off contracts they hunt/get from word of mouth in the industry.\n\nSee Labforge for example", "class": 0}, {"text": "\n>As business become more data-centric, WatrHub's data-mining will provide the essential pivot to enable this paradigm shift in the water market", "class": 0}, {"text": "I had a couple problems with them. I had an interview at the beginning of the term, and they were super confusing with their \"key values question\". Maybe they've figured out a way to properly ask their question since then, but for me, they kept changing the question and stumbling over themselves, not being clear.\n\nAt first, they  asked to parse the string into pairs. So I did that, then they said \"oh no no, you're supposed to be generating the string to send\". Basically, it was just super unorganized and I ended up solving 4 permutations of the same question because they were so unclear.\n\nAlso, when I was showing them my past projects, the two founders were just fucking around and not paying attention to me at all. Only 1 out of the 4 people was looking at my mini presentation.", "class": 0}, {"text": "Yeah same experience, no one was paying attention when I was answering the questions that they asked. They were looking at their phones.", "class": 0}, {"text": "Everyone blacklist Google please.", "class": 1}, {"text": "[deleted]", "class": 0}, {"text": "It's a technical question being asked by a non-technical person.\n\nIt's like if your teacher gives you a test that they can't pass", "class": 0}, {"text": "Analogy: You're applying as a Bell phone technician and they ask you in an interview to read out some names and numbers from the phonebook.", "class": 0}, {"text": "It's really easy and doesn't require much knowledge of anything at all. There are good questions that are simple, like FizzBuzz, but this one is just bad.\n\nIt's also easier than the interview problem I got as a coop, which is kinda weird.", "class": 0}, {"text": "Had the same experience when I did the interview for WeMesh, the founders are just pieces of shit, don't work there unless you're a first year that's really desperate for a soft dev job. Wish you could request CECA to blacklist certain companies.", "class": 0}, {"text": "CECA is pretty much at their whim, they hire too many people. Oh, and trust me, their interview antics are nothing compared to how horrible working their actually is. I know people at WeMesh who have had experiences with them that will make your blood boil. But, nobody's talking about it because they're afraid of getting their co-op eval destroyed.\n\n\nIt's quite ironic that a company that aims to make money by helping 'donations' is so ethically dubious.\n\n", "class": 0}, {"text": "how the fuck do non-technical people evaluate technical people based on a technical question. like wtf.\n\nalso i'm kind of surprised they're hiring full-time...", "class": 0}, {"text": "I had a very similar interview experience, but for a co-op position. \nIt was like 20 mins long and the founders came in 15 mins late, on top of that the person who was there on time admitted he never even looked at my resume. When the founders came in, they were basically just trying to convince me how cool their app was, tsting it on my phone and tried to hype it up, and showed me a netflix VR app that they said they wanted to copy. ", "class": 0}, {"text": "Memesh", "class": 1}, {"text": "Was this through JobMine?", "class": 0}, {"text": "[deleted]", "class": 1}, {"text": "You will get laughed out of the room if you ask for 30% equity of any company like that.\n\nMaybe, maybe some smaller percentage of equity if it vests, or maybe a much, much earlier stage startup, but the situation you're describing is pure hollywood", "class": 0}, {"text": "> pure hollywood\n\nProbably pure bollywood at this point", "class": 1}, {"text": "the community is helpful for actual serious posts :(", "class": 0}, {"text": "It definitely can be. Most people just tune into the shitposting, though.", "class": 1}, {"text": "Actually, though. Especially you, you're really helpful around here. Hell, [this is my upvote count for you](https://imgur.com/zqenBVP).", "class": 0}, {"text": "wut?\n\nhow u do this", "class": 1}, {"text": "You press `Print Screen` on your keyboard.\n\nIn case you're being serious, you should get [RES](http://redditenhancementsuite.com/).", "class": 0}, {"text": "nah I was being serious\n\nunfortunately it only shows me the upvotes I'm doing right now after installing it :(", "class": 0}, {"text": "Yeah, reddit doesn't store that data anywhere that the user can get to, so RES can't look into your history at all.\n\nRES just stores the user vote +/- on your computer.", "class": 0}, {"text": "mm I guess it won't keep track of things if I'm on my phone either. Oh well - the night mode is nice on the eyes", "class": 0}, {"text": "The community is so helpful!", "class": 0}, {"text": "Thanks ❤ but I think that's from my shitposting :(", "class": 1}, {"text": "The actual scene from Scrubs was pretty fucking sad tbh.", "class": 0}, {"text": "Thus Spake Autismthustra", "class": 1}, {"text": "I used your flair without asking, plz no sue.", "class": 1}, {"text": "The (TM) is there for a reason kiddo.\n\nYou'll be hearing from my lawyer!", "class": 1}, {"text": ">tfw no gf", "class": 1}, {"text": ">tfw no gf", "class": 1}, {"text": "10/10 well played", "class": 1}, {"text": "What's this wpirg thing I keep seeing?", "class": 1}, {"text": "/r/ not r/", "class": 1}, {"text": "Needs a copy of Cracking the Coding Interview and a github page filled with awful side projects.", "class": 1}, {"text": "Wait a minu.... I cant argue, this is too accurate", "class": 1}, {"text": "By \"side projects\" you just mean the 5 JS repositories they forked", "class": 1}, {"text": "aka the empty repo with a \"WORK IN PROGRESS\" readme.md", "class": 0}, {"text": "New and improved wallpaper for your CS needs: http://i.imgur.com/qrHrnET.jpg\n\nI found that the ratios of white, brown and Asians to be fairly equal in the CS department so I left that joke out.", "class": 0}, {"text": "Choo-choo", "class": 1}, {"text": "> I found that the ratios of white, brown and Asians to be fairly equal in the CS department so I left that joke out.\n\nHow drunk did you get last night?", "class": 1}, {"text": "Ratio is like 8:4:3, close enough >.>", "class": 1}, {"text": "???????????????????", "class": 1}, {"text": "Considering I'm currently one of three white guys in this 45 person CS lecture right now. I'm pretty sure you're wrong. ", "class": 1}, {"text": "There are dozens of us. Dozens!", "class": 1}, {"text": "After reading people's responses, I have come to realize that I had completely ignored the demographic distribution of my CS classes. Or maybe I just skip too many classes.", "class": 1}, {"text": ">Memory leak\n\ntriggered", "class": 1}, {"text": "Has Seashell really become a meme now?", "class": 1}, {"text": "You do good work my friend.", "class": 0}, {"text": "Holy shit, I think the real question is who has enough memory to fucking ``malloc`` a contiguous block of 50000000000 bytes?", "class": 1}, {"text": "If you just malloc 50 bajillion you can get away with it if you don't touch it. See [https://www.kernel.org/doc/Documentation/vm/overcommit-accounting](https://www.kernel.org/doc/Documentation/vm/overcommit-accounting). Also I can't remember if we did this but you can configure address sanitizer to not error out when malloc fails.", "class": 0}, {"text": "Well shit, [TIL](http://www.etalabs.net/overcommit.html).", "class": 0}, {"text": "Malloc'ing 50GB works fine, when I tried to add an extra 0 it gave me an address sanitizer error. I was amazed as well, I was actually trying to get a seg fault :P", "class": 0}, {"text": "You forgot the hentai. ", "class": 1}, {"text": "New Asanagi doujin when?", "class": 1}, {"text": "Windows shell?  That's not leet enough.", "class": 0}, {"text": "Agreed. It should be replaced by \"how to dual boot linux and windows 8\" Google searches, arch linux install error screenshots, and then a screenshot with 11 failed network controller commands in an arch terminal.", "class": 1}, {"text": "Arch Linux install errors, fuckin triggered.", "class": 0}, {"text": "I didn't know Computer Science students had dry hands? Probably from coding so much! xD  ", "class": 1}, {"text": "Needs more hackathon swag.", "class": 1}, {"text": "and then again in 4B because 4A was too easy.", "class": 0}, {"text": "side projects where?", "class": 1}, {"text": "DAE linux??", "class": 1}, {"text": "add a laptop with loads of hackathon/company stickers. add velocity hoodie/tech company tshirts. ", "class": 1}, {"text": "At least they have soft hands", "class": 1}, {"text": "That.\n\nFucking.\n\nMemory leak. *shudders", "class": 1}, {"text": "segfault\nsegfault\nsegfault\nsegfault\nsegfault\nsegfault\nsegfault\nsegfault\nsegfault", "class": 1}, {"text": "Is the pic you?", "class": 1}, {"text": "It's all of us", "class": 1}, {"text": "that was quite disturbing omg :O", "class": 1}, {"text": "is that guy from the top right the pro cross dressing cosplayer! i recognize that pic, he looks really pretty as a woman", "class": 1}, {"text": "It definitely is, I can't find any pics of him though", "class": 0}, {"text": "Dats lacist", "class": 1}, {"text": "Context : Major math 136 exam questions were available and accessible prior to the exam. After the exam a picture of a sheet with most of the exam questions was posted. The reply is to a question that asked if marks would be affected.\n", "class": 0}, {"text": "Wow...", "class": 1}, {"text": "To clarify, not *most*. Literally **every** question that wasn't brain dead easy (like calculate the projection of some vector) was leaked beforehand.  ", "class": 0}, {"text": "Do you happen to know how they were leaked? Like someone managed to access the exam beforehand and handed out copies? Or someone like found the exam in the profs office during office hours and took pics?", "class": 0}, {"text": "i know the person who posted the leaked image, and apparently he was given the image and told not to post it by someone else. that's all the info i've got.  ", "class": 0}, {"text": "Before or after the exam?", "class": 0}, {"text": "Well we can't *confirm* that it was leaked before the exam due to lack of info, but its highly likely. The wording on the questions is *exactly* the same. Most people are speculating that it's a re-typed version of a previous years final (maybe past 136 students can confirm this) that is sourced from a tutoring center of some sorts, and they just got lazy and re-used those questions. The diagonalization and eigen-value question is the exact same, just with different values in the matrix, for example. The actual proofs are word for word.  \n\nI mean, it's possible some kid with photographic memory just remembered most of the questions and typed them out, but theres a few questions mixed in that weren't on the final. Overall it's extremely unlikely this was created and leaked after the final.  ", "class": 0}, {"text": "Shit, I can't even remember the W15 final, even after looking at the leaked questions.", "class": 0}, {"text": "Didn't even need to pay $5 for this ride. ", "class": 0}, {"text": "Paid by the students of MATH136.", "class": 0}, {"text": "[This exchange](http://puu.sh/ogodC/6e92fd23e9.png) is golden  \nedit: removed names and pics", "class": 0}, {"text": "Fucking degenerates ", "class": 1}, {"text": ">degenerates\n\nOr non-degenerate, depends if it has repeated eigenvalues.", "class": 1}, {"text": "Kek", "class": 1}, {"text": "[removed]", "class": 1}, {"text": "[deleted]", "class": 1}, {"text": "u fookin wot m8", "class": 1}, {"text": "It might be a good idea to repost a version with the names blurred out. This might be breaking the personal information rule.", "class": 0}, {"text": "which FB group is this? link?", "class": 0}, {"text": "Private MATH136 group, can't give you the link because there's currently a professor trying to get responses from actual 136 students. If you really wanted to get in, you could probably search for it easily, but i'd prefer if less upper-years join (a lot are trying to get in to see whats up atm)  ", "class": 0}, {"text": "pretty much everyone is against a rewrite", "class": 0}, {"text": "I wouldn't say pretty much everyone. I'm fairly ambivalent, myself.", "class": 0}, {"text": "I bet [this guy](https://www.reddit.com/r/uwaterloo/comments/4eap12/math_136_exam_is_being_written_right_now/) wants one", "class": 0}, {"text": "lol he is the biggest winner here", "class": 1}, {"text": "i just find it funny the guys proud, he be like \"oh yeah i e-mailed him, i'll post the response :)\" then he immediately gets abused for it  ", "class": 0}, {"text": "haha yeah I laughed too, really hope they drop some questions or something", "class": 0}, {"text": "that'd be tough considering from what i can tell, every single proof aside from 2 or 3 (which were the easiest) was leaked, as well as the big diagonalization/eigen value question  ", "class": 0}, {"text": "rumors are saying the exam questions were leaked from easyace edu (chinese tutoring place): http://i.imgur.com/sTnoGZw.jpg", "class": 0}, {"text": "My friends took easyace edu's pre-exam enhancement class before. They could always guess at least 2-3 exam questions right. The guy operates easyace edu earned a ton of money from this. Their pre-exam tutor class is always full(some class has 50+ or more). And everybody pays a lot(like $200ish? I don't remember the price so it might be wrong). I guess their approach is to get all of the previous exam questions from students who took their tutoring class previously. Since most profs just change the exam questions a little bit, they figured out what type of questions would be on the exam.\n\nI highly doubt the leaked questions were not from them.", "class": 0}, {"text": "Yeah my friend told me the same thing, I bet that the exam questions were from previous years and the tutors just collected them and used them as some sort of practice exam. If this is the case I mean they didn't do anything wrong, it is the professor's job to keep the final exam legit", "class": 0}, {"text": "They indeed did something wrong. Past exam questions are copyrighted materials. They are not supposed to use those questions without the permission.", "class": 0}, {"text": "I agree with you 100% but all I'm saying was that imo it is not the students' fault trying to be well prepared and attend tutor sessions in order to improve their final grades, right? All those students have no control over where the course materials used for tutoring came from. ", "class": 0}, {"text": "they are in the room next to me :O", "class": 0}, {"text": "On-campus?  You can call campus police on them.  They're not supposed to be there.", "class": 0}, {"text": "Why they are not supposed to be there? Aren't empty classrooms free to every student? ", "class": 0}, {"text": "Students and the public in general can just come and sit down in a classroom for free.  However, you (an an individual or org separate from the university) can't charge people money to come to an event in a classroom without explicit permission because you're essentially charging them money to use the classroom.", "class": 0}, {"text": "not on campus", "class": 0}, {"text": "I wonder if I, a white person, would be welcome (aside from my money) at these tutoring sessions. Are they even taught in English?", "class": 0}, {"text": "So how did they get a copy of the old final?", "class": 0}, {"text": "Perhaps a previous TA took a copy home.", "class": 0}, {"text": "+1", "class": 0}, {"text": "WeChat customer service lol", "class": 1}, {"text": "I'm feeling very disrupted right now :(", "class": 1}, {"text": "Keep us posted please. I have never heard of this happening, so I am really curious to see the outcome.", "class": 0}, {"text": "Update\n\nTo all Winter 2016 MATH 136 students,\n\nOn Monday afternoon I became aware that the integrity of the Winter 2016 MATH 136 final examination had been compromised.\n\nThe University of Waterloo reminds all members of the community of the importance of academic integrity and the significant consequences of poor decisions. Our students expect us to protect the high value of Waterloo degrees, and this is a responsibility not taken lightly. All members of our community should be aware that the university is well positioned to detect incidents of academic fraud, and will take swift action against all who are caught in such circumstances. The consequences of being caught cheating are significant and individuals risk being expelled and/or arrested depending on the severity of the offence.\n\nUpon investigation, it appears that the tutorial service EasyAce wrongfully acquired questions that subsequently appeared on the final examination. These questions were distributed to students who attended a for-pay tutorial session held without permission on campus. Students who attended the review session may not have been aware that the questions they received would appear on the exam. Nonetheless, this situation is obviously unfair to a large majority of the students who wrote the exam. \n\nI have considered a wide array of options to resolve the situation. I have instructed that the exam be marked as written, that exams from previous terms be retrieved from storage and that a statistical analysis be done on all comparable questions. If it is discovered that there are unexpected material differences in grade distribution on similar questions from the Winter 2016 examination and previous examinations, these questions will be struck from the Winter 2016 examination and the final examination mark will be recalibrated.\n\nStudents who believe that this process places them at a disadvantage will have the opportunity to write a supplemental exam on the theoretic part of the course. The supplemental exam will be available later in April and in the MATH 136 exam slot in both the Spring 2016 and Fall 2016 final examination schedule. Details will be posted on the course website shortly.\n\nBased on the evidence available to me today, I have no reason to believe that there has been a systemic breach of the exam control protocol. Individuals who are identified as having provided University material to EasyAce, or any tutorial service or website, without permission will be subject to University discipline policy.\n\nThe University of Waterloo expects the highest standard of academic integrity from its entire community. We know that the vast majority of our students pursue their academic work honestly. We also understand the challenges associated with the successful completion of your programs. I encourage all MATH 136 students to make use of the extensive resources available: your instructor, review sessions, assignment and midterm feedback, the Tutorial Centre, study skills workshops available through the Student Success Office, and online material and questions available at http://open.math.uwaterloo.ca.\n\nIt is clear that students are upset at what has happened. Since I will not be able to meet with all of the students who are concerned, I would encourage you to post your responses to my decision on the course Piazza site.\n\nSteven Furino\n\nAssociate Dean, Undergraduate Studies\n\nFaculty of Mathematics", "class": 0}, {"text": "well they're conducting a survey, but getting troll responses like [this](http://puu.sh/ogn5t/31e4190568.png)  \n\nmeh", "class": 1}, {"text": "wow.....", "class": 1}, {"text": "From piazza\n\nIt is up to the Associate Dean (and lawyers) to decide what to do in this case.  There are a lot of factors that are being considered.  This will take a bit of time as we are committed to ensuring that everyone is treated as fairly as possible.\n \nAt this time, we are first trying to shut down these illegal companies (they are illegal since they are charging you extra money for service that you shouldn't have to pay for, they are using copyrighted material without permission, they are using a campus room without permission, and are not sanctioned by the university.).  Second, we are trying to determine how much (if any) the leak affected the results on the final exam.\n \nI will certainly let everyone know as soon as something is decided.  Of course, we value your opinions so please let us know\n \nDan", "class": 0}, {"text": "Playing devil's advocate here: how are these companies \"illegal\" in any sense of the word? \"Charging you extra money for services you shouldn't have to pay for\" is hardly illegal (if so, WPIRG and any of the (useless) ancillary fees we pay every year should be \"illegal\"). Neither is \"being sanctioned by the university\" any legal criteria. I guess using copyrighted materials is technically \"illegal\", but even that is extremely hard to prove / get damages for...", "class": 0}, {"text": "Universities take copyright law seriously, and they can get damn good lawyers if they need to.", "class": 0}, {"text": "1.  They're not supposed to be on campus.  They often run their sessions in empty RCH or MC classrooms.  You need explicit permission if you're hosting an event on campus using school property and charging money for it.  \n  \n2.  They often are selling what is considered school property: assignments and sample midterms/finals from previous years, etc.  They usually get these from former students.  This is the same reason you need permission to videotape your professor's lectures.  ", "class": 0}, {"text": "So I gather their primary objective is to make sure this doesn't happen again?", "class": 0}, {"text": "[deleted]", "class": 1}, {"text": "TIL math 136 is syde 312", "class": 0}, {"text": "OH man, I don't know how to answer any of those questions\n\n¯\\\\_(ツ)_/¯", "class": 1}, {"text": "honestly this looks exactly like the exam i wrote in winter 2012.\n \nedit: but its been a while", "class": 0}, {"text": "I wrote an exam 5 hours ago and I don't remember a single question lol. ", "class": 0}, {"text": "Handwriting on the page, gg", "class": 1}, {"text": "From what I recall, the following were on the exams:\n\n6(b), 9, 10, 11, 12(b), 12(d), 13, 14, 15, 16\n\nHoly shit that is a lot. Fuck the cheaters. I studied hard and legit for this (ok, I lied about the hard part, but I did study).", "class": 0}, {"text": "This looks a lot similar to the Winter 2015 exam that I took...\n\nEdit: to specify,\n\nI'm pretty sure sure 8,9,10,12,15,16 were all on there.", "class": 0}, {"text": "those questions were all present on this years final :)", "class": 0}, {"text": "that moment when you did terrible on the exam and actually want to redo it. \n\nsorry to those who actually did well", "class": 0}, {"text": "Dan Wolczuk is NOT impressed.", "class": 0}, {"text": "Is he the main instructor? Aren't there suppose to be multiple", "class": 0}, {"text": "AFAIK he organizes the course. He even wrote the textbook/course notes that every student uses.  ", "class": 0}, {"text": "There's always one coordinator who oversees the other lecturers. I'm assuming they also have more responsibility in dealing with this stuff.", "class": 0}, {"text": "Source? I was under the impression he was really impressed. ", "class": 0}, {"text": "http://imgur.com/phrl12s", "class": 1}, {"text": "[Bollywood Edition](http://gfycat.com/CarefreeVariableChrysalis)", "class": 1}, {"text": "If you need to cheat for such an easy class, good luck with ur career in math/cs fam", "class": 0}, {"text": "this tbh.\n\nyou won't even make it passed 235", "class": 0}, {"text": "tbh unless you go into graphics, i can't think of any cs courses that really use math 136", "class": 0}, {"text": "CS 349, 370, 371 (requires 235 actually) ... from a quick glance at the undergrad calendar", "class": 0}, {"text": "cs 370/371 are reqs for graphics, people really only take those to be able to take graphics\n\nbut seriously, people are blowing the importance of math136 out of proportion... i don't think math136 is that important of a course and unless you plan on going into CO, MATH, or theoretical CS, it really doesn't matter", "class": 0}, {"text": "Even in graphics, you're dealing mostly with just 3x3 and 4x4 matrices, and you don't have to do a ton of reasoning about them. CS370 (and probably 371) does a fair bit of matrix math IIRC.", "class": 0}, {"text": "Ha, basically this ^\n\nM136: This is an apple, apple is a fruit, you can eat fruits, prove that you can eat an apple.\n\nCS350: This is a system call, now build a kernel. \n\nIf you need to cheat in your first year I feel bad for you for upper years", "class": 0}, {"text": "I'd be interested in seeing what upper years think will be the outcome here. I'm sure this isn't the first time this happened. I doubt they'll do something to negatively affect everyone because of a few cheaters. I'm thinking they're going to try and catch as many cheaters as they can (how would they even do this?) and then do nothing.", "class": 0}, {"text": "[deleted]", "class": 1}, {"text": "A prof posted in the group and said that they won't curve down.", "class": 0}, {"text": "Yeah, curving it down would make no sense as it wouldn't actually punish the cheaters -- their marks would still be higher than the non-cheaters.", "class": 0}, {"text": "They 100% cannot curve it down. Anybody with a lower mark would have a rock-solid case to petition the dean - all they'd have to say is that they were punished for not cheating. This is like a textbook case of when not to curve marks. ", "class": 0}, {"text": "I think only the questions were leaked, not the actual solutions", "class": 0}, {"text": "yup", "class": 0}, {"text": "The prof will probably offer everyone a chance to admit guilt and face less punishment, or stay silent and face expulsion. I feel bad for everyone who didn't cheat. They'd have to bear the paranoia of being falsely accused. ", "class": 0}, {"text": "Probably put exams under the spotlight, look for people who accidentally used numbers or methods that only applied to the leaked exam but not the main one. Probably fail anyone that has conclusive evidence to cheating. Main person who leaked the thing might get put on 1 year suspension? Anyhow, I don't know what they would do in terms of making sure everyone gets a fair mark since it'll be hard to tell who knows their shit and who got the questions. ", "class": 0}, {"text": "> I doubt they'll do something to negatively affect everyone because of a few cheaters. \n\nTell that to the football team.", "class": 1}, {"text": "I know this has nothing to do with academic cheating, but the last time I heard of a large group of people being looked at for cheating at UW, was when the school suspended the football team in 2010. I think it was 9 or 10 players that tested positive for PED's (they tested the entire team). The university governing body (CIS) suspended those players, but the school later on decided to suspend the entire team for the year. They then did a internal review on the coaches, which cleared their names from involvement.\n\nI am also very interested to see how UW handles this situation. Like others said, it'll be difficult to catch them unless they confess. ", "class": 0}, {"text": "I recall rampant midterm cheating in CS 115/116 a few years back; I believe the remedy was to shift the weight onto the final for all students. I have no idea what they'll do this time around.", "class": 0}, {"text": "Never heard of this happening before, so no clue.", "class": 0}, {"text": "5 years in, have never seen anything like this, Wolczuk is going to crucify someone on top of MC.", "class": 0}, {"text": "The original distributor would face expulsion and the sub-distributors would get zero in the course, be placed on probation, and be required to complete ethics course(s). This is a very serious matter and it's not taken lightly. ", "class": 0}, {"text": "5A here, this is what will happen. Also they will likely make a plea deal to those who confess to cheating, and students that confess will also be burned.", "class": 0}, {"text": "Too lenient. Expel them all to set an example. This is far more serious than just cheating on an exam. They fucked up the exam for hundreds of people, wasted a tremendous amount of University resources, and broke pretty much every part of academic integrity in one go. \n\nExpel them all. Good riddance. ", "class": 0}, {"text": "I agree, but in practice that's too many $$$ for the university lost. They'll probably all get away with it. The era of scholars is over; this place is becoming a fucking high school playground joke.", "class": 0}, {"text": "> too many $$$ lost\n\nHow so? They will get a bunch of positive media attention for expelling cheaters, strengthening their image as a morally upright school. This will dispel the notion you have that scholars are a joke: as they stand up for themselves.\n\nWhat makes you think UW is lacking a supply of eager 18 year olds begging to come to their school, anyway? The idiots will get replaced immediately in September. \n\nWorst case scenario they lose less than ~$200,000 (~66 Math students at $3,000 tuition). Not a big deal.", "class": 0}, {"text": "Didn't the answers come from one of those Chinese study sessions? They'd be losing more like $22k per international student then, if they tried to expel anyone who went to it.\n\nThey could probably still replace them tho.", "class": 0}, {"text": "Meh. It's still not that much lost revenue. If any media catch hold that they did nothing about it there will be a lot of negative feedback for UW.. Not good for their prestige/image that they try to hard to innovatively build.", "class": 0}, {"text": "[deleted]", "class": 1}, {"text": "Not to mention losing donations, if people disagree with their actions. \n\nI guarantee this situation is going much higher up the ladder than Wolzcuk and maybe even higher than the Dean of Math.", "class": 0}, {"text": ">Worst case scenario they lose less than ~$200,000 (~66 Math students at $3,000 tuition). Not a big deal.\n\nIt's not just this term, but also subsequent terms up to and including graduation. As also mentioned, international tuition makes it an even bigger loss. However, the impact on UW's reputation must also be carefully considered when deciding what to do with the cheaters.\n", "class": 0}, {"text": ">  also subsequent terms up to and including graduation.\n\nNot really. They can replace <50 people easily with transfers from other Universities that they would otherwise reject.\n\nLike I said originally: there's no shortage of people begging to be here.", "class": 0}, {"text": "Pretty sure they can basically do nothing. The best they can do is find suspicious exams (i.e., ones where a student with a 40% average got a 90), bring the students in, and try to get them to confess. But they have no leverage at all to make them confess, and in 95% of cases there's no way they'll be able to prove they cheated beyond a reasonable doubt. Trying to get everyone to rewrite the exam is logistically out of the question.\n\nSo math 136 will probably just have an inflated average this term, and more people than usual will come out of it not knowing linear algebra", "class": 0}, {"text": "An inflated average and a lack of linear algebra knowledge that will undoubtedly hurt them in the long run. Good job cheaters. I don't understand why people are in University just to cheat. Okay, maybe they will graduate with high grades but then someone will ask them to apply the knowledge that they were supposed to have learned and they will only look foolish. That's the way society seems to be, lazy and always looking for shortcuts. \n\nEDIT: Also, if they need to cheat in order to pass Math 136 then they are in for a rough time. If they aren't very good at math but they actually put in the effort, go to the Prof, go to the TAs, go to the Math help centre, then they would kill Math 136.", "class": 0}, {"text": "Well, there was already a post in the fb group asking in general whether lin alg was needed for upper-year CS courses, and considering how 136 is only a prereq for MATH 239 and one CS course (for BCS students) maybe they won't be affected as much? Rip graphics courses though.\n\nAlso, I wouldn't be surprised if some people actually needed the questions to not fail the course, but if they're at the point of scraping by now then hf in 2A.", "class": 0}, {"text": "Yeah, the only thing you need in MATH 239 that carries over from MATH 136 is how to row reduce matrices, so that you can solve the systems of linear equations... Which is like 1 question tops", "class": 0}, {"text": "Yeah, after M136, I don't recall using any of the stuff I learned, (I didn't take graphics.) Only useful thing was how to row reduce, but if you can reduce an equation you can row reduce. M239 (with Haxell) was actually really fun and easy.  ", "class": 0}, {"text": "I am a firm believer that one should always do their due diligence in everything that one attempts. Choosing not to learn something will only affect one's options later down the road especially when skills/techniques that one could have learned would be justifiable to apply to a problem that they may one day face. I think one should always keep their options open, by refusing to learn something they are limiting themselves, which is foolish. ", "class": 0}, {"text": "Understanding what a vector space is pretty important. Linear combinations pop up in algorithms everywhere (FFT, Simplex, Neural nets to name a few). More important than that even is the ability to think mathematically.", "class": 0}, {"text": "Gonna have to disagree with you here.\n\nYou bring up some good examples of problems which need linear algebra knowledge, but consider your typical back-end dev or mobile dev hire these days. Unless you're working on something specialized, usually linear algebra won't be useful in your day-to-day. Over all 6 (soon to be 7) internships I've worked at, I've _never_ needed to apply my knowledge from MATH 136 (and good thing too, since there's no way I would remember any of that).\n\nObviously if you go into graphics or something you'll need to worry about it, but saying linalg is important for CS in general is wrong (this might not be what you're saying, but I want to make the point).", "class": 0}, {"text": "Sorry, my answer was a response to \"whether lin alg was needed for upper-year CS courses\", not industry. For industry I will say that I myself didn't encounter it much as a backend dev, but as a frontend dev knowing graphics definitely gives me a bit of an edge. Other people I know have similar experiences with AI. But you're correct in saying that it's not needed in general for industry.", "class": 0}, {"text": "A lot of companies will pay a stupid amount of money for devs to create CRUD apps. ", "class": 0}, {"text": "It'll be poasible to rewrite the exam, the exam period is designed to havw the option. This isn't the court of law, beyond a reasonable doubt has no bearing here, people will get expelled for this.", "class": 0}, {"text": "The university doesn't legally need to worry about reasonable doubt, but they hold themselves to that standard for the same reason as our legal system. It sucks to have people pass courses by cheating, but it's much, much worse to fail/expel people who did nothing wrong.\n\nAs for rewriting, there are ~1400 students in math 136 this term. It'll be nearly impossible to get everyone to rewrite the exam, especially given that some people have already finished their exams and left.", "class": 0}, {"text": "Where does it say that the school holds itself to reasonable doubt? I am certain it does not. Not even civil courts are held to reasonable doubt, only criminal courts.\n\nThe exam period is scheduled in such a way to make rewrites possible, unless that has changed it is an option.\n\nThose students that have left are irrelevant, school policy is clear that students must make themselves available for the entire exam period.", "class": 0}, {"text": "I'm not referencing a specific policy, I'm saying that the university chooses to err substantially on the side of letting people off instead of wrongfully punishing people. I TA'd a course once; there were lots of probable cheating cases, some of which we called the students in for, and unless the student confessed to get a lighter punishment, the cheating had to be *extremely* blatant to lead to anything", "class": 0}, {"text": "Oh yeah definitely and the punishments for cheating are quite light the first time it happens. However if they catch wind of the people involved in this, they'll crucify them.", "class": 0}, {"text": "People won't be expelled if the only proof against them is that they have a 40% average and got a 90% on the exam.", "class": 0}, {"text": "That's why they'll investigate and try to dig something up.", "class": 0}, {"text": "There's nothing to dig up. Their only hope is that they can manage to make the student admit to it, or that the student was stupid enough to incriminate themselves on the facebook group or something.", "class": 0}, {"text": "It's not just a student it's a whole \"tutoring\" organization, hopefully it'll make the university act against them and the others that operate in much a similar way.", "class": 0}, {"text": "Yeah, that's pretty messed up. Not sure if the university can actually do anything more than ban them from campus, though", "class": 0}, {"text": "Might be able to pursue them under some kind of law, particularly copyright. If you remember that person that got caught writing an exam for someone, she was charged with fraud if I remember properly.", "class": 0}, {"text": "4A here. Never seen this before. Good luck froshies.", "class": 0}, {"text": "MATH 136 confirmed the most memeworthy course of 2016.\n\nOn a more serious note, I don't know how marks will be affected, but I hope you guys won't have to rewrite. It's logistically very unlikely, but it would suck.\n\n", "class": 0}, {"text": "Is MATH 136 going to become a meme now?", "class": 1}, {"text": "Other than this incident, I heard the course was generally badly managed this term, so possibly.", "class": 0}, {"text": "MEME 136", "class": 1}, {"text": "[deleted]", "class": 1}, {"text": "Why would this be? Doesn't seem logical to bring down the marks of the term after. Or would it. Idk", "class": 0}, {"text": "What's with all the posts leading up to and post Math 136", "class": 0}, {"text": "because math 136 is a difficult course  \n>and post Math 136  \n\nstupid question  ", "class": 1}, {"text": "> because math 136 is a difficult course\n\nlolwat\n\ncome back in 3 years and tell me this", "class": 1}, {"text": "The course itself it boring and somewhat difficult.\n\nBut this term in partciular the whole course was a shitshow, and this is icing on the cake. Pretty much, there's one good prof for 136. They gave a prof (Yeezus) two sections with over 400 people in total and you can't understand 2/3 words he says. The assignments would have 3/7 questions marked (and they made us do some super long proofs and didn't mark them). More than half the midterm was recycled questions from assignments. Just generally poorly organized. So it has become a meme.", "class": 0}, {"text": "https://www.reddit.com/r/uwaterloo/comments/4enf0a/university_is_to_blame_for_math_136_exam_leak/?ref=share&ref_source=link", "class": 0}, {"text": "[deleted]", "class": 1}, {"text": "Had Liu for 135 last term, she was baeeee. ", "class": 1}, {"text": "Who's yeezus,\n\nis it that asian prof who sometimes lectures in Chinese ", "class": 1}, {"text": ">sometimes lectures in Chinese \n\nThat's false. He talks with international students in Mandarin Chinese after class because that's what the students prefer. He would never give the LECTURE in Chinese. ", "class": 0}, {"text": "Christ, I hope you are kidding", "class": 0}, {"text": "Yeah.\n\nHail Yeezus, Yamen.", "class": 1}, {"text": "got any videos of his lectures?", "class": 0}, {"text": "I went to just one of his lectures and was in a really bad seat. So no.", "class": 0}, {"text": "I go to his lectures and he's honestly not that bad. Maybe I have low expectations since I had dupuis last term who put me to sleep every class but at least yeezy tries to engage the students and encourage them to ask questions. ", "class": 0}, {"text": "\"i thought this was lin alg not introduction to mandarin\"", "class": 0}, {"text": "G R A B T H E P O P C O R N", "class": 1}, {"text": "Wasn't it also Math 136 that had Waterloo scanning Watcards for a while?", "class": 0}, {"text": "Nah that was 138. Goshdarn first years.", "class": 0}, {"text": "No. It was 136 (Dan). Afaik, the god 138 prof (Jordan ham) never scanned watcards although our section was packed. ", "class": 0}, {"text": "Can confirm.\n\nSource: Am enrolled in and go to their classes one after another", "class": 0}, {"text": "Loool me too. Are you in Dave's cs by any chance.", "class": 0}, {"text": "I was last term, decided to stay with Nomair because he keeps dropping helpful hints about cs246", "class": 0}, {"text": "I think you're referring to checking watcards before lectures, whereas I was referring to checking watcards during exams.", "class": 0}, {"text": "No, he was right about it being 138. It wasn't about getting into classes, but Fall 2014 had a girl pay a PhD student to write her exam. They had the fake WatCard and everything ready. Her roommate ratted her out. \n\nCoincidentally that was also setup by a Chinese organization. Not sure if they ever found out more, though. ", "class": 0}, {"text": "NEW DANK DRAMA", "class": 1}, {"text": "Holy crap I don't think I've never seen anything like this  \n  \nwhat's supposed to happen: postpone/cancel exam, profs write up a new exam in 1~2 days, and everyone take that exam instead  \n  \nwhat might happen now (most likely expulsion if they can find the one who leaked it): Make everyone do a re-write or admit their mistakes that reusing questions was a bad idea and just mark the exams as it is", "class": 0}, {"text": "I don't think a new exam is an option. People may have other commitments and residence kicks you out after your last exam (which will probably happen before this thing is resolved)", "class": 0}, {"text": "residence kicks you out? Last I saw of the university exam guidelines, you weren't supposed to make travel plans before the end of exam period. Not that I really doubt they would be self consistent.", "class": 0}, {"text": "Yeah, all residences force you out 24 hours after your last exam is. Not saying it'd be impossible to do a rewrite, but it'd result in a LOT of people's travel plans being ruined. ", "class": 0}, {"text": "you have to leave village 1 the day after your last exam, not the end of the exam period.", "class": 0}, {"text": "I dunno about any other residence, but I know that St. Jerome's has a rule stating that you need to move out at most 24 hours after your last exam.", "class": 0}, {"text": "Residence kicking you out after exams wouldn't be a probability. From the University's side, if they order a retake, the residences would comply with University policy (extend the date for finishing exams). ", "class": 0}, {"text": "yeah but the trouble was that residence kicks you out the day after your last exam (which would be today for a lot of people). If this thing wasn't resolved by today, then there would be nothing to comply to.", "class": 0}, {"text": "As a Chinese person, I wouldn't be surprise if it was one of my own behind this...", "class": 0}, {"text": "Half of Waterloo is Chinese, soooo I wouldn't be surprised either \n", "class": 0}, {"text": "Why hasn't anyone been asking what Yongqiang Zhao thinks about this?  It's not just Dan!  #所有教師無所謂", "class": 0}, {"text": "Maybe Yeezus leaked it to the Chinese government.", "class": 1}, {"text": "Plot twist: YZ sold the exam to the students ", "class": 1}, {"text": "I T S H A P P E N I N G", "class": 1}, {"text": "The associate dean and I* are looking into it.", "class": 0}, {"text": "Dis gon be gud\nhttp://imgur.com/S6HAKVZ\n", "class": 1}, {"text": "I guess the profs were too lazy to create new questions, so they use old exam papers. but some student got these old exam papers from their private tutors", "class": 0}, {"text": "selling exam material is illegal for sure. ", "class": 0}, {"text": "You first year kiddies might not understand but the guy who told Dan is in the wrong and the other guys who asked why are in the right.  The top schools like MIT encourage studying leaked questions like this.  Work smart not hard.", "class": 0}, {"text": "lol @ the downvotes, well deserved imo", "class": 1}, {"text": "MIT has a similar academic punishment rate to us, they take this just as seriously.", "class": 0}, {"text": "Dan already knew, it was pointless.", "class": 0}, {"text": "From your post history I gather you're implicated in this cheating scandal, will soon (hopefully) be expelled, and you seem to be struggling with your sexuality. You should lay off using the word faggot for everything, it reeks of projection. ", "class": 0}, {"text": "gotta remember that (u*v)v / ||v||^2 somehow", "class": 1}, {"text": "Well memed mein freund", "class": 1}, {"text": "lol please tell me where MIT encourages studying leaked versions of the final they're about to write.", "class": 0}, {"text": "That's pretty sad imo. Instead of learning how to solve something you just learn the steps to solve a few particular questions? Even if you do get by with that you'll be fucked later on when you can't do harder shit. Yes it's \"smart\", but it won't help you in the long run.", "class": 0}, {"text": "Why the fuck do I have a rate limit on posting.\n\nYou use that saved time to research whatever you're interest in lmao.  The dumbest thing you can do is just learn what you're taught.  ", "class": 0}, {"text": "You have a rate limit because your account is new and you have a history of low quality comments. Take a hint, maybe?", "class": 0}, {"text": "why are you in university? If you just didn't take classes you'd save 100% of that time to research whatever you're interested in. Plenty of places will hire people without university degrees (or at least, a college degree, which would still save lots of time)", "class": 0}, {"text": "> Not enough places hire people without degrees\n\nUh, ever heard of risk management? Or like... jobs that actually require knowledge?\n\nGL @ McDonalds m8", "class": 1}, {"text": "What? How would getting a degree make you a less desirable candidate? ", "class": 0}, {"text": "Read your comment again.\n\n> Not enough places hire people **without degrees**\n\nUnless your misunderstanding is something else, I don't get it. My comment is really straight-forward, and I never implied getting a degree makes you less desirable. ", "class": 0}, {"text": "dont eat bait", "class": 1}, {"text": "But the top post of all time is a well-structured joke: https://www.reddit.com/r/uwaterloo/comments/4eq6y9/international_student_struggling_with_learning/", "class": 0}, {"text": "that only means that the so-called well-written, structured, original joke is bad and unfunny ", "class": 0}, {"text": "DANK MEMES", "class": 1}, {"text": "DANK MEMES", "class": 1}, {"text": "DANK MEMES", "class": 1}, {"text": "DANK MEMES CAN'T MELT JET FUEL.", "class": 1}, {"text": "DANK MEMES", "class": 1}, {"text": "That's what you get for storing your adjectives in arrays.", "class": 0}, {"text": "The edginess of this post gave me a cancer", "class": 1}, {"text": "DANK DREAMS", "class": 1}, {"text": "Designated shitposting subreddit", "class": 1}, {"text": "DON'T FORGET:\n\nYOU'RE HIME\n\nFOREVER", "class": 1}, {"text": "*I'm a pretty princess*", "class": 1}, {"text": "Post is seriously lacking in Doug Harder.", "class": 1}, {"text": "    F E R I D U N   H A M D U L L A H P U R\n    E               A\n    R               M\n    I               D\n    D               U    \n    U               L\n    N               L\n                    A\n                    H\n                    P\n                    U\n                    R", "class": 1}, {"text": "    \n             /  (  (  (  (  (  (  (  (  (  (  (  (\\_\n           _/ `. `. `. `. `. `. `. `. `. `. `. `. `.\\_\n          /  )  )  )  )  )  )  )  )  )  )  )  )  )  ) \\_\n         / .' .' .' .' .' .' .' .' .' .' .' .' .' .' .' \\_\n        | (  (  (  (  (  (  (  (  (  (  (  (  (  (  (  (  \\_\n        |. `. `. `. `. `. `. `__`__`__`__`. `. `. `. `. `. `\\_\n         \\)  )  )  )  )__)__)/           \\_)__)  )  )  )  )  )\\_\n          |.' .' .' .'/                       \\.' .' .' .' .' .'\\_\n          |  (  (  ( /                         \\ (  (  (  (  (  ( \\\n          |`. `. `. |                           \\ `. `. `. `. `. `.\\\n          |  )  )  )|                            \\  )  )  )  )  )  )|\n          |.' .' .' |                             \\' .' .' .' .' .' |\n          |  (  (  (|  ______         _____        |(  (  (  (  (  (|\n          |`. `. `. | /______)       (_____\\       | `. `. `. `. `. |\n          |  )  )  )|//                    \\\\_      \\  )  )  )  )  /\n           \\' .' .' |  _____          _____          |'__' .' .' ./\n            |(  (  (| ( [O] )        ( [O] )         |/  \\(  (  ((\n            | `. `. |  \\___/          \\___/             \\ |`. `. `\\\n             \\_ )  )|          ,                        / |  )  )  \\\n               \\ .' .\\        |   .                      / .' .' .' \\\n                \\_ (  |      (     )                 |\\_/ (  (  (  ( )\n                  \\ `.|       \\___/                  |. `. `. `. `__/\n                   \\__|                              | )  )  ) __/\n                      |      _______                 |' .' .__/\n                      |    _/////\\\\\\\\____          _/.\\____/_____\n                      |   ///////\\\\\\\\\\\\\\\\\\        / |.|\\,%\\,%\\,%\\\\_______\n                       \\ |///////\\\\\\\\\\\\\\\\\\|     _/  |.|\\%,\\%,\\%,\\%,\\%,\\%,\\____\n                        \\   \\__________/       /   /. |%\\,%\\,%\\,%\\,%\\,%\\,%\\,%\\\n                       __\\                    /   /. /%,\\%,\\%,\\%,\\%,\\%,\\%,\\%,\\\n                     _/%\\,\\_               __/   /. /%\\,%\\,%\\,%\\,%\\,%\\,%\\,%\\,%\n           _________/%\\,%\\,%\\_         ___/    _/. /\\,%\\,%\\,%\\,%\\,%\\,%\\,%\\,%\\,\n         _/%,\\%,\\%,\\%,\\%,\\%/XX\\_______/      _/. ./,\\%,\\%,\\%,\\%,\\%,\\%,\\%,\\%,\\%\n      __/,%\\,%\\,%\\,%\\,%\\,%/XXXXX\\_        __/. ./%\\,%\\,%\\,%\\,%\\,%\\,%\\,%\\,%\\,%\\\n     /%,\\%,\\%,\\%,\\%,\\%,\\%/XXXXXXXX\\      /. . ./%,\\%,\\%,\\%,\\%,\\%,\\%,\\%,\\%,\\%,\\", "class": 1}, {"text": "Meme", "class": 1}, {"text": "I would do anything for him. ", "class": 1}, {"text": "[somewhat related](https://www.youtube.com/watch?v=-Ovs1Aevukc#t=20s)", "class": 1}, {"text": "Everything you have, everything you are, you've got to give.\n", "class": 1}, {"text": "Who is this guy? ", "class": 0}, {"text": "gtfo", "class": 1}, {"text": "Yes, mi'lord", "class": 1}, {"text": "Ah, I see, another OC shitpost.", "class": 1}, {"text": "i am so moist", "class": 1}, {"text": "Not a ECE fiend but after reading too much of this subreddit I too will circlejerk to Sedra.", "class": 1}, {"text": "> Sedra\n\ny r u do this?", "class": 1}, {"text": "*Sedra Smith ", "class": 1}, {"text": "I think this sub is the best damn sub in the world. ", "class": 0}, {"text": "these are the words that would be proclaimed by someone who went to subway after a rave.", "class": 0}, {"text": "[What I imagine is happening.](http://imgur.com/v6Dsuox)", "class": 1}, {"text": "Tell me some more nursery rhymes Mr. Goose", "class": 1}, {"text": "\"U WOT m8!? Are ya loonie? I ain't fookin no frenchies! Ur mum is gettin' rekt, duck duck goose style\"", "class": 1}, {"text": "rip young boy", "class": 1}, {"text": "This is too good", "class": 1}, {"text": "There's never just one.", "class": 1}, {"text": "Some people say some images are still saying Waterloo. I suspect caching.\n\n¯\\\\\\_(ツ)_/¯\n\n\nEDIT: Ceased and desisted. It was a good run everyone!", "class": 1}, {"text": "Shitty. Post the cease and desist? I wonder if it has any legal backing", "class": 1}, {"text": "I'd rather not post it. I figure there's some legal backing behind it.\n\nTo be vague, part of it mentioned that \"_it presents a security risk, given there are active 'Log in' buttons on the site._\"", "class": 0}, {"text": "I understand your concerns. You might want to get it looked it. Things like that can often be used for intimidation rather than have actual legal backing. ", "class": 0}, {"text": "RIP UWaterpoo", "class": 1}, {"text": "Nice, you've already been [indexed](https://www.google.ca/search?q=site%3Auwaterpoo.ca) by [Google](http://i.imgur.com/7oAgEhX.png). This is going places.\n\nThis may just be the most disruptive side-project the Waterloo administration has ever seen..", "class": 0}, {"text": "This is Synergy VC, the premier VC for disruptive Waterpoo startups. We'd like to invest. Send us your pitch decks.", "class": 1}, {"text": "i am an highschool student with a top six of 94%.  is that enough to get accepted to Bidet Engineering?", "class": 1}, {"text": "No, 6% short", "class": 0}, {"text": "Flaired this as humor...might change to the other option depending on comments. ", "class": 1}, {"text": "Changed my mind.", "class": 0}, {"text": "https://uwaterpoo.ca/copyright might qualify as `such meme`", "class": 1}, {"text": "I saw a sign for uwaterpoo.ca above the DC library entrance. I sat down in the library, went to the site and thought it was jokes. Then I thought I'd see if there was a Reddit thread on this and sure enough there was. I find your comment, click on the link, and my volume happened to be on full blast......", "class": 1}, {"text": "RIP my ears", "class": 1}, {"text": "Is waterpoo just diarrhea?", "class": 1}, {"text": "university of diarrhea", "class": 1}, {"text": ">campuses\n\n>Waterpoo believes that answers will be found by building bridges between disciplines, between institutions and between nations\n\nfuckin lost", "class": 1}, {"text": "[[Over Quota Intensifies]]", "class": 1}, {"text": "Savages. I'll tend to it soon.\n\nEDIT: Back up.", "class": 1}, {"text": "Currently down again.\n\n[[Over Quota Intensification Intensifies]]", "class": 1}, {"text": "A waterloo student owns http://fart.website\n\nI only know this because one day I woke up and navigated to it, curious if it exists (was thinking of the clownpenis.fart SNL skit)", "class": 1}, {"text": "http://aircanadia.ca", "class": 1}, {"text": "2034 is a long time. do you think this company will be a worthwhile investment?", "class": 0}, {"text": "    P O O I N L O O\n    O\n    O\n    I\n    N\n    L\n    O\n    O", "class": 1}, {"text": "nice meme", "class": 1}, {"text": "D E S I G N A T E D\n\nE\n\nS\n\nI\n\nG\n\nN\n\nA\n\nT\n\nE\n\nD", "class": 1}, {"text": "don't say this here ppl will be angry", "class": 1}, {"text": "It's #tru tho", "class": 1}, {"text": "nah I'm laughing my ass off", "class": 1}, {"text": "What the fuck", "class": 1}, {"text": "Needs more pooninos.", "class": 1}, {"text": ">university of waterLoo on home page\n\nfix that", "class": 1}, {"text": "WATER \n\nWATER \n\nWATER\n\nPOO \n\nPOO\n\nPOO", "class": 1}, {"text": "http://imgur.com/CP1MMXO\n\nYou forgot something.", "class": 1}, {"text": "Hard to catch that with 'Find and Replace'.", "class": 0}, {"text": "Check out the About Waterpoo page. They put in more effort than I was expecting haha.", "class": 1}, {"text": "Ha, took me a second to notice. Very nice.", "class": 0}, {"text": "Over quota -_-", "class": 1}, {"text": "[I picked a random page.](https://uwaterpoo.ca/alumni/blog/post/why-uwaterpoo-allowed-me-be-crazy-innovative) How did you do this? The whole entire school website!", "class": 1}, {"text": "[deleted]", "class": 1}, {"text": "I strive to find the intersection between great programming and great design. With 3 years or so of experience in the Android world, I've come to realize that learning never stops, and that's what keeps me sharp.", "class": 0}, {"text": "P O O\n\nO\n\nO", "class": 1}, {"text": "wonder what the demographics of those 9001 are\n\n100% dank memers no doubt", "class": 1}, {"text": "1 dank memer checking in", "class": 1}, {"text": "1 dank memer checking in", "class": 1}, {"text": "1 dank memer checking in", "class": 1}, {"text": "1 dank memer checking in", "class": 1}, {"text": "1 dank memer checking in", "class": 1}, {"text": "1 dank memer checking in", "class": 1}, {"text": "1 dank memer checking in", "class": 1}, {"text": "300% throwaways", "class": 1}, {"text": "300% disruptive units", "class": 1}, {"text": "Half the posts here are throwaways though", "class": 0}, {"text": ">implying a throwaway account would subscribe", "class": 1}, {"text": "Idk man, if you had a throwaway \"/r/uwaterloo\" account, subscribing to the sub wouldn't be a bad option.", "class": 1}, {"text": "We are now the 3rd largest university subreddit. Compared against these ones at least \nhttp://www.redditblog.com/2011/11/grow-college-subreddit-competition.html", "class": 0}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "T^h^^a^^^n^^k^s m^o^^t^^^h^^e^r g^o^^o^s^e", "class": 1}, {"text": "thank mother goose", "class": 1}, {"text": "Thank mother goose", "class": 1}, {"text": ">my chair is squeaky but i'm too awkward to move to another seat\n\nstory of my life tbh", "class": 1}, {"text": "I lost it at that", "class": 0}, {"text": "no mention of disruption? D O W N V O T E D^^^^^^^^^^^^^^jk", "class": 1}, {"text": "y-you too", "class": 1}, {"text": "w-where is my gentoo hardened??", "class": 1}, {"text": "wow you normies sure hate linux", "class": 1}, {"text": ">>implying everyone browsing /r/uwaterloo is in math/eng", "class": 1}, {"text": ">Implying you need to be in math/eng to code. ", "class": 1}, {"text": "Don't need to be in eng math to be a #disruptive #innovator", "class": 1}, {"text": "they aren't?", "class": 0}, {"text": "we're all math/eng here anon", "class": 0}, {"text": "More like goldpost, because this shit is fucking gold!  Epitome of a typical CS douchebag.", "class": 0}, {"text": "God you make me feel like such a faggot :C", "class": 1}, {"text": "You can't bring motorcycles in the library at UW.", "class": 0}, {"text": "the memes are getting danker by the hour", "class": 1}, {"text": "thank mr goose", "class": 1}, {"text": "thank", "class": 1}, {"text": "One small bite for man, one giant meme for paninokind", "class": 1}, {"text": "uuuuuuuuuuuu JOHN MADDEN JOHN MADDEN aeiou", "class": 1}, {"text": "~ I will sing my way off the moon! ~", "class": 1}, {"text": "♫Flyyyyy me to the moon, and let me siiiiing among the stars♫", "class": 1}, {"text": "Just do a PsBattle or something so that all these Panino shitposts are combined into one.", "class": 1}, {"text": "quality shitpost", "class": 1}, {"text": "go to health services", "class": 0}, {"text": "I was a backend engineering intern last term! Didn't really work out cause I had more frontend experience.", "class": 0}, {"text": "[Aaaaaaahhahaha](https://media.giphy.com/media/imJROsRKwBdeg/giphy.gif)", "class": 1}, {"text": "/u/Katie_Pornhub should be able to help. ", "class": 0}, {"text": "Sweet, welcome to the team OP", "class": 0}, {"text": "Holy shit, would it actually be possible for one of us to intern at Pornhub?", "class": 0}, {"text": "OP is probably telling the truth, our team had two interns in the summer. One of them is still working part time. ", "class": 0}, {"text": "Do you guys actually show up as 'PornHub' on university/college job listings? Or do you go by a different name?", "class": 0}, {"text": "Probably would show up as [MindGeek](https://en.wikipedia.org/wiki/MindGeek)", "class": 0}, {"text": "Yup", "class": 0}, {"text": "GOTEM", "class": 1}, {"text": "hook me up with premium?", "class": 0}, {"text": "Imagine if your \"webdev\" job involved reading the comments left on the videos all day.\n\n", "class": 1}, {"text": "Do you have a picture of Pornhub on Jobmine? I'm amazed Pornhub is on Jobmine... I really wanna see this\n", "class": 0}, {"text": ">being this new", "class": 1}, {"text": "Posting is still up [http://imgur.com/xw3wL4d](https://youtu.be/dQw4w9WgXcQ)", "class": 1}, {"text": "I actually wanted to see the post", "class": 0}, {"text": "\"Hmm let's see here.... can't be a Rick roll *clicks link* 😬 you fuck!\"", "class": 1}, {"text": "[](/goose)", "class": 1}, {"text": "http://i.imgur.com/6uqeBeN.jpg", "class": 1}, {"text": "What if your parents ask you where you'll be working? Won't that be an awkward conversation?", "class": 1}, {"text": "/u/removebaklava worked there last term actually. You should ask him (y)", "class": 0}, {"text": "Unfortunately, I worked remotely so I may not be able to answer questions on the work culture there.", "class": 0}, {"text": "http://www.pornhub.com/win/intern\nHuh, there is actually a website for internship", "class": 0}, {"text": "Different type of internship haha", "class": 0}, {"text": "What do they have you do? lmao", "class": 0}, {"text": "Don't let your dreams be dreams!", "class": 0}, {"text": "Yesterday, you said tomorrow.", "class": 0}, {"text": "don't let your WET dreams be WET dreams", "class": 1}, {"text": "How many of you guys applied as a penetration tester? The interview competition was intense!", "class": 1}, {"text": "Did it involve a black couch? ", "class": 0}, {"text": "Lots of parties with pornstars according to my friend who worked there. Montreal too.", "class": 0}, {"text": "Thrusting Motion Analyst \n\nMindgeek (Pornhub), Montreal, Canada        \nJan - Apr 2016\n\n-Worked under one of the most prestigious institution in adult video production and gained valuable insights of the industry.\n\n-Performed daily penetration reconciliations.\n\n-Demonstrated strong orgynization skills and teamwork.\n\n-Analyzed viewer data and used advanced excel skills to compile it into readable format for financial reporting purposes.\n\n-Responsible for supply delivery: acquisition, replacement and usage of various dildos, vibrators, and other toys that may be utilized for video dramatic enhancement.", "class": 0}, {"text": "Did they actually have postings on jobmine? WTF thats incredible.", "class": 0}, {"text": "A student who hasn't even started preaching to a 4B student about study methods.\n\nWhat a time to be alive.", "class": 0}, {"text": "Yeah but u need the indian consulate to submit a \"im okay with you skipping the two years\" declaration. And for that u need 3 forms from 3 different ministries.\n\nRed tape max\n", "class": 0}, {"text": "Thank you it'd be great if u got back to me", "class": 0}, {"text": "I would be okay with that but i think i would need at least one or 2 states coops to cover my fees", "class": 0}, {"text": "huh... this was taken 3 years ago, and I'm wearing the same shirt toady\n\nhow'd it get here...", "class": 0}, {"text": "Practice. Lots of practice and learning when to use what proof in what scenario. ", "class": 0}, {"text": "Go to Burger King", "class": 1}, {"text": "I was on a Japanese forum on a thread about movies, and found that picture lol", "class": 0}, {"text": "Dan Wolczuk usually writes the exams but Rubinstein is doing it this term and he doesn't like putting any computation on his exams. He said his exams are going to be really different from Dan's. His questions are usually hit or miss type questions, judging from the midterm.", "class": 0}, {"text": "https://www.rte.ie/news/2015/0818/722082-donald-trump-immigration/\n\n\"He said the scheme will be \"terminated and replaced with a resume bank for inner city youth provided to all corporate subscribers\" to the J1 visa programme.\"", "class": 0}, {"text": "Between Hillary \"Bosnian Sniper' Clinton and Donald \"Build the Wall!!' Trump, I'm just having a great time with US politics", "class": 1}, {"text": "b-but it's still there o.O", "class": 1}, {"text": "Do textbook questions!! I thought I could do great without studying. Ended up reading my notes until 6 am, and slept 40 minutes into the exam. 52%.\n\nThe EasyAce fiasco bumped my mark to 57% though :\\^)", "class": 0}, {"text": "That...can't be healthy.", "class": 0}, {"text": "[niceme.me](http://niceme.me)", "class": 1}, {"text": "Nowhere if you keep speaking like that.", "class": 1}, {"text": "101 was useful 😱", "class": 1}, {"text": "Waterloo has the best Trump supporters ever. The problem with elaborating is that if we tell you right now, everyone is going to say \"wow, what a great idea.\" You are going to have 10 uoft kids who are going to use it and they are going to forget where it came from, which is UW. We have so many awesome trump supporters. We have them all over the place. We hire supporters, it costs us three dollars.", "class": 1}, {"text": "I took it a year ago and there were a good number of proofs on it. Personally I find the best way if you struggle with proofs is to do as many as you can. Find questions from the textbook, do the assignments over, wherever you can pull relevant problems from. The reason I find it useful is it builds an intuition which really helps when it comes to a time crunch like the exam. I find the hardest part of proofs is choosing where to start and having a sort of intuition is priceless for this, especially when time is a factor.\n\nGood luck.", "class": 0}, {"text": "Panino's a lad", "class": 1}, {"text": "Jesus christ just pick something no one will give up a fuck about your project anyway", "class": 0}, {"text": "Focus by taking away distractions while you're studying. No video games or TTC shows or anything else that'll be a time sink; you want to spend the most time studying possible.  \nLearn from others' mistakes. Do proofs (obviously) and look at flawed proofs to see if you can point out the mistakes.  \nFight when you get to the exam - it'll be hard but push through - don't even think about the result, concentrate on giving it your all and relax when it's over.", "class": 0}, {"text": "If you need help now, please check out [UW's list of emergency numbers](https://uwaterloo.ca/counselling-services/emergency-numbers). Some of the phone numbers can be reached 24/7. Please do not message the moderators regarding this question.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/uwaterloo) if you have any questions or concerns.*", "class": 0}, {"text": "[dis one](http://static.fjcdn.com/large/pictures/d5/5b/d55b85_5500518.jpg)", "class": 1}, {"text": "isn't that a pornography", "class": 1}, {"text": "You're a good person.", "class": 0}, {"text": "...hardace?", "class": 1}, {"text": "ber-nii san is best onii-chan though", "class": 1}, {"text": ">downvoting memes\n\nsacrilege", "class": 1}, {"text": "Rubinstein's exams are generally not too bad. The first 90% of the questions are usually quite easy, the last 10% are very tricky though.", "class": 0}, {"text": "Also, he (and his TAs) are quite generous with part marks if you show your work and it was in the correct direction", "class": 0}, {"text": "I've been a Trump supporter since day 1 and I don't give a rat's badunkadunk what anyone says or thinks about that.", "class": 1}, {"text": "ty m8", "class": 1}, {"text": "SLC 3rd floor , pretty decent spot", "class": 0}, {"text": "lol yeah. When I started CS co-op in 2007 as an international student, it was 8800 per term. By 2012 it was up to 11000 I think. I am sad they haven't stopped it yet. The only way for you to deal with this is to get a co-op job and make lots of $$$. It definitely helps because CS jobs pay a lot.", "class": 0}, {"text": "If you call \"not wanting Hillary as president\" as support for Trump, then yes. I don't support many of his policies, but compared to the lying corrupt snake that is Hillary I'd take Trump any day. \n\nI don't believe Trump can do much harm anyway, congress will jump on the chance to shut him down if he tries.", "class": 0}, {"text": "well at least for cs if that 58 is pre-curve you did relatively well compared to the rest of the class so you've got that going", "class": 0}, {"text": "PD", "class": 0}, {"text": "mfw this is me literally this second", "class": 1}, {"text": "Work, then PD, then vidya", "class": 0}, {"text": "What sort of discipline will /u/NotAHotPocketAddict face if his employer learns of his activities?\n", "class": 0}, {"text": "/u/Just__Do__It", "class": 1}, {"text": ">58 in CS 246\n\nbruh chill that's higher than me", "class": 1}, {"text": "Then hentai?", "class": 1}, {"text": "Nothing, because my boss is pretty chill. Pretty lucky here.\n\n", "class": 0}, {"text": "no, game of thrones 3D > shitty nipponese 2D", "class": 1}, {"text": "It's an Honours Math course, so it's going to be mostly proof stuff, as you will probably expect. Make sure you can invert, find determinants, find adjugate matrices, and diagonalize in your sleep. Don't lose marks on computation, because unless you are a genius there are going to be proofs that will have you stumped. Know your main theorems like invertible matrix theorem. GL, and for the love of paninos may mr goose smile upon you.", "class": 0}, {"text": "Can't stump won't stump\n\nNo brakes on this train", "class": 1}, {"text": "Probably because he got fired?", "class": 0}, {"text": "spoiler alert it's not easy at all for the rest of us\n\nbut seriously tho take a short breather before trying to get back to studying, it sounds like you're just burning out right now.", "class": 0}, {"text": "Who tf studies in the library? DC is a literal bazaar.", "class": 1}]}